// Аппаратное обеспечение ПК ИСР-221
// Сгенерировано автоматически: 29.12.2025, 16:28:58
// Всего вопросов: 500

const hardwareISR221Questions = [
  {
    "question": "Что такое ЭВМ?",
    "options": [
      "Электронное устройство для создания чертежей",
      "Комплекс технических средств только для управления ресурсами сети",
      "Комплекс программных средств для обработки данных",
      "Комплекс технических средств для автоматической обработки информации",
      "Комплекс программных средств для автоматической обработки информации"
    ],
    "correct": 3
  },
  {
    "question": "Для чего предназначено АЛУ?",
    "options": [
      "Только для передачи информации в ПЗУ",
      "Только для автоматизации управления информацией и передачи данных в сети",
      "Для редактирования данных, ввода информации в ПЗУ и передачи числовой информации на временные накопители",
      "Для выполнения арифметических и логических операций над числовой и символьной информацией",
      "Для выработки сигналов и последующего представления их в двоичном виде"
    ],
    "correct": 3
  },
  {
    "question": "ЭВМ по принципу Фон Неймана состоит из:",
    "options": [
      "мыши, монитора и принтера",
      "только из ОЗУ и ПЗУ",
      "дисплея, видеокарты и принтера",
      "АЛУ, УУ, памяти и устройств ввода-вывода",
      "процессора, ОЗУ и монитора системных транзакций"
    ],
    "correct": 3
  },
  {
    "question": "Перфокарты впервые стали использоваться в:",
    "options": [
      "счетной машине Лейбница",
      "для переписи населения",
      "в ПК",
      "в ЭВМ",
      "ткацких станках"
    ],
    "correct": 4
  },
  {
    "question": "Принцип открытости архитектуры ЭВМ означает:",
    "options": [
      "модульность",
      "мобильность",
      "качество",
      "надежность",
      "быстроту"
    ],
    "correct": 0
  },
  {
    "question": "Какое высказывание верно?",
    "options": [
      "Принтер является основным устройством ввода",
      "RAM – read access memory",
      "ЦП является внутренним устройством ПК",
      "ОЗУ является постоянной памятью",
      "ОЗУ состоит из НГМД и НЖМД"
    ],
    "correct": 2
  },
  {
    "question": "Что такое системный интерфейс?",
    "options": [
      "Совокупность всех блоков ЭВМ, включая системные шины и устройства вывода",
      "Совокупность всех физических накопителей ЭВМ",
      "Совокупность универсальной магистрали, электронных ламп ЭВМ, управляющих сигналов и т. П",
      "Совокупность всех адресов основной памяти ЭВМ",
      "Совокупность унифицированной магистрали, электронных схем, управляющих прохождением сигналов по шинам и т. П"
    ],
    "correct": 4
  },
  {
    "question": "Какой принцип Фон Неймана обуславливает хранение программ и данных одной памяти?",
    "options": [
      "Принцип однородности памяти",
      "Принцип условного перехода",
      "Принцип программного управления",
      "Принцип адресуемости памяти",
      "Принцип использования двоичной системы счисления"
    ],
    "correct": 0
  },
  {
    "question": "Какой принцип Фон Неймана обуславливает последовательное выполнение команд программы?",
    "options": [
      "Принцип однородности памяти",
      "Принцип использования двоичной системы счисления",
      "Принцип адресуемости памяти",
      "Принцип программного управления",
      "Принцип условного перехода"
    ],
    "correct": 3
  },
  {
    "question": "Какой принцип Фон Неймана обуславливает деление памяти на ячейки?",
    "options": [
      "Принцип программного управления",
      "Принцип использования двоичной системы счисления",
      "Принцип условного перехода",
      "Принцип адресуемости памяти",
      "Принцип однородности памяти"
    ],
    "correct": 3
  },
  {
    "question": "Какой принцип Фон Неймана обуславливает представление данных в двоичном виде?",
    "options": [
      "Принцип использования двоичной системы счисления",
      "Принцип однородности памяти",
      "Принцип программного управления",
      "Принцип условного перехода",
      "Принцип адресуемости памяти"
    ],
    "correct": 0
  },
  {
    "question": "Мэйнфреймы – это …",
    "options": [
      "ноутбуки",
      "малые компьютеры",
      "смартфоны",
      "персональные компьютеры",
      "большие компьютеры"
    ],
    "correct": 4
  },
  {
    "question": "К какому классу ЭВМ по вычислительной мощности относят персональные компьютеры:",
    "options": [
      "К большим серверам",
      "К ноутбукам",
      "К микрокомпьютерам",
      "К большим компьютерам",
      "К супер ЭВМ"
    ],
    "correct": 2
  },
  {
    "question": "По назначению ЭВМ классифицируют на:",
    "options": [
      "проблемно-ориентированные и узкоспециализированные",
      "универсальные, проблемно-ориентированные и управляемые",
      "персональные компьютеры и корпоративные компьютеры",
      "супер ЭВМ , малые ЭВМ и микро ЭВМ",
      "универсальные, проблемно-ориентированные и специализированные"
    ],
    "correct": 4
  },
  {
    "question": "На какие виды делятся ЭВМ по размерам и вычислительной мощности?",
    "options": [
      "На универсальные, специализированные и переносные",
      "Только на супер ЭВМ и микро ЭВМ",
      "На супер ЭВМ, малые ЭВМ, большие ЭВМ, микро ЭВМ",
      "Одноядерные и многоядерные",
      "Pentium 1, Pentium 2, Pentium 3…"
    ],
    "correct": 2
  },
  {
    "question": "Какое самое главное и принципиальное отличие вычислительных машин разных поколений?",
    "options": [
      "Габариты",
      "Емкость ОЗУ",
      "Элементная база",
      "Быстродействие",
      "Стоимость"
    ],
    "correct": 2
  },
  {
    "question": "Что такое интегральная схема?",
    "options": [
      "Электронная схема специального назначения, выполненная в виде электронных ламп",
      "Электронная схема специального назначения, выполненная в виде интегрированных элементов , объединяющего большое число активных запоминающих устройств",
      "Электронная схема специального назначения, выполненная в виде полупроводникового кристалла, объединяющего большое число процессоров",
      "Электронная схема специального назначения, выполненная в виде нейро-кристалла, объединяющего большое число активных элементов (нейронов)",
      "Электронная схема специального назначения, выполненная в виде полупроводникового кристалла, объединяющего большое число активных элементов (транзисторов и диодов)"
    ],
    "correct": 4
  },
  {
    "question": "Какой была элементная база первого поколения ЭВМ?",
    "options": [
      "Нейросистемы",
      "Интегральные схемы",
      "Металл-оксидные полупроводники",
      "Механические переключатели",
      "Электронные вакуумные лампы"
    ],
    "correct": 4
  },
  {
    "question": "Элементная база второго поколения (1960е годы) - это …",
    "options": [
      "интегральные схемы",
      "электронные лампы",
      "транзисторы",
      "большие интегральные схемы",
      "нейроны"
    ],
    "correct": 2
  },
  {
    "question": "Элементная база третьего поколения(1970е годы) - это …",
    "options": [
      "электронные лампы",
      "транзисторы",
      "большие интегральные схемы",
      "интегральные схемы",
      "нейроны"
    ],
    "correct": 3
  },
  {
    "question": "Элементная база четвертого поколения(1980е годы) - это…",
    "options": [
      "интегральные схемы",
      "нейроны",
      "транзисторы",
      "большие интегральные схемы",
      "электронные лампы"
    ],
    "correct": 3
  },
  {
    "question": "Абак - это:",
    "options": [
      "ЭВМ",
      "супер ЭВМ",
      "счеты",
      "электронный калькулятор",
      "ноутбук"
    ],
    "correct": 2
  },
  {
    "question": "Какое поколение ЭВМ будет пользоваться популярностью в будущем?",
    "options": [
      "ЭВМ, использующие атомное деление в качестве ЗУ",
      "ЭВМ на интегральных схемах",
      "Нейрокомпьютеры",
      "Электронно-ламповые ЭВМ",
      "ЭВМ на транзисторах"
    ],
    "correct": 2
  },
  {
    "question": "Классификация ПЭВМ по конструктивным особенностям:",
    "options": [
      "большие ЭВМ, малые ЭВМ",
      "микро ПК и макро ПК",
      "простые и сложные",
      "цифровые и аналоговые",
      "стационарные (настольные) и переносные"
    ],
    "correct": 4
  },
  {
    "question": "В 50-е годы началось … поколение ЭВМ.",
    "options": [
      "электронно-ламповое",
      "интегральных схем",
      "CMOS",
      "нейронное",
      "абак"
    ],
    "correct": 0
  },
  {
    "question": "Что такое “ENIAC”?",
    "options": [
      "Электронный делитель данных в нумерованной форме",
      "Электронный непрограммируемый калькулятор",
      "Электронный маршрутизатор данных",
      "Электронный числовой интегратор и вычислитель",
      "Электронный числовой интерпретатор и вычислитель"
    ],
    "correct": 3
  },
  {
    "question": "Период первого поколения ЭВМ:",
    "options": [
      "1980-1990-е годы",
      "1930-1940-е годы",
      "1950-1960-е годы",
      "1990-2000-е годы",
      "1880-е годы"
    ],
    "correct": 2
  },
  {
    "question": "Период второго поколения ЭВМ:",
    "options": [
      "1960-1970-е годы",
      "1880-е годы",
      "1950-1960-е годы",
      "1990-е годы",
      "1930-е годы"
    ],
    "correct": 0
  },
  {
    "question": "Период третьего поколения ЭВМ:",
    "options": [
      "1960-1970-е годы",
      "1950-1960-е годы",
      "1930-е годы",
      "1970-1980-е годы",
      "1880-е годы"
    ],
    "correct": 3
  },
  {
    "question": "Для чего разрабатывался “Colossus” Аланом Тьюрингом?",
    "options": [
      "Для счета в восьмеричной системе счисления",
      "Для расшифровки перехваченных сообщений немецких войск",
      "Для научных опытов",
      "Для «колоссальных» подсчётов",
      "Для расшифровки перехваченных сообщений российских войск"
    ],
    "correct": 1
  },
  {
    "question": "Кто описал машину для суммирования чисел в 1642 году?",
    "options": [
      "Шоккли",
      "Фон Нейман",
      "Аристотель",
      "Алан Тьюринг",
      "Паскаль"
    ],
    "correct": 4
  },
  {
    "question": "В каком году Блез Паскаль описал машину для суммирования чисел?",
    "options": [
      "1422",
      "1946",
      "1642",
      "1977",
      "1822"
    ],
    "correct": 2
  },
  {
    "question": "В каком году Джоном Непером была создана деревянная машина для простейших вычислений?",
    "options": [
      "1617",
      "1904",
      "1946",
      "1943",
      "1546"
    ],
    "correct": 0
  },
  {
    "question": "В каком году Ли Ди Форест запатентовал вакуумный триод?",
    "options": [
      "1946",
      "1943",
      "1906",
      "1546",
      "1642"
    ],
    "correct": 2
  },
  {
    "question": "Кто запатентовал первый вакуумный триод?",
    "options": [
      "Фон Нейман",
      "Буль",
      "Паскаль",
      "Ли Ди Форест",
      "Шоккли"
    ],
    "correct": 3
  },
  {
    "question": "В каком году была создана машина ENIAC?",
    "options": [
      "1906",
      "1988",
      "1946",
      "1899",
      "1978"
    ],
    "correct": 2
  },
  {
    "question": "Кто в 1642 году описал машину для суммирования чисел?",
    "options": [
      "Чарльз Бэббидж",
      "Аристотель",
      "Аттанасов",
      "Уильям Шоккли",
      "Блез Паскаль"
    ],
    "correct": 4
  },
  {
    "question": "Когда была придумана первая вычислительная машина?",
    "options": [
      "1945",
      "1822",
      "1946",
      "1906",
      "1888"
    ],
    "correct": 1
  },
  {
    "question": "Назовите первую ЭВМ, изобретённую в 1937 году.",
    "options": [
      "Компьютер Атанасова-Берри (ABC)",
      "Motorola-PC",
      "EMIAC",
      "IBM-PC",
      "ENIAC"
    ],
    "correct": 0
  },
  {
    "question": "В каком году была создана первая ЭВМ – АВС?",
    "options": [
      "1958",
      "1646",
      "1937",
      "1822",
      "1642"
    ],
    "correct": 2
  },
  {
    "question": "Первый программируемый компьютер был создан в…",
    "options": [
      "1937",
      "1642",
      "1646",
      "1978",
      "1822"
    ],
    "correct": 0
  },
  {
    "question": "Кто создал первую аналитическую вычислительную машину в 1822?",
    "options": [
      "Бэббидж",
      "Тьюринг",
      "Фон Нейман",
      "Шоккли",
      "Мошли"
    ],
    "correct": 0
  },
  {
    "question": "По принципу действия ЭВМ делятся на:",
    "options": [
      "цифровые, символьные",
      "гибридные, логические, комбинированные",
      "аналоговые, цифровые, гибридные",
      "аналоговые, гибридные",
      "логические, аналоговые"
    ],
    "correct": 2
  },
  {
    "question": "По поколениям персональные компьютеры делятся на:",
    "options": [
      "гибридные, логические, комбинированные",
      "4, 16, 128, 256-битовые",
      "8, 16, 32, 64-битовые",
      "1, 2, 3, 4, 5, 6-битовые",
      "аналоговые, гибридные и цифровые"
    ],
    "correct": 2
  },
  {
    "question": "Первое поколение ПК использовало:",
    "options": [
      "32-битовые микропроцессоры",
      "16-битовые микропроцессоры",
      "64-битовые микропроцессоры",
      "128-битовые микропроцессоры",
      "8-битовые микропроцессоры"
    ],
    "correct": 4
  },
  {
    "question": "Второе поколение ПК использовало:",
    "options": [
      "128-битовые микропроцессоры",
      "8-битовые микропроцессоры",
      "32-битовые микропроцессоры",
      "16-битовые микропроцессоры",
      "64-битовые микропроцессоры"
    ],
    "correct": 3
  },
  {
    "question": "Третье поколение ПК использует:",
    "options": [
      "128-битовые микропроцессоры",
      "32-битовые микропроцессоры",
      "16-битовые микропроцессоры",
      "8-битовые микропроцессоры",
      "64-битовые микропроцессоры"
    ],
    "correct": 1
  },
  {
    "question": "Четвёртое поколение ПК использует:",
    "options": [
      "32-битовые микропроцессоры",
      "64-битовые микропроцессоры",
      "128-битовые микропроцессоры",
      "8-битовые микропроцессоры",
      "16-битовые микропроцессоры"
    ],
    "correct": 1
  },
  {
    "question": "По каким признакам ЭВМ делятся на поколения?",
    "options": [
      "по способу организации вычислительного процесса",
      "По способности к параллельному выполнению программ",
      "По функциональным возможностям",
      "По назначению и принципу действия",
      "По этапам создания и элементной базе"
    ],
    "correct": 4
  },
  {
    "question": "Что будут использовать нейрокомпьютеры в качестве элементной базы?",
    "options": [
      "Нейронные ламповые триоды",
      "Нейронные небиологические транзисторы",
      "Нейронные биологические системы",
      "Большие интегральные схемы",
      "Нейронные большие интегральные схемы"
    ],
    "correct": 2
  },
  {
    "question": "Существует 2 вида программного обеспечения. Назовите их.",
    "options": [
      "Аналоговое, системное",
      "Прикладное и цифровое",
      "Прикладное и аналоговое",
      "Системное и прикладное",
      "Логическое, системное"
    ],
    "correct": 3
  },
  {
    "question": "Системное программное обеспечение –это:",
    "options": [
      "это программное обеспечение, лицензионное соглашение которого не требует каких-либо выплат правообладателю",
      "тип программного обеспечения, обусловленный особенностями распространения таких программ",
      "комплекс программ, предназначенных для выполнения определенных пользовательских задач",
      "широкий спектр программных решений, в которых права пользователя («свободы») на неограниченные установку, запуск, а также свободное использование, изучение, распространение и изменение",
      "комплекс программ, которые обеспечивают эффективное управление компонентами вычислительной системы"
    ],
    "correct": 4
  },
  {
    "question": "Прикладное программное обеспечение –это:",
    "options": [
      "комплекс программ, которые обеспечивают эффективное управление компонентами вычислительной системы",
      "тип программного обеспечения, обусловленный особенностями распространения таких программ",
      "это программное обеспечение, лицензионное соглашение которого не требует каких-либо выплат правообладателю",
      "комплекс программ, предназначенных для выполнения определенных пользовательских задач",
      "широкий спектр программных решений, в которых права пользователя («свободы») на неограниченные установку, запуск, а также свободное использование, изучение, распространение и изменение"
    ],
    "correct": 3
  },
  {
    "question": "Какой вид информации использует ЦВМ?",
    "options": [
      "Растровый",
      "Аналоговый",
      "Гибридный",
      "Цифровой",
      "Векторный"
    ],
    "correct": 3
  },
  {
    "question": "Какой вид информации использует АВМ?",
    "options": [
      "Цифровой",
      "Растровый",
      "Аналоговый",
      "Векторный",
      "Гибридный"
    ],
    "correct": 2
  },
  {
    "question": "Какой вид информации использует ГВМ?",
    "options": [
      "Векторный и растровый",
      "Аналоговый и цифровой",
      "Аналоговый и асинхронный",
      "Цифровой и синхронный",
      "Растровую и векторный"
    ],
    "correct": 1
  },
  {
    "question": "Дискретная информация – это …",
    "options": [
      "гибридная",
      "аналоговая",
      "векторная",
      "цифровая",
      "растровая"
    ],
    "correct": 3
  },
  {
    "question": "По принципу Фон Неймана данные и команды представлены в:",
    "options": [
      "двоичном виде",
      "троичном виде",
      "16-тиричной системе",
      "десятичном виде",
      "символах латинского алфавита"
    ],
    "correct": 0
  },
  {
    "question": "Назовите сигнал, область определения которого есть непрерывное пространство, то есть пространство, не являющееся дискретным.",
    "options": [
      "Аналоговый",
      "Логический",
      "Дискретный",
      "Сингулярный",
      "Цифровой"
    ],
    "correct": 0
  },
  {
    "question": "Назовите сигнал, область определения которого есть дискретное пространство.",
    "options": [
      "Сингулярный",
      "Аналоговый",
      "Логический",
      "Цифровой",
      "Дискретный"
    ],
    "correct": 3
  },
  {
    "question": "Что общего между машиной Бэббиджа, современным компьютером и человеческим мозгом?",
    "options": [
      "Способность обрабатывать числовую информацию",
      "Способность обрабатывать графическую информацию",
      "Способность обрабатывать видео информацию",
      "Способность обрабатывать звуковую информацию",
      "Способность обрабатывать текстовую информацию"
    ],
    "correct": 0
  },
  {
    "question": "Кто изобрёл двоичную систему счисления?",
    "options": [
      "Буль",
      "Абак",
      "Лейбниц",
      "Фон-Нейман",
      "Аристотель"
    ],
    "correct": 2
  },
  {
    "question": "Информация кодируется в двоичной форме и разделяется на единицы или элементы называемые …",
    "options": [
      "обращениями",
      "функциями",
      "словами",
      "кодами",
      "логикой"
    ],
    "correct": 2
  },
  {
    "question": "Способ именования и изображения чисел с помощью символов, имеющих определенные количественные значения называется …",
    "options": [
      "подсчетом знаков",
      "правописанием знаков",
      "предметом счисления",
      "исчислением знаков",
      "системой счисления"
    ],
    "correct": 4
  },
  {
    "question": "Двоичное представление данных основывается на …",
    "options": [
      "0 и 1",
      "2 и 0",
      "всех целых числах десятичной системы счисления",
      "10 и 0",
      "1 и 2"
    ],
    "correct": 0
  },
  {
    "question": "Вычислить сумму чисел 5126 и 456 в шестеричной системе.",
    "options": [
      "1001",
      "1004",
      "1005",
      "1420",
      "4220"
    ],
    "correct": 0
  },
  {
    "question": "Вычислить сумму чисел 5168 и 7778 в восьмеричной системе.",
    "options": [
      "1005",
      "1004",
      "1515",
      "1420",
      "4220"
    ],
    "correct": 2
  },
  {
    "question": "Вычислить сумму чисел 4A16 и F116 в восьмеричной системе.",
    "options": [
      "C12",
      "13B",
      "F15",
      "1A0",
      "F2"
    ],
    "correct": 1
  },
  {
    "question": "Вычислить сумму чисел 8876 и 4856 в девятеричной системе.",
    "options": [
      "1705",
      "1220",
      "1404",
      "1483",
      "1420"
    ],
    "correct": 3
  },
  {
    "question": "Переведите число 158 из десятеричной системы счисления в четверичную.",
    "options": [
      "3010",
      "3000",
      "2132",
      "3232",
      "1132"
    ],
    "correct": 2
  },
  {
    "question": "Вычислить разность чисел 55126 и 1155 6 в шестеричной системе.",
    "options": [
      "4223",
      "4203",
      "4413",
      "4770",
      "4313"
    ],
    "correct": 4
  },
  {
    "question": "Вычислить разность чисел 7778 и 4468 в восьмеричной системе.",
    "options": [
      "77",
      "155",
      "331",
      "330",
      "280"
    ],
    "correct": 2
  },
  {
    "question": "Вычислить разность чисел 10668 и 5468 в восьмеричной системе.",
    "options": [
      "1600",
      "1655",
      "1634",
      "1638",
      "1500"
    ],
    "correct": 2
  },
  {
    "question": "Вычислить разность чисел 6089 и 4489 в девятеричной системе.",
    "options": [
      "141",
      "150",
      "182",
      "453",
      "124"
    ],
    "correct": 1
  },
  {
    "question": "Переведите число 1769 из десятеричной системы счисления в шестнадцатеричную.",
    "options": [
      "6E9",
      "E92",
      "F11",
      "D81",
      "C41"
    ],
    "correct": 0
  },
  {
    "question": "Переведите число 800 десятеричной системы счисления в шестнадцатеричную.",
    "options": [
      "320",
      "C41",
      "F11",
      "321",
      "E92"
    ],
    "correct": 0
  },
  {
    "question": "Переведите число 10011101 из двоичной системы счисления в десятичную.",
    "options": [
      "160",
      "157",
      "180",
      "147",
      "170"
    ],
    "correct": 1
  },
  {
    "question": "Переведите число 110011 из двоичной системы счисления в восьмеричную.",
    "options": [
      "102",
      "72",
      "63",
      "51",
      "117"
    ],
    "correct": 2
  },
  {
    "question": "Переведите число 129 из десятичной в двоичную систему счисления.",
    "options": [
      "11111110",
      "10000001",
      "1010010",
      "1100",
      "10101"
    ],
    "correct": 1
  },
  {
    "question": "Переведите число 88 из десятичной в двоичную систему счисления.",
    "options": [
      "1011000",
      "10101",
      "10001",
      "101010",
      "11111"
    ],
    "correct": 0
  },
  {
    "question": "Переведите число F14 из шестнадцатеричной в восьмеричную систему счисления.",
    "options": [
      "7323",
      "7424",
      "7756",
      "7767",
      "7666"
    ],
    "correct": 1
  },
  {
    "question": "Переведите число A16 из шестнадцатеричной в восьмеричную систему счисления.",
    "options": [
      "5756",
      "5567",
      "1117",
      "5666",
      "5026"
    ],
    "correct": 4
  },
  {
    "question": "Переведите число 1A из шестнадцатеричной в двоичную систему счисления.",
    "options": [
      "11001",
      "11101",
      "11010",
      "100001",
      "11000"
    ],
    "correct": 2
  },
  {
    "question": "Переведите число 8С из шестнадцатеричной в четверичную систему счисления.",
    "options": [
      "1333",
      "3331",
      "2030",
      "2033",
      "2331"
    ],
    "correct": 2
  },
  {
    "question": "Раздел математической логики, значение всех элементов (функций и аргументов) которой определены в двухэлементном множестве 0 и 1 называют…",
    "options": [
      "правописанием знаков",
      "алгеброй логики",
      "геометрической конъюнкцией",
      "исчислением знаков",
      "логикой алгебры"
    ],
    "correct": 1
  },
  {
    "question": "Дизъюнкция – это…",
    "options": [
      "логическое отрицание",
      "логическое вычитание",
      "конъюнкция",
      "логическое умножение",
      "логическое сложение"
    ],
    "correct": 4
  },
  {
    "question": "Конъюнкция – это…",
    "options": [
      "логическое умножение",
      "дизъюнкция",
      "логическое отрицание",
      "логическое сложение",
      "логическое вычитание"
    ],
    "correct": 0
  },
  {
    "question": "Инверсия - это:",
    "options": [
      "логическое умножение",
      "логическое вычитание",
      "логическое отрицание",
      "логическое сложение",
      "дизъюнкция"
    ],
    "correct": 2
  },
  {
    "question": "Дизъюнкции соответствует …",
    "options": [
      "«И»",
      "«ИЛИ»",
      "«Не»",
      "«Да»",
      "«Нет»"
    ],
    "correct": 1
  },
  {
    "question": "Конъюнкции соответствует …",
    "options": [
      "«ДА»",
      "«И»",
      "«НЕТ»",
      "«НЕ»",
      "«ИЛИ»"
    ],
    "correct": 1
  },
  {
    "question": "Инверсии соответствует …",
    "options": [
      "«ДА»",
      "«И»",
      "«ИНОГДА»",
      "«ИЛИ»",
      "«НЕ»"
    ],
    "correct": 4
  },
  {
    "question": "Логической единице соответствует …",
    "options": [
      "«ИНОГДА»",
      "«И»",
      "«ДА»",
      "«ИЛИ»",
      "«НЕТ»"
    ],
    "correct": 2
  },
  {
    "question": "Логическому нулю соответствует …",
    "options": [
      "«ИНОГДА»",
      "«НЕТ»",
      "«ИЛИ»",
      "«И»",
      "«ДА»"
    ],
    "correct": 1
  },
  {
    "question": "Чему в алгебре логики равно 1 И 1 ?",
    "options": [
      "2",
      "1",
      "3",
      "10",
      "0"
    ],
    "correct": 1
  },
  {
    "question": "Чему в алгебре логики равно 1 ИЛИ 1?",
    "options": [
      "1",
      "0",
      "10",
      "3",
      "2"
    ],
    "correct": 0
  },
  {
    "question": "Чему в алгебре логики равно 1 И 0?",
    "options": [
      "3",
      "0",
      "10",
      "1",
      "2"
    ],
    "correct": 1
  },
  {
    "question": "Чему в алгебре логики равно 1 ИЛИ 0?",
    "options": [
      "1",
      "2",
      "0",
      "3",
      "10"
    ],
    "correct": 0
  },
  {
    "question": "Чему в алгебре логики равно НЕ 0?",
    "options": [
      "3",
      "10",
      "0",
      "1",
      "2"
    ],
    "correct": 3
  },
  {
    "question": "Чему в алгебре логики равно НЕ (1 И 1)?",
    "options": [
      "3",
      "1",
      "10",
      "2",
      "0"
    ],
    "correct": 4
  },
  {
    "question": "Чему в алгебре логики равно НЕ (1 ИЛИ 0)?",
    "options": [
      "2",
      "10",
      "0",
      "3",
      "1"
    ],
    "correct": 2
  },
  {
    "question": "Каким является высказывание «Микропроцессор является внешним устройством ПК»?",
    "options": [
      "Возможным",
      "Неубедительным",
      "Неявным",
      "Истинным",
      "Ложным"
    ],
    "correct": 4
  },
  {
    "question": "Каким является высказывание «Логическая единица соответствует логическому ДА»?",
    "options": [
      "Истинным",
      "Возможно ложным",
      "Убедительно невозможным",
      "Ложным",
      "Неявно правдивым"
    ],
    "correct": 0
  },
  {
    "question": "В каком двухэлементном множестве определены все значения булевской алгебры?",
    "options": [
      "0 и 10",
      "0 и 2",
      "0 и 1",
      "1 и 2",
      "3 и 2"
    ],
    "correct": 2
  },
  {
    "question": "Для алгебры логики применимы следующие законы:",
    "options": [
      "стандартный, переместительный и распределительный",
      "сочетательный, переместительный и не распределительный",
      "сочетательный, стандартный и распределительный",
      "сочетательный, переместительный и распределительный",
      "согласованный, переместительный и не распределительный"
    ],
    "correct": 3
  },
  {
    "question": "Виды операции алгебры логики:",
    "options": [
      "унарная и бинарная",
      "многопоточная и однопоточная",
      "отрицание и конъюнкция",
      "отрицание и пересечение",
      "многорежимная и двурежимная"
    ],
    "correct": 0
  },
  {
    "question": "Бинарные(ая) операции(ия) алгебры логики:",
    "options": [
      "«не»",
      "логическая единица",
      "отрицание и конъюнкция",
      "дизъюнкция и конъюнкция",
      "«иногда»"
    ],
    "correct": 3
  },
  {
    "question": "Унарные(ая) операции(ия) алгебры логики:",
    "options": [
      "только конъюнкция",
      "только дизъюнкция",
      "отрицание",
      "логическая единица и ноль",
      "дизъюнкция и конъюнкция"
    ],
    "correct": 2
  },
  {
    "question": "Что означает понятие «высказывание» в алгебре логики?",
    "options": [
      "Утверждение, которому всегда можно поставить в соответствие одно из двух логических значений: ложь или истина",
      "Логическое значение, принимающее значение \"истинно\", если исходное высказывание ложно, и наоборот",
      "Логическое выражение с квантором всеобщности — логическое выражение, истинное только тогда, когда для каждого объекта из заданной совокупности высказывание a истинно.",
      "Логическое значение, принимающее значение \"ложь\", если исходное высказывание ложно",
      "Утверждение, которому всегда можно поставить в соответствие одно из трёх логических значений: ложь, истина или отрицание"
    ],
    "correct": 0
  },
  {
    "question": "Сколько видов операций существует в булевой алгебре?",
    "options": [
      "1",
      "4",
      "6",
      "3",
      "2"
    ],
    "correct": 4
  },
  {
    "question": "Основная часть системной платы - это:",
    "options": [
      "микропроцессор",
      "ПЗУ",
      "накопитель на жестких магнитных дисках",
      "ОЗУ",
      "накопитель на гибких магнитных дисках"
    ],
    "correct": 0
  },
  {
    "question": "Что такое системная шина?",
    "options": [
      "Подсистема, которая передаёт данные между функциональными блоками компьютера",
      "Совокупность всех системных устройств вывода (монитор, принтер, звук и т.д.)",
      "Подсистема, состоящая из накопителей на гибких магнитных дисках",
      "Совокупность накопителей на жестких магнитных дисках",
      "Подсистема, которая передаёт данные между пзу и мп"
    ],
    "correct": 0
  },
  {
    "question": "Какими параметрами характеризуется внешняя память ПК?",
    "options": [
      "Временем доступа и скоростью считывания",
      "Скоростью чтения и скоростью доступа",
      "Временем отклика и временем считывания",
      "Временем чтения и уровнем доступа",
      "Скоростью считывания и временем отклика"
    ],
    "correct": 0
  },
  {
    "question": "Кэш-память имеет такое название потому что…",
    "options": [
      "она хранит временные данные",
      "она очень быстрая",
      "она работает с процессором",
      "она очень медленная",
      "она недоступна пользователю"
    ],
    "correct": 4
  },
  {
    "question": "Каково назначение регистровой кэш-памяти?",
    "options": [
      "Является буфером между оперативной и микропроцессорной памятью",
      "Предназначена для ускорения чтения информации с жесткого диска",
      "Предназначена для проведения операций над числами с плавающей точкой",
      "Предназначена для хранения информации перед записью на жесткий диск",
      "Предназначена для хранения информации после выключения питания компьютера"
    ],
    "correct": 0
  },
  {
    "question": "Что включает в себя основная память?",
    "options": [
      "CD-ROM и DVD-ROM",
      "RAM и ROM",
      "Cache-memory",
      "HDD и FDD",
      "Flash-memory"
    ],
    "correct": 1
  },
  {
    "question": "Каково назначение оперативной памяти?",
    "options": [
      "Является буфером между оперативной и микропроцессорной памятью",
      "Для проведения операций над числами с плавающей точкой",
      "Для ускорения чтения информации с жесткого диска",
      "Для хранения информации после выключения питания компьютера",
      "Для хранения информации, участвующей в вычислительном процессе"
    ],
    "correct": 4
  },
  {
    "question": "Что представляет собой оперативная память?",
    "options": [
      "Чип, с записанным BIOS",
      "Плата с напаянными микросхемами",
      "Микросхема с множеством выводов",
      "Блок, подключаемый с помощью кабеля",
      "Flash-карта с системными программами"
    ],
    "correct": 1
  },
  {
    "question": "ПЗУ не используется для хранения…",
    "options": [
      "драйверов базовой системы ввода-вывода",
      "системного времени системы",
      "загрузочных программ операционной системы",
      "программ тестирования устройств компьютера",
      "данных запущенных программ"
    ],
    "correct": 4
  },
  {
    "question": "ПЗУ используется для хранения…",
    "options": [
      "файлов подкачки операционной системы",
      "данных пользователя",
      "данных микропроцессора",
      "драйверов базовой системы ввода-вывода",
      "данных выполняемых программ"
    ],
    "correct": 3
  },
  {
    "question": "На основе чего создаются «полупостоянные» ПЗУ?",
    "options": [
      "Флэш-память",
      "Гибкие магнитные диски",
      "Оптические носители информации",
      "Полиметанотоксичные полупроводники",
      "Жесткие магнитные диски"
    ],
    "correct": 0
  },
  {
    "question": "Емкость ПЗУ, используемой для BIOS не превышает…",
    "options": [
      "8 Кбайт",
      "64 Кбайт",
      "32 Кбайт",
      "16 Кбайт",
      "128 Кбайт"
    ],
    "correct": 4
  },
  {
    "question": "Емкость оперативной памяти современных компьютеров равна…",
    "options": [
      "200 Гбайт -4 Тбайт",
      "32 Гбайт-128 Гбайт",
      "512Мбайт-8Гбайт",
      "1Мбайт-8 Мбайт",
      "16Кбайт-4 Мбайт"
    ],
    "correct": 2
  },
  {
    "question": "Емкость кэш памяти современных компьютеров равна…",
    "options": [
      "500 Гбайт -1 Тбайт",
      "512Мбайт-8Гбайт",
      "32 Гбайт-128 Гбайт",
      "200 Гбайт -4 Тбайт",
      "16Кбайт-4 Мбайт"
    ],
    "correct": 4
  },
  {
    "question": "Емкость жестких дисков современных компьютеров равна…",
    "options": [
      "200 Гбайт -2 Тбайт",
      "1Мбайт-8Мбайт",
      "16Кбайт-16 Мбайт",
      "32 Гбайт-128 Гбайт",
      "512Мбайт-8Гбайт"
    ],
    "correct": 0
  },
  {
    "question": "Что такое абсолютный адрес?",
    "options": [
      "Начальный адрес 64-килобайтового поля",
      "Размер сегмента учетом смещения",
      "Смещение от начала сегмента",
      "Гиперссылка на память",
      "Сумма адреса сегмента и смещения"
    ],
    "correct": 4
  },
  {
    "question": "Наиболее полное определение носителя информации:",
    "options": [
      "устройство, способное накапливать и обрабатывать информацию",
      "материальный объект, способный хранить информацию",
      "жесткий диск, имеющий таблицу разделов",
      "устройство хранения информации любого типа",
      "источник достоверных, непротиворечивых данных"
    ],
    "correct": 1
  },
  {
    "question": "Чему равно время доступа накопителей на гибких магнитных дисках?",
    "options": [
      "5-30 мс",
      "50-300 мс",
      "200-300 мс",
      "65-100 мс",
      "150-200 мс"
    ],
    "correct": 3
  },
  {
    "question": "Чему равно время доступа накопителей на жестких магнитных дисках?",
    "options": [
      "65-100 мс",
      "5-30 мс",
      "50-300 мс",
      "150-200 мс",
      "200-300 мс"
    ],
    "correct": 1
  },
  {
    "question": "Чему равно время доступа накопителей CD-ROM?",
    "options": [
      "150-200 мс",
      "50-300 мс",
      "200-300 мс",
      "5-30 мс",
      "65-100 мс"
    ],
    "correct": 1
  },
  {
    "question": "Чему равно время доступа накопителей DVD?",
    "options": [
      "5-30 мс",
      "65-100 мс",
      "150-200 мс",
      "50-300 мс",
      "200-300 мс"
    ],
    "correct": 2
  },
  {
    "question": "Какова скорость последовательного чтения гибких магнитных дисков?",
    "options": [
      "55-150 Кбайт/с",
      "500-6000 Кбайт/с",
      "1380 Кбайт/с",
      "150-3000 Кбайт/с",
      "200-300 Кбайт/с"
    ],
    "correct": 0
  },
  {
    "question": "Какова скорость последовательного чтения жестких магнитных дисков?",
    "options": [
      "1380 Кбайт/с",
      "55-150 Кбайт/с",
      "150-3000 Кбайт/с",
      "500-6000 Кбайт/с",
      "200-300 Кбайт/с"
    ],
    "correct": 3
  },
  {
    "question": "Какова скорость последовательного чтения накопителей CD – ROM?",
    "options": [
      "1-2Тбайт/с",
      "55-150 Кбайт/с",
      "150-3000 Кбайт/с",
      "1380 Кбайт/с",
      "500-6000 Кбайт/с"
    ],
    "correct": 2
  },
  {
    "question": "Какова скорость последовательного чтения накопителей DVD?",
    "options": [
      "55-150 Кбайт/с",
      "1-2Тбайт/с",
      "500-6000 Кбайт/с",
      "150-3000 Кбайт/с",
      "1380 Кбайт/с"
    ],
    "correct": 4
  },
  {
    "question": "Как называется именованная совокупность данных на внешнем носителе информации?",
    "options": [
      "Файл",
      "Нет правильного ответа",
      "База данных",
      "Архив",
      "Каталог"
    ],
    "correct": 0
  },
  {
    "question": "Как называется именованная область внешней памяти, выделенная для хранения массива данных?",
    "options": [
      "Файл",
      "Архив",
      "Каталог",
      "Кластер",
      "База данных"
    ],
    "correct": 0
  },
  {
    "question": "Какой тип данных не может храниться в файле?",
    "options": [
      "Графика",
      "Текущее время",
      "Данные для работы программ",
      "Программы",
      "Документы"
    ],
    "correct": 1
  },
  {
    "question": "Совокупность программ, обеспечивающих доступ к данным на носителе информации называется…",
    "options": [
      "архиватор",
      "файловая система",
      "кластеры",
      "проводники Windows",
      "операционная система"
    ],
    "correct": 1
  },
  {
    "question": "Какая файловая система на сегодняшний день считается наиболее защищенной от сбоев?",
    "options": [
      "FAT16",
      "Ext2FS",
      "NTFS",
      "Ext4FS",
      "FAT32"
    ],
    "correct": 2
  },
  {
    "question": "Какая информация связывается с файлом в системе NTFS?",
    "options": [
      "Полное имя файла, атрибуты файла, дата создания файла, длина файла",
      "Полное имя файла, атрибуты файла, свойства файла, длина файла",
      "Полное имя файла, атрибуты файла, дата создания файла, свойства файла",
      "Полное имя файла, свойства, дата создания файла, длина файла",
      "Свойства файла, атрибуты файла, дата создания файла, длина файла"
    ],
    "correct": 0
  },
  {
    "question": "Какая информация не связывается с файлом в системе FAT32?",
    "options": [
      "Полное имя файла;",
      "Атрибуты (характеристики) файла;",
      "Корректность файла",
      "Длина файла",
      "Дата создания файла;"
    ],
    "correct": 2
  },
  {
    "question": "Какая информация связывается с файлом в системе FAT16?",
    "options": [
      "Свойства файла, атрибуты файла, дата создания файла, длина файла",
      "Полное имя файла, атрибуты файла, дата создания файла, длина файла",
      "Полное имя файла, атрибуты файла, дата создания файла, свойства файла",
      "Полное имя файла, свойства файла, дата создания файла, длина файла",
      "Полное имя файла, атрибуты файла, свойства файла, длина файла"
    ],
    "correct": 1
  },
  {
    "question": "Какова длина имени файла в ОС DOS?",
    "options": [
      "1-8 символов",
      "1-65 символов",
      "1-255 символов",
      "1-128 символов",
      "1-32 символа"
    ],
    "correct": 0
  },
  {
    "question": "Какова длина имени файла в ОС Windows 98?",
    "options": [
      "1-128 символов",
      "1-65 символов",
      "1-32 символа",
      "1-8 символов",
      "1-255 символов"
    ],
    "correct": 4
  },
  {
    "question": "Каким знаком отделяется имя файла от имени потока в файловой системе NTFS?",
    "options": [
      "\\",
      ";",
      ",",
      ":",
      "."
    ],
    "correct": 3
  },
  {
    "question": "Какая файловая система является многопоточной?",
    "options": [
      "FAT16",
      "FAT32",
      "NTFS",
      "Ext2Fs",
      "Ext4"
    ],
    "correct": 2
  },
  {
    "question": "Какая файловая система рекомендуется для использования в Windows XP?",
    "options": [
      "FAT16",
      "Ext4",
      "Ext2FS",
      "FAT32",
      "NTFS"
    ],
    "correct": 4
  },
  {
    "question": "Какая файловая система не поддерживается Windows XP?",
    "options": [
      "NTFS16",
      "NTFS",
      "FAT32",
      "Ext4",
      "FAT16"
    ],
    "correct": 3
  },
  {
    "question": "Какая файловая система рекомендуется для использования в Windows 98?",
    "options": [
      "NTFS16",
      "FAT16",
      "FAT32",
      "Ext4",
      "NTFS"
    ],
    "correct": 2
  },
  {
    "question": "Какое главное преимущество файловой системы NTFS?",
    "options": [
      "Мобильность",
      "Надежность",
      "Скорость",
      "Экономия места",
      "Универсальность"
    ],
    "correct": 1
  },
  {
    "question": "За счет чего достигается надежность файловой системы NTFS?",
    "options": [
      "Создание таблицы разделов",
      "Многопоточности",
      "Создания резервных копий файлов",
      "Ведение бинарного дерева файлов",
      "Дублирование метафайла"
    ],
    "correct": 4
  },
  {
    "question": "Какой стандартный размер кластера файловой системы NTFS?",
    "options": [
      "32 Кб",
      "16 Кб",
      "4 Кб",
      "8 Кб",
      "64 Кб"
    ],
    "correct": 2
  },
  {
    "question": "Какой стандартный размер кластера файловой системы FAT32?",
    "options": [
      "16 Кб",
      "8 Кб",
      "4 Кб",
      "32 Кб",
      "64 Кб"
    ],
    "correct": 2
  },
  {
    "question": "Какое расширение имеют исполняемые файлы?",
    "options": [
      "EXE",
      "ZIP",
      "TXT",
      "COM",
      "DAT"
    ],
    "correct": 0
  },
  {
    "question": "Какое расширение графические файлы?",
    "options": [
      "ZIP",
      "BMP",
      "EXE",
      "COM",
      "TXT"
    ],
    "correct": 1
  },
  {
    "question": "Каких атрибутов файла не существует?",
    "options": [
      "Hidden",
      "Read Only",
      "Archive",
      "Write Only",
      "System"
    ],
    "correct": 3
  },
  {
    "question": "Какое количество установленных атрибутов должен иметь файл?",
    "options": [
      "Четное",
      "Кратное 4",
      "Кратное 8",
      "Произвольное",
      "Нечетное"
    ],
    "correct": 3
  },
  {
    "question": "Минимальная единица размещения информации на диске, состоящая из двух или большего числа смежных секторов дорожки, называется…",
    "options": [
      "байт",
      "кластер",
      "дорожка",
      "сектор",
      "файл"
    ],
    "correct": 1
  },
  {
    "question": "Файлы, хранящиеся в разбросанных по диску кластерах, называются…",
    "options": [
      "фрагментированными",
      "архивированные",
      "разобщенные",
      "бесцелостные",
      "разделенные"
    ],
    "correct": 0
  },
  {
    "question": "Кто является изобретателем первой дискеты?",
    "options": [
      "Билл Гейтс",
      "Фудзи Масиока",
      "Ксавье Пачеко",
      "Стив Тейксейра",
      "Алан Шугарт"
    ],
    "correct": 4
  },
  {
    "question": "Чем известен один из основателей фирмы Seagate, Алан Шугарт?",
    "options": [
      "Изобрел флэш-память",
      "Изобрел гибкий магнитный диск",
      "Разработал файловую систему NTFS",
      "Создал первый жесткий диск объемом 1 Гб",
      "Изобрел жесткий магнитный диск"
    ],
    "correct": 1
  },
  {
    "question": "От чего жесткий диск получил название винчестер?",
    "options": [
      "От фамилии изобретателя",
      "От названия города",
      "От названия ружья",
      "От названия фирмы",
      "От издаваемого звука"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается DRAM?",
    "options": [
      "Dual Random Access Memory",
      "Data Random Access Memory",
      "Digital Random Access Memory",
      "Dynamic Random Access Memory",
      "Double Random Access Memory"
    ],
    "correct": 3
  },
  {
    "question": "Как расшифровывается SRAM?",
    "options": [
      "Single Random Access Memory",
      "Static Random Access Memory",
      "System Random Access Memory",
      "Strobe Random Access Memory",
      "Synchronous Random Access Memory"
    ],
    "correct": 1
  },
  {
    "question": "Что такое «Регистровая кэш-память»?",
    "options": [
      "Не изменяемая память для управления компьютером и внешними устройствами",
      "Высокоскоростная память небольшой емкости, позволяющая повысить скорость работы компьютера за счет обработки процессором одной команды над несколькими потоками данных",
      "Высокоскоростная память сравнительно большой емкости, являющаяся буфером между ОП и МП и позволяющая увеличить скорость выполнения операций",
      "Память, предназначенная для хранения информации (программ и данных), непосредственно участвующей в вычислительном процессе в текущий интервал времени",
      "Память постоянного хранения информации и программ для управления компьютером"
    ],
    "correct": 2
  },
  {
    "question": "Что означает с английского Cache (кэш) ?",
    "options": [
      "Плата",
      "Тайник",
      "Склад",
      "Банк",
      "Сейф"
    ],
    "correct": 1
  },
  {
    "question": "Сколько типов кэш памяти различают по принципу записи результатов в оперативную память?",
    "options": [
      "5",
      "3",
      "2",
      "6",
      "4"
    ],
    "correct": 2
  },
  {
    "question": "Назовите типы кэш-памяти различаемых по принципу записи результатов в оперативную память.",
    "options": [
      "Кеш память «с параллельной записью» и кэш-память «со сквозной записью»",
      "Кеш память «с внутренней записью» и кэш-память «со сквозной записью»",
      "Кеш память «с внешней записью» и кэш-память «со сквозной записью»",
      "Кеш память «с ограниченной записью» и кэш-память «со сквозной записью»",
      "Кеш память «с обратной записью» и кэш-память «со сквозной записью»"
    ],
    "correct": 4
  },
  {
    "question": "Как расшифровывается RAM?",
    "options": [
      "Read Access Memory",
      "Rambus Access Memory",
      "Rate Access Memory",
      "Real Access Memory",
      "Random Access Memory"
    ],
    "correct": 4
  },
  {
    "question": "Как расшифровывается ROM?",
    "options": [
      "Random Only Memory",
      "Read Only Memory",
      "Rambus Only Memory",
      "Real Only Memory",
      "Rate Only Memory"
    ],
    "correct": 1
  },
  {
    "question": "Как расшифровывается DIP?",
    "options": [
      "Digital In-Line Package",
      "Dynamic In-Line Package",
      "Dual In-Line Package",
      "Double In-Line Package",
      "Data In-Line Package"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается SIP?",
    "options": [
      "Single In-Line Package",
      "System In-Line Package",
      "Strobe In-Line Package",
      "Static In-Line Package",
      "Synchronous In-Line Package"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается SIPP?",
    "options": [
      "Static In-Line Pinned Package",
      "Strobe In-Line Pinned Package",
      "Synchronous In-Line Pinned Package",
      "Single In-Line Pinned Package",
      "System In-Line Pinned Package"
    ],
    "correct": 3
  },
  {
    "question": "Как расшифровывается SIMM?",
    "options": [
      "System In-Line Mode Module",
      "Static In-Line Memory Module",
      "Single In-Line Mode Module",
      "Single In-Line Memory Module",
      "Strode In-Line Memory Module"
    ],
    "correct": 3
  },
  {
    "question": "Как расшифровывается DIMM?",
    "options": [
      "Dual In-Line Memory Module",
      "Dynamic In-Line Mode Module",
      "Digital In-Line Memory Module",
      "Dual In-Line Mode Module",
      "Dynamic In-Line Memory Module"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается RIMM?",
    "options": [
      "Read In-Line Mode Module",
      "Rambus In-Line Mode Module",
      "Rambus In-Line Memory Module",
      "Real In-Line Memory Module",
      "Read In-Line Memory Module"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается FPM DRAM?",
    "options": [
      "Fast Page Memory DRAM",
      "Fast Page Module DRAM",
      "Ferroelectric Page Memory DRAM",
      "Fast Page Mode DRAM",
      "Feast Page Mode DRAM"
    ],
    "correct": 3
  },
  {
    "question": "Как расшифровывается RAM EDO?",
    "options": [
      "RAM Express Data Out",
      "RAM Extended Digital Out",
      "RAM Express Dynamic Out",
      "RAM Extended Dynamic Out",
      "RAM Extended Data Out"
    ],
    "correct": 4
  },
  {
    "question": "Как расшифровывается DRDRAM?",
    "options": [
      "Direct Rambus DRAM",
      "Direct Real DRAM",
      "Double Read DRAM",
      "Direct Read DRAM",
      "Double Rambus DRAM"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается BEDO DRAM?",
    "options": [
      "Burt Extended Data Output DRAM",
      "Burt Express Data Output DRAM",
      "Burst Extended Data Output DRAM",
      "Burst Express Data Output DRAM",
      "Burst Express Dynamic Output DRAM"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается SDRAM?",
    "options": [
      "Static DRAM",
      "Single DRAM",
      "Synchronous DRAM",
      "Synchronous DRAM",
      "System DRAM"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается DDR SDRAM?",
    "options": [
      "Double Data Rate SDRAM",
      "Double Dynamic Real SDRAM",
      "Double Data Ride SDRAM",
      "Double Data Rambus SDRAM",
      "Double Dynamic Rate SDRAM"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается PROM?",
    "options": [
      "Programmable ROM",
      "Programmable ROM",
      "Page ROM",
      "Programmable ROM",
      "Progressing ROM"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается EPROM?",
    "options": [
      "Erasable PROM",
      "Express PROM",
      "Electrical PROM",
      "Extended PROM",
      "Extra PROM"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается EEPROM?",
    "options": [
      "Electrical Erasable PROM",
      "Express Erasable PROM",
      "Electrical Express PROM",
      "Extended Erasable PROM",
      "Electrical Extended PROM"
    ],
    "correct": 0
  },
  {
    "question": "PROM- это…",
    "options": [
      "теневая память",
      "масочные ПЗУ",
      "программируемые ПЗУ",
      "флэш-память",
      "перепрограммируемые ПЗУ"
    ],
    "correct": 2
  },
  {
    "question": "EPROM – это…",
    "options": [
      "флэш-память",
      "программируемые ПЗУ",
      "масочные ПЗУ",
      "перепрограммируемые ПЗУ",
      "теневая память"
    ],
    "correct": 3
  },
  {
    "question": "EEPROM – это…",
    "options": [
      "флэш-память",
      "перепрограммируемые ПЗУ",
      "программируемые ПЗУ",
      "масочные ПЗУ",
      "электрически перепрограммируемые ПЗУ"
    ],
    "correct": 4
  },
  {
    "question": "DRDRAM - это…",
    "options": [
      "корпус с двухрядным расположением выводов",
      "статическая память, использующая метод двойной дешифрации чтения",
      "динамическая память с прямой шиной для RAM",
      "память, осуществляющая передачу информации по обоим фронтам тактового сигнала",
      "программируемая память случайного доступа"
    ],
    "correct": 2
  },
  {
    "question": "Какого типа ПЗУ при классификации по технологии записи информации не существует?",
    "options": [
      "Перепрограммируемые ПЗУ",
      "Модулярные ПЗУ",
      "Масочные ПЗУ",
      "Программируемые ПЗУ",
      "Электрически перепрограммируемые ПЗУ"
    ],
    "correct": 1
  },
  {
    "question": "DDR SDRAM – это…",
    "options": [
      "статическая память, использующая метод двойной дешифрации чтения",
      "корпус с двухрядным расположением выводов",
      "память, осуществляющая передачу информации по обоим фронтам тактового сигнала",
      "динамическая память с прямой шиной для RAM",
      "динамическая память с быстрым страничным доступом"
    ],
    "correct": 2
  },
  {
    "question": "FPM DRAM – это…",
    "options": [
      "статическая память, использующая метод двойной дешифрации чтения",
      "память, осуществляющая передачу информации по обоим фронтам тактового сигнала",
      "динамическая память с быстрым страничным доступом",
      "динамическая память с прямой шиной для RAM",
      "корпус с двухрядным расположением выводов"
    ],
    "correct": 2
  },
  {
    "question": "Flash-Memory – это…",
    "options": [
      "память, предназначенная для хранения информации (программ и данных), непосредственно участвующей в вычислительном процессе в текущий интервал времени",
      "память постоянного хранения информации и программ для управления компьютером",
      "статическая память, использующая метод двойной дешифрации чтения",
      "твердотельная полупроводниковая энергонезависимая перезаписываемая память",
      "высокоскоростная память сравнительно большой емкости, являющаяся буфером между ОП и МП и позволяющая увеличить скорость выполнения операций"
    ],
    "correct": 3
  },
  {
    "question": "В каком году была изобретена флэш-память?",
    "options": [
      "1984",
      "1993",
      "1975",
      "1994",
      "1992"
    ],
    "correct": 0
  },
  {
    "question": "В каком году была выпущена первая коммерческая флэш-памяти (флэш-чип)?",
    "options": [
      "1988",
      "1994",
      "1992",
      "1986",
      "1993"
    ],
    "correct": 0
  },
  {
    "question": "Какая фирма выпустила первый коммерческий флешь-чип?",
    "options": [
      "IBM",
      "Cyrix",
      "Intel",
      "AMD",
      "Samsung"
    ],
    "correct": 2
  },
  {
    "question": "Какого типа был первый коммерческий флешь-чип?",
    "options": [
      "NOR",
      "MMC",
      "NAND",
      "MMX",
      "CF"
    ],
    "correct": 0
  },
  {
    "question": "В каком году был анонсирован NAND - тип флешь памяти?",
    "options": [
      "1987",
      "1991",
      "1994",
      "1989",
      "1993"
    ],
    "correct": 3
  },
  {
    "question": "Видеопамять – это…",
    "options": [
      "память предназначенная для приема, хранения и избирательной выдачи данных.",
      "память, хранящая текст, отображаемый на экране монитора",
      "память для управления монитором",
      "память, хранящая данные, поступающие на компьютер",
      "часть оперативной памяти, отведённая для хранения данных, которые используются для формирования изображения на экране монитора."
    ],
    "correct": 4
  },
  {
    "question": "Как расшифровывается FIFO?",
    "options": [
      "Fast In, Fast Out",
      "First In, First Out",
      "Flat In, Flat Out",
      "Flash In, Flash Out",
      "Fat In, Fat Out"
    ],
    "correct": 1
  },
  {
    "question": "LIFO расшифровывается как...",
    "options": [
      "Last In, First Out",
      "Lost In, Flip Out",
      "Light In, Fat Out",
      "Last In, Fast Out",
      "Liter In, First Out"
    ],
    "correct": 0
  },
  {
    "question": "Буферная Память – это…",
    "options": [
      "память для хранения данных программ при их выполнении",
      "память в которой записана базовая система ввода-вывода",
      "память для долговременного хранения информации",
      "кратковременная память - , в которой хранение информации обеспечивается за счет цикличности процесса обработки информации",
      "память, хранящая драйвера операционной системы"
    ],
    "correct": 3
  },
  {
    "question": "Какой элемент лежит в основе флэш-памяти типа NOR?",
    "options": [
      "И - не",
      "И - или",
      "Не - и",
      "Или - не",
      "Не - или"
    ],
    "correct": 3
  },
  {
    "question": "Какой элемент лежит в флэш-памяти типа NAND?",
    "options": [
      "Или - не",
      "И - или",
      "Не - и",
      "Не - или",
      "И - не"
    ],
    "correct": 4
  },
  {
    "question": "Кто изобрёл флэш-память?",
    "options": [
      "Бил Гейтс",
      "Джон фон Нейман",
      "Фудзи Масуока",
      "Алан Шугарт",
      "Филипп Морис"
    ],
    "correct": 2
  },
  {
    "question": "Почему флоппи диск имеет такое название?",
    "options": [
      "По названию фирмы",
      "Так как они имели наибольший оббьем в свое время",
      "Так как первые диски громко хлопали если их трясли",
      "По имени изобретателя",
      "По названию города"
    ],
    "correct": 2
  },
  {
    "question": "Какую емкость имеет диск 3,5''?",
    "options": [
      "1.44 Mб",
      "0,48 Мб",
      "5,25 Мб",
      "3,5 Мб",
      "0,52 Мб"
    ],
    "correct": 0
  },
  {
    "question": "В чем измеряется емкость памяти?",
    "options": [
      "В байтах",
      "В дюймах",
      "В пикселях",
      "В интегральной схеме",
      "В микросхемах"
    ],
    "correct": 0
  },
  {
    "question": "Жесткий диск – это…",
    "options": [
      "устройство, предназначенное для временного хранения данных",
      "набор устройств, предназначенных для временного хранения данных пока компьютер включен.",
      "основное устройство для долговременного хранения больших объемов данных и программ",
      "устройство, предназначенное для длительного хранения данных, в том числе и когда компьютер выключен.",
      "основное устройство компьютера, в которой производится все вычисления"
    ],
    "correct": 2
  },
  {
    "question": "Оперативная память – это…",
    "options": [
      "основное устройство для долговременного хранения данных",
      "основная микросхема компьютера, в которой производится все вычисления",
      "микросхема, предназначенная для длительного хранения данных, в том числе и когда компьютер выключен.",
      "наборы проводников, по которым происходит обмен сигналами между внутренними устройствами компьютера",
      "набор микросхем, предназначенных для временного хранения данных, когда компьютер включен."
    ],
    "correct": 4
  },
  {
    "question": "Как иначе называется жёсткий диск?",
    "options": [
      "FDD",
      "Blue-ray",
      "HDD",
      "CD-ROM",
      "DVD-ROM"
    ],
    "correct": 2
  },
  {
    "question": "Постоянное запоминающее устройство – это…",
    "options": [
      "микросхема, предназначенная для длительного хранения данных, в том числе и когда компьютер выключен.",
      "основная микросхема компьютера, в которой производится все вычисления",
      "микросхема, предназначенная для временного хранения данных",
      "наборы проводников, по которым происходит обмен сигналами между внутренними устройствами компьютера",
      "набор микросхем, предназначенных для временного хранения данных, когда компьютер включен."
    ],
    "correct": 0
  },
  {
    "question": "Какое сокращенное название имеет оперативная память?",
    "options": [
      "RAM",
      "RUM",
      "SRAM",
      "ROM",
      "DRAM"
    ],
    "correct": 0
  },
  {
    "question": "Какое сокращенное название имеет постоянная память?",
    "options": [
      "DRAM",
      "ROM",
      "SRAM",
      "RUM",
      "RAM"
    ],
    "correct": 1
  },
  {
    "question": "Как расшифровывается аббревиатура RAM?",
    "options": [
      "Random Access Memory",
      "Read Access Memory",
      "Rambus Access Memory",
      "Randomize Access Memory",
      "Rous Access Memory"
    ],
    "correct": 0
  },
  {
    "question": "В одном мегабайте…",
    "options": [
      "1024 Йбайта",
      "1024 Пбайта",
      "1024 Тбайта",
      "1024 Кбайта",
      "1024 Эбайта"
    ],
    "correct": 3
  },
  {
    "question": "Как расшифровывается аббревиатура ОЗУ?",
    "options": [
      "Определенное запоминающее устройство",
      "Оперативное запоминающее устройство",
      "Определяющее заполняющее устройство",
      "Основное запоминающее управление",
      "Оригинальное запоминающее устройство"
    ],
    "correct": 1
  },
  {
    "question": "В одном килобайте…",
    "options": [
      "1024 байта",
      "2000 байт",
      "1324 байта",
      "1230 байт",
      "1048 байт"
    ],
    "correct": 0
  },
  {
    "question": "В одном байте…",
    "options": [
      "32 бита",
      "8 битов",
      "64 бита",
      "4 бита",
      "16 битов"
    ],
    "correct": 1
  },
  {
    "question": "Микросхема, предназначенная для длительного хранения данных, при выключенном питании компьютера, называется...",
    "options": [
      "жесткий магнитный диск",
      "оперативно запоминающее устройство",
      "постоянное запоминающее устройство",
      "внешнее запоминающее устройство",
      "регистровая кэш-память"
    ],
    "correct": 2
  },
  {
    "question": "Набор микросхем, предназначенных для временного хранения данных при включенном питании компьютера, называется…",
    "options": [
      "оперативно запоминающее устройство",
      "регистровая кэш-память",
      "жесткий магнитный диск",
      "постоянное запоминающее устройство",
      "внешнее запоминающее устройство"
    ],
    "correct": 0
  },
  {
    "question": "Какое сокращение имеют запоминающие устройства статического типа:",
    "options": [
      "DRAM",
      "SRAM",
      "RUM",
      "RAM",
      "RIMM"
    ],
    "correct": 1
  },
  {
    "question": "Какое сокращение имеют запоминающие устройства динамического типа:",
    "options": [
      "RIMM",
      "DRAM",
      "SRAM",
      "RAM",
      "ROM"
    ],
    "correct": 1
  },
  {
    "question": "К внешним устройствам не относится:",
    "options": [
      "оперативное запоминающее устройство",
      "накопители на жестких магнитных дисках",
      "накопители на гибких магнитных дисках",
      "накопители универсальной последовательной шины",
      "накопители на магнитно-оптических дисках"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается аббревиатура SRAM?",
    "options": [
      "Single Rambus Access Memory",
      "Sit Read Access Memory",
      "Subatomic Random Access Memory",
      "Synchronous Rous Access Memory",
      "Static Random Access Memory"
    ],
    "correct": 4
  },
  {
    "question": "Как расшифровывается DRAM ?",
    "options": [
      "Rous Access Memory",
      "Douche Read Access Memory",
      "Dynamic Random Access Memory",
      "Dynamic Randomize Access Memory",
      "Dual Rambus Access Memory"
    ],
    "correct": 2
  },
  {
    "question": "Какая из аббревиатур обозначает микропроцессор?",
    "options": [
      "GPU",
      "CSU",
      "CPC",
      "CPU",
      "FPU"
    ],
    "correct": 3
  },
  {
    "question": "Какую из функций выполняет микропроцессор?",
    "options": [
      "Соединение с сетью",
      "Управление курсором",
      "Вычисление адресов команд и операндов",
      "Доступ к файлам",
      "Архивация данных"
    ],
    "correct": 2
  },
  {
    "question": "Какую из функций не выполняет микропроцессор?",
    "options": [
      "Прием и обработку запросов и команд от адаптеров на обслуживание ВУ",
      "Управление курсором",
      "Переход к следующей команде",
      "Вычисление адресов команд и операндов",
      "Выборку и дешифрацию команд из основной памяти"
    ],
    "correct": 1
  },
  {
    "question": "Что относится к основным параметрам микропроцессора?",
    "options": [
      "Размер кэш-памяти",
      "Вес микропроцессора",
      "Список команд микропроцессора",
      "Размер микропроцессора",
      "Структура микропроцессора"
    ],
    "correct": 0
  },
  {
    "question": "Что определяет разрядность шины данных микропроцессора?",
    "options": [
      "Количество разрядов",
      "Напряжение на микропроцессоре",
      "Объём кэш-памяти",
      "Размер микропроцессора",
      "Тактовую частоту"
    ],
    "correct": 0
  },
  {
    "question": "Что определяет разрядность шины адреса микропроцессора?",
    "options": [
      "Тактовую частоту",
      "Количество разрядов",
      "Адресное пространство",
      "Структуру микропроцессора",
      "Напряжение на микропроцессоре"
    ],
    "correct": 2
  },
  {
    "question": "Что определяет рабочая тактовая частота микропроцессора?",
    "options": [
      "Размер кэш-памяти",
      "Напряжение микропроцессора",
      "Вес микропроцессора",
      "Внутреннее быстродействие",
      "Нет правильного ответа"
    ],
    "correct": 3
  },
  {
    "question": "Сколько уровней имеет кэш-память?",
    "options": [
      "10",
      "1",
      "2",
      "4",
      "5"
    ],
    "correct": 2
  },
  {
    "question": "На каком микропроцессоре впервые появился второй уровень кэш-памяти?",
    "options": [
      "Pentium II",
      "Pentium D",
      "Celeron",
      "Pentium MMX",
      "Pentium III"
    ],
    "correct": 0
  },
  {
    "question": "Когда был выпущен первый микропроцессор?",
    "options": [
      "1903",
      "2006",
      "1971",
      "1950",
      "1814"
    ],
    "correct": 2
  },
  {
    "question": "Кем был выпущен первый микропроцессор?",
    "options": [
      "Apple",
      "Mitsubishi",
      "Intel",
      "Daewoo",
      "Motorola"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается CISC?",
    "options": [
      "Complex Instruction Set Command",
      "Core Intel Select Component",
      "Community Illuminated Sector Component",
      "Correct Inter Set Corporative",
      "Complex Industrial Source Computer"
    ],
    "correct": 0
  },
  {
    "question": "Как расшифровывается RISC?",
    "options": [
      "Reduced Inflation Select Command",
      "Relax In Smoke Camera",
      "Reduced Instrument Source Command",
      "Reduced Instruction Set Command",
      "Refresh Instinct South Come"
    ],
    "correct": 3
  },
  {
    "question": "Как расшифровывается VLIW?",
    "options": [
      "Very Length Intel’s World",
      "Voice Low Inter Word",
      "Very Length Instruction Word",
      "Very Low Instinct World",
      "Voice Log In World"
    ],
    "correct": 2
  },
  {
    "question": "Какая разрядность у процессора Intel-4004?",
    "options": [
      "32",
      "8",
      "64",
      "16",
      "4"
    ],
    "correct": 4
  },
  {
    "question": "Какая разрядность у процессора Intel-8080?",
    "options": [
      "32",
      "4",
      "8",
      "16",
      "64"
    ],
    "correct": 2
  },
  {
    "question": "Какая разрядность у процессора Intel-8086?",
    "options": [
      "16",
      "4",
      "32",
      "64",
      "8"
    ],
    "correct": 0
  },
  {
    "question": "Какая разрядность у процессора Intel-8088?",
    "options": [
      "8, 16",
      "32, 64",
      "16, 32",
      "16, 64",
      "4, 8"
    ],
    "correct": 0
  },
  {
    "question": "Какая тактовая частота у процессора Intel-80486?",
    "options": [
      "8-10",
      "250-400",
      "25-100",
      "20-40",
      "1-50"
    ],
    "correct": 2
  },
  {
    "question": "Какая тактовая частота у процессора Intel Pentium Pro?",
    "options": [
      "200-250",
      "400-600",
      "100-300",
      "150-200",
      "50-100"
    ],
    "correct": 3
  },
  {
    "question": "Какая тактовая частота у процессора Intel Pentium MMX?",
    "options": [
      "166-233",
      "250-300",
      "199-400",
      "201-301",
      "100-150"
    ],
    "correct": 0
  },
  {
    "question": "Какая тактовая частота у процессора Intel Pentium III Xeon?",
    "options": [
      "250-450",
      "200-500",
      "1-10000",
      "100-500",
      "500-1000"
    ],
    "correct": 4
  },
  {
    "question": "Когда был выпущен процессор Intel Pentium III Xeon?",
    "options": [
      "2001",
      "1995",
      "1999",
      "2009",
      "2000"
    ],
    "correct": 2
  },
  {
    "question": "Когда был выпущен процессор Intel Pentium III Coppermine?",
    "options": [
      "1995",
      "2005",
      "1999",
      "2003",
      "1998"
    ],
    "correct": 2
  },
  {
    "question": "Когда был выпущен процессор Intel Pentium 4 Willamette?",
    "options": [
      "2008",
      "2004",
      "2002",
      "2000",
      "2006"
    ],
    "correct": 3
  },
  {
    "question": "Когда был выпущен процессор Intel Celeron Mendocino?",
    "options": [
      "1996",
      "2000",
      "1992",
      "2002",
      "1998"
    ],
    "correct": 4
  },
  {
    "question": "Что не входит в состав микропроцессора Pentium?",
    "options": [
      "Кэш-память",
      "Ядро",
      "Регистры",
      "Плата",
      "Исполняющий модуль"
    ],
    "correct": 3
  },
  {
    "question": "На сколько функциональных частей можно разделить микропроцессор?",
    "options": [
      "1",
      "2",
      "5",
      "3",
      "7"
    ],
    "correct": 1
  },
  {
    "question": "Для чего предназначена интерфейсная часть микропроцессора?",
    "options": [
      "Для согласования с материнской платой",
      "Для выполнения разных команд",
      "Для безопасности использования микропроцессора",
      "Для связи и согласования микропроцессора с системной шиной ПК",
      "Для разгона тактовой частоты"
    ],
    "correct": 3
  },
  {
    "question": "Чего нет в интерфейсной части микропроцессора?",
    "options": [
      "Арифметико-логического устройства",
      "Узла формирования адреса",
      "Схемы управления шиной",
      "Внутренней интерфейсной шины",
      "Адресных регистров"
    ],
    "correct": 0
  },
  {
    "question": "Сколько всего может быть портов ввода-вывода у микропроцессора?",
    "options": [
      "16348",
      "50256",
      "36645",
      "10000",
      "65536"
    ],
    "correct": 4
  },
  {
    "question": "В чём измеряют производительность микропроцессора?",
    "options": [
      "В объёме кэш-памяти",
      "В количестве ядер",
      "В скорости обработки данных",
      "В напряжении",
      "В количестве выполнений операций в секунду"
    ],
    "correct": 4
  },
  {
    "question": "Сколько тактов затрачивает микропроцессор типа RISC на обработку одной простой команды?",
    "options": [
      "3",
      "1",
      "2",
      "5",
      "4"
    ],
    "correct": 1
  },
  {
    "question": "Сколько тактов затрачивает микропроцессор типа CISC на обработку одной простой команды?",
    "options": [
      "3",
      "4",
      "2",
      "7",
      "5"
    ],
    "correct": 1
  },
  {
    "question": "Имеют ли программисты доступ к внутренним VLIW-командам?",
    "options": [
      "Да",
      "Зависит от процессора",
      "Нет",
      "Не ко всем",
      "Только если знают пароль доступа"
    ],
    "correct": 2
  },
  {
    "question": "Когда появилась архитектура CISC?",
    "options": [
      "1966",
      "1988",
      "1978",
      "1943",
      "1999"
    ],
    "correct": 2
  },
  {
    "question": "Когда были разработаны микропроцессоры RISC?",
    "options": [
      "1980",
      "1991",
      "1986",
      "1968",
      "1972"
    ],
    "correct": 2
  },
  {
    "question": "Что такое АЛУ?",
    "options": [
      "Арифметико-лингвистическое устройство",
      "Алгебро-логическое устройство",
      "Англо-логическое устройство",
      "Арифметико-латинское устройство",
      "Арифметико-логическое устройство"
    ],
    "correct": 4
  },
  {
    "question": "Где находится узел формирования адреса?",
    "options": [
      "В кэш-памяти",
      "В интерфейсной части микропроцессора",
      "В оперативной памяти",
      "В операционной части микропроцессора",
      "На жёстком диске"
    ],
    "correct": 1
  },
  {
    "question": "Что хранит в своих ячейках ПЗУ?",
    "options": [
      "Процессы",
      "Дешифратор",
      "Управляющие сигналы",
      "Информацию",
      "Файлы"
    ],
    "correct": 2
  },
  {
    "question": "Какую разрядность имеет первый регистр?",
    "options": [
      "Тройное слово",
      "Двойное слово",
      "8 бит",
      "Одно слово",
      "1 байт"
    ],
    "correct": 1
  },
  {
    "question": "Какой регистр может только получать информацию с шин?",
    "options": [
      "Все регистры могут только получать информацию с шин",
      "4",
      "2",
      "1",
      "3"
    ],
    "correct": 2
  },
  {
    "question": "Что принимают по кодовым шинам инструкций управляющие сигналы от устройства правления и преобразуют их в сигналы для управления работой регистров и сумматора АЛУ?",
    "options": [
      "ПЗУ",
      "Микропроцессор",
      "Схемы управления",
      "ОЗУ",
      "Регистры"
    ],
    "correct": 2
  },
  {
    "question": "С какой информацией выполняет действия АЛУ?",
    "options": [
      "Со всей информацией",
      "Не выполняет никаких действий",
      "Десятичной",
      "Троичной",
      "Двоичной"
    ],
    "correct": 4
  },
  {
    "question": "Каких регистров не существует?",
    "options": [
      "Регистров флагов",
      "Резервных регистров",
      "Регистров смещения",
      "Универсальных регистров",
      "Сегментных регистров"
    ],
    "correct": 1
  },
  {
    "question": "Как обозначаются регистры флагов?",
    "options": [
      "FL",
      "LL",
      "MX",
      "RFF",
      "GFX"
    ],
    "correct": 0
  },
  {
    "question": "Как не обозначаются универсальные регистры?",
    "options": [
      "XX",
      "AX",
      "BX",
      "CX",
      "DX"
    ],
    "correct": 0
  },
  {
    "question": "Какая тактовая частота у микропроцессора Pentium 4 Willamette?",
    "options": [
      "750-1500",
      "50-10000",
      "100-250",
      "1000-3500",
      "250-500"
    ],
    "correct": 3
  },
  {
    "question": "Что такое CISC?",
    "options": [
      "Процессор с усечённым набором системы команд",
      "Процессор с полным набором системы команд",
      "Процессор с минимальным набором системы команд",
      "Процессор со сверхбольшим набором системы команд",
      "Процессор со сверхмалым набором системы команд"
    ],
    "correct": 1
  },
  {
    "question": "Что такое RISC?",
    "options": [
      "Процессор с минимальным набором системы команд",
      "Процессор со сверхбольшим набором системы команд",
      "Процессор со сверхмалым набором системы команд",
      "Процессор с усечённым набором системы команд",
      "Процессор с полным набором системы команд"
    ],
    "correct": 3
  },
  {
    "question": "Что такое VLIW?",
    "options": [
      "Процессор со сверхмалым набором системы команд",
      "Процессор со сверхбольшим набором системы команд",
      "Процессор с полным набором системы команд",
      "Процессор с минимальным набором системы команд",
      "Процессор с усечённым набором системы команд"
    ],
    "correct": 1
  },
  {
    "question": "Что такое MISC?",
    "options": [
      "Процессор со сверхбольшим набором системы команд",
      "Процессор со сверхмалым набором системы команд",
      "Процессор с минимальным набором системы команд",
      "Процессор с усечённым набором системы команд",
      "Процессор с полным набором системы команд"
    ],
    "correct": 2
  },
  {
    "question": "В состав блока для формирования исполнительных адресов включаются:",
    "options": [
      "базовые регистры, схема алгебраического вычитания, индексные регистры",
      "индексные регистры, базовые регистры, схема алгебраического сложения",
      "индексные регистры, схема алгебраического умножения, базовые регистры",
      "схема алгебраического деления, индексные регистры, базовые регистры",
      "индексные регистры, базовые регистры, схема логического сложения"
    ],
    "correct": 1
  },
  {
    "question": "Блок-схема ЦУУ состоит из:",
    "options": [
      "центрального процессора с внутренней памятью, внутреннего ЗУ1, вннутреннего ЗУ2, ИК-процесора",
      "центрального процессора с внутренней памятью, внешнего ЗУ1, внутреннего ЗУ2, ИК-процессора",
      "центрального процессора с внутренней памятью, внутреннего ЗУ1, внешнего ЗУ2, ИК-процесора",
      "центрального процессора с внутренней памятью, внешнего ЗУ1, внешнего ЗУ2, ИК-процесора",
      "центрального процессора с внутренней памятью, внешнего ЗУ1, внешнего ЗУ2, ИП-процесора"
    ],
    "correct": 3
  },
  {
    "question": "Тактовая частота обычно вырабатывается в",
    "options": [
      "внешнем ЗУ2",
      "внутренней памяти",
      "внешнем ЗУ1",
      "внешней памяти",
      "главном процессоре"
    ],
    "correct": 4
  },
  {
    "question": "Необходимым атрибутом микропроцессорных схем являются:",
    "options": [
      "тактовая частота",
      "схемы сброса",
      "память",
      "базовые регистры",
      "главные схемы"
    ],
    "correct": 1
  },
  {
    "question": "В основе автоматизации вычислительного процесса ЭВМ лежит принцип:",
    "options": [
      "тактовой частоты",
      "контроля",
      "сервисной программы",
      "Дж. Буля",
      "программного управления"
    ],
    "correct": 4
  },
  {
    "question": "Основой устройства управления является:",
    "options": [
      "генератор",
      "внешние устройства",
      "микрокомпьютер или микропроцессор",
      "тактовый генератор",
      "оперативно-запоминающее устройство"
    ],
    "correct": 2
  },
  {
    "question": "ROM – Read Only Memory – ПЗУ -",
    "options": [
      "содержит данные, которые можно запрограммировать только один раз",
      "многократно программированное ПЗУ с электрическим стиранием",
      "содержит данные, которые многократно программируются",
      "содержит данные, которые невозможно изменить",
      "содержит данные, которые можно стереть и запрограммировать снова"
    ],
    "correct": 3
  },
  {
    "question": "PROM – Programmable ROM – ППЗУ –",
    "options": [
      "многократно программированное ПЗУ с электрическим стиранием",
      "содержит данные, которые невозможно изменить",
      "содержит данные, которые можно стереть и запрограммировать снова",
      "содержит данные, которые можно запрограммировать только один раз",
      "содержит данные, которые многократно программируются"
    ],
    "correct": 3
  },
  {
    "question": "EPROM – Erasable PROM – СППЗУ –",
    "options": [
      "многократно программированное ПЗУ с электрическим стиранием",
      "содержит данные, которые можно стереть и запрограммировать снова",
      "содержит данные, которые можно запрограммировать только один раз",
      "содержит данные, которые многократно программируются",
      "содержит данные, которые невозможно изменить"
    ],
    "correct": 1
  },
  {
    "question": "EEPROM – Electrical EPROM – ЭСППУ –",
    "options": [
      "содержит данные, которые многократно программируются",
      "содержит данные, которые невозможно изменить",
      "содержит данные, которые можно стереть и запрограммировать снова",
      "содержит данные, которые можно запрограммировать только один раз",
      "многократно программированное ПЗУ с электрическим стиранием"
    ],
    "correct": 4
  },
  {
    "question": "Память ПК, остающаяся за вычетом первого мегабайта (т.е. за вычетом базовой памяти), называется:",
    "options": [
      "базовой",
      "верхней",
      "расширенной",
      "нижней",
      "дополнительной"
    ],
    "correct": 4
  },
  {
    "question": "Операционная система MS DOS, а, следовательно, и подавляющее большинство работающих под ее управлением программ могут использовать лишь первый мегабайт памяти, который часто называют:",
    "options": [
      "нижним",
      "расширенным",
      "базовым",
      "верхним",
      "дополнительным"
    ],
    "correct": 2
  },
  {
    "question": "Память, организованная по принципам спецификации EMS, называется:",
    "options": [
      "нижняя",
      "дополнительная",
      "расширенная",
      "основная",
      "верхняя"
    ],
    "correct": 2
  },
  {
    "question": "Процесс, с помощью которого компьютерная система распределяет ограниченный объем физической памяти между различными процессами, которым эта память требуется, одновременно оптимизируя производительность называется:",
    "options": [
      "управления файлом",
      "управления компьютером",
      "управления процессом",
      "управления базой",
      "управления памятью"
    ],
    "correct": 4
  },
  {
    "question": "Поддержанный аппаратными средствами механизм, создающий ощущение, что компьютер имеет больше физической оперативной памяти, чем есть на самом деле это:",
    "options": [
      "основная память",
      "внешняя память",
      "память",
      "виртуальная память",
      "дополнительная память"
    ],
    "correct": 3
  },
  {
    "question": "Организует и координирует автоматическое взаимодействие всех устройств ЭВМ в процессе решения задачи это:",
    "options": [
      "ЦУУ",
      "ОЗУ",
      "ЭВМ",
      "БРК",
      "ПЗУ"
    ],
    "correct": 0
  },
  {
    "question": "Пуск или остановку ЭВМ обеспечивает:",
    "options": [
      "БУО",
      "ПЗУ",
      "БРК",
      "ИПУ",
      "БТИ"
    ],
    "correct": 3
  },
  {
    "question": "На какие типы делится ЦУУ?",
    "options": [
      "Операционный и аппаратный",
      "Микропрограммный",
      "Аппаратный",
      "Операционный",
      "Аппаратный и микропрограммный"
    ],
    "correct": 4
  },
  {
    "question": "Центральное устройство управления ……. автоматическое взаимодействие всех устройств ЭВМ в процессе решения задачи.",
    "options": [
      "воспроизводит и координирует",
      "координирует",
      "организует",
      "воспроизводит и организует",
      "организует и координирует"
    ],
    "correct": 4
  },
  {
    "question": "Отдельный процессор для обработки сигналов, поступающих с приемника команд дистанционного управления?",
    "options": [
      "ИУ - процессор",
      "ИК - процессор",
      "ИП - процессор",
      "Тактовый процессор",
      "ИБ - процессор"
    ],
    "correct": 1
  },
  {
    "question": "Где записаны различные рабочие константы?",
    "options": [
      "В схеме OSD",
      "В ЦУУ",
      "В запоминающих устройствах",
      "В процессорах",
      "В ИК - процессоре"
    ],
    "correct": 2
  },
  {
    "question": "Какая из команд не подаётся с панели управления к центральному процессору напрямую?",
    "options": [
      "Регулирование уровня громкости",
      "Переключения каналов",
      "Регулирование уровня яркости",
      "Регулирование уровня контрастности",
      "Повышение уровня частоты микропроцессора"
    ],
    "correct": 4
  },
  {
    "question": "Схемы сброса являются необходимым атрибутом для…",
    "options": [
      "микропроцессорных схем",
      "управления базой",
      "жесткого диска",
      "тактовых частот",
      "макропроцессорных схем"
    ],
    "correct": 0
  },
  {
    "question": "Микрокомпьютер или микропроцессор является основой…",
    "options": [
      "БТИ",
      "устройства управления",
      "ОЗУ",
      "ЭВМ",
      "жесткого диска"
    ],
    "correct": 1
  },
  {
    "question": "Пуск или остановку ЭВМ, выполнение процессором заданного режима, вывод на средства индикации обеспечивает…",
    "options": [
      "ОЗУ",
      "ИПУ",
      "ПЗУ",
      "БРК",
      "БТИ"
    ],
    "correct": 1
  },
  {
    "question": "БРК, БТИ, БП, БУО – это структура",
    "options": [
      "ЦУУ",
      "ПЗУ",
      "ИК-процессора",
      "ОЗУ",
      "тактовых частот"
    ],
    "correct": 0
  },
  {
    "question": "Необходимым атрибутом микропроцессорных схем являются:",
    "options": [
      "тактовая частота",
      "схемы сброса",
      "память",
      "главные схемы",
      "базовые регистры"
    ],
    "correct": 1
  },
  {
    "question": "ИПУ – обеспечивает:",
    "options": [
      "вывод на средства индикации, остановку ЭВМ, выполнение процессором заданного режима",
      "выполнение процессором заданного режима, пуск ЭВМ, вывод на средства индикации",
      "пуск или остановку ЭВМ, выполнение процессором заданного режима, вывод на средства индикации",
      "пуск или остановку ЭВМ, выполнение процессором заданного режима",
      "пуск или остановку ЭВМ, вывод на средства индикации"
    ],
    "correct": 2
  },
  {
    "question": "Что такое ИПУ?",
    "options": [
      "Индивидуальный Принцип Управления",
      "Интегральное Процессорное Устройство",
      "Индексированный Поиск Устройств",
      "Инженерный Пульт Управления",
      "Инженерное Программное Управление"
    ],
    "correct": 3
  },
  {
    "question": "Что такое БРК?",
    "options": [
      "Блокиратор рабочего консоля",
      "Блок Регистра Команд",
      "Блокиратор Рабочих Команд",
      "Блок Растровых Команд",
      "Блок Рабочих Команд"
    ],
    "correct": 1
  },
  {
    "question": "Что такое БПА?",
    "options": [
      "Блок Прерывания Адреса",
      "Блок Прикладного Адреса",
      "Блок Передачи Адреса",
      "Блок Переадресации Адресов",
      "Блок Пониженного Адреса"
    ],
    "correct": 3
  },
  {
    "question": "Что такое БТИ?",
    "options": [
      "Блок Тактового Индекса",
      "Блок Т-образных Индексов",
      "Блок Транзитивного Импульса",
      "Блок Тактовых Импульсов",
      "Блок Транспортного Индекса"
    ],
    "correct": 3
  },
  {
    "question": "Что такое БП?",
    "options": [
      "Блок Передачи",
      "Блок Перезарядки",
      "Блок Переадресации",
      "Блок Понижения",
      "Блок Прерываний"
    ],
    "correct": 4
  },
  {
    "question": "Что такое БАК?",
    "options": [
      "Блокиратор Адресных Команд",
      "Блок Алгебраических Коэффициентов",
      "Большая Адресная Команда",
      "Быстрая Адресная Команда",
      "Блок Адреса Команд"
    ],
    "correct": 4
  },
  {
    "question": "Что такое БУО?",
    "options": [
      "Блок Управления Операциями",
      "Блок Умножения Операндов",
      "Блок Удалений Операций",
      "Блок Утилизации Отходов",
      "Блокиратор Управляемой Операции"
    ],
    "correct": 0
  },
  {
    "question": "Что такое УС?",
    "options": [
      "Устройство Сложения",
      "Устройство Соединения",
      "Управляющий Сумматор",
      "Управляющие Сигналы",
      "Удалённое Соединение"
    ],
    "correct": 3
  },
  {
    "question": "Чьё назначение формировать последовательности тактовых импульсов, которые позволяют провести временное развертывание цикла работы процессора?",
    "options": [
      "Блок Переадресации Адресов",
      "Блок Управления Операциями",
      "Блок Прерываний",
      "Блок Тактовых Импульсов",
      "Блок Адреса Команд"
    ],
    "correct": 3
  },
  {
    "question": "Где формируется адрес команды?",
    "options": [
      "В блоке переадресации команд",
      "В блоке регистра команд",
      "В блоке управления операциями",
      "В блоке прерываний",
      "В блоке адреса команд"
    ],
    "correct": 4
  },
  {
    "question": "Когда был выпущен Apple II?",
    "options": [
      "2007",
      "1877",
      "1987",
      "1967",
      "1977"
    ],
    "correct": 4
  },
  {
    "question": "В чём измеряется тактовая частота микропроцессора?",
    "options": [
      "Ом",
      "Гц",
      "Вт",
      "В",
      "Дж"
    ],
    "correct": 1
  },
  {
    "question": "Где применялись первые микропроцессоры?",
    "options": [
      "Везде",
      "В запоминающих устройствах",
      "В электронных калькуляторах",
      "В печатных машинках",
      "В фотоаппаратах"
    ],
    "correct": 2
  },
  {
    "question": "Первые микропроцессоры появились в 1970-х и применялись в электронных калькуляторах. Какая арифметика в них использовалась?",
    "options": [
      "Троично-десятичная арифметика 8-х битных слов",
      "Двоично-десятичная арифметика 2-х битных слов",
      "Двоично-десятичная арифметика 16-х битных слов",
      "Двоично-десятичная арифметика 4-х битных слов",
      "Троично-десятичная арифметика 4-х битных слов"
    ],
    "correct": 3
  },
  {
    "question": "Какая из перечисленных функций микропроцессора неверна?",
    "options": [
      "Переход к следующей команде",
      "Накопитель информации",
      "Выборка команд",
      "Вычисление адресов команд",
      "Управление сигналов"
    ],
    "correct": 1
  },
  {
    "question": "Многоядерные процессоры содержат…",
    "options": [
      "10 ядер в 10 корпусах",
      "одно процессорное ядро в двух корпусах",
      "два процессорных ядра в двух корпусах",
      "одно процессорное ядро в одном корпусе",
      "несколько процессорных ядер в одном корпусе"
    ],
    "correct": 4
  },
  {
    "question": "Сколько транзисторов содержал первый микропроцессор Intel 40044?",
    "options": [
      "3600 транзисторов",
      "2500 транзисторов",
      "2300 транзисторов",
      "1300 транзисторов",
      "2000 транзисторов"
    ],
    "correct": 2
  },
  {
    "question": "Методы увеличения производительности процессора?",
    "options": [
      "Повышение разрядности процессора",
      "Внутреннее умножение частоты",
      "Повышение тактовой частоты",
      "Всё перечисленное",
      "Кэширование памяти"
    ],
    "correct": 3
  },
  {
    "question": "Укажите верный алгоритм работы процессора: 1.Изменение списка команд. 2.Считывание команды. 3.Расшифровывание машинной команды дешифратором. 4.Выполнение расшифрованной операции арифметико-логическим устройством",
    "options": [
      "1,4,3,2",
      "4,3,2,1",
      "2,3,4,1",
      "1,2,3,4",
      "1,4,2,3"
    ],
    "correct": 3
  },
  {
    "question": "Назовите две фирмы - производителя микропроцессоров?",
    "options": [
      "CREATIVE/REALTEK",
      "NVIDIA/RADEON",
      "D-LINK/ZIXEL",
      "AMD/INTEL",
      "MSN/GIGABYTE"
    ],
    "correct": 3
  },
  {
    "question": "Когда началась история создания микропроцессоров?",
    "options": [
      "40-х годах",
      "50-х годах",
      "60-х годах",
      "70-х годах",
      "30-х годах"
    ],
    "correct": 1
  },
  {
    "question": "Назовите основные характеристики процессора:",
    "options": [
      "адресность, тактовая частота",
      "разрядность, тактовая частота",
      "объём буфера, производительность",
      "производительность, адресность",
      "ёмкость памяти, разрядность"
    ],
    "correct": 1
  },
  {
    "question": "Какой была стоимость первого микропроцессора Intel 4004?",
    "options": [
      "251$",
      "50$",
      "300$",
      "2009$",
      "1110$"
    ],
    "correct": 2
  },
  {
    "question": "Укажите фирму по производству процессоров для персональных компьютеров?",
    "options": [
      "Siemens",
      "AMD",
      "Gigabyte",
      "Motorola",
      "NVIDIA"
    ],
    "correct": 1
  },
  {
    "question": "В современных компьютерах процессоры выполнены в виде компактного модуля размерами около…",
    "options": [
      "4?5?0,1 см",
      "6?5?0,7 см",
      "5?4?0,4 см",
      "5?5?0,3 см",
      "3?5?0,6 см"
    ],
    "correct": 3
  },
  {
    "question": "Какого элемента в составе микропроцессора не существует?",
    "options": [
      "Integer ALU",
      "MDA",
      "CORE",
      "FPU",
      "REGISTERS"
    ],
    "correct": 1
  },
  {
    "question": "В каком процессоре реализовалась возможность многозадачной работы?",
    "options": [
      "Intel - 80286",
      "Intel Pentium",
      "Intel - 80462",
      "Intel - 8008",
      "Intel - 80088"
    ],
    "correct": 0
  },
  {
    "question": "Что означает «конвейерное выполнение команд»?",
    "options": [
      "Это одновременное выполнение разных тактов последовательных команд в разных частях микропроцессора без передачи результатов из одной части микропроцессора в другую",
      "Это одновременное выполнение разных тактов последовательных команд в разных частях микропроцессора при непосредственной передаче результатов из одной части микропроцессора в другую",
      "Это одновременное выполнение одинаковых тактов последовательных команд в разных частях микропроцессора при непосредственной передаче результатов из одной части микропроцессора в другую",
      "Это одновременное выполнение разных тактов последовательных команд в одной части микропроцессора при непосредственной передаче результатов из одной части микропроцессора в другую",
      "Это последовательное выполнение разных тактов последовательных команд в разных частях микропроцессора при непосредственной передаче результатов из одной части микропроцессора в другую"
    ],
    "correct": 1
  },
  {
    "question": "USB не обеспечивает:",
    "options": [
      "подключение по локальной сети",
      "одновременный обмен данными между хост-компьютером и множеством периферийных устройств (ПУ)",
      "подключение к Интернету",
      "одновременную работу компьютера и модема",
      "высокую скорость компьютера"
    ],
    "correct": 4
  },
  {
    "question": "В каком году была опубликована версия 1.0 Универсальной последовательной шины (USB)?",
    "options": [
      "В январе 1997 года",
      "В январе 1995 года",
      "В январе 1997 года",
      "В январе 1996 года",
      "В октябре 1996 года"
    ],
    "correct": 3
  },
  {
    "question": "Что управляет работой всей системы USB?",
    "options": [
      "Восходящий порт (Upstream Port)",
      "Функции (Function)",
      "Устройства (Device)",
      "Хост-контроллер (Host Controller)",
      "Адаптер ISDN"
    ],
    "correct": 3
  },
  {
    "question": "Хост-контроллер (Host Controller), управляющий работой всей системы USB, является:",
    "options": [
      "технической подсистемой хост-компьютера",
      "программно-аппаратной подсистемой хост-компьютера",
      "хост-контроллер не имеет никакой связи хост-компьютером",
      "программной подсистемой хост-компьютера",
      "аппаратной подсистемой хост-компьютера"
    ],
    "correct": 1
  },
  {
    "question": "Сколько базовых типа передачи данных допускает Архитектура USB?",
    "options": [
      "1",
      "3",
      "2",
      "4",
      "5"
    ],
    "correct": 3
  },
  {
    "question": "Полная скорость передачи сигналов USB составляет:",
    "options": [
      "32 Мбит/с",
      "22 Мбит/с",
      "128 Мбит/с",
      "12 Мбит/с",
      "64 Мбит/с"
    ],
    "correct": 3
  },
  {
    "question": "Низкая скорость передачи сигналов USB составляет:",
    "options": [
      "0,5 Мбит/с",
      "3,5 Мбит/с",
      "2,5 Мбит/с",
      "1,5 Мбит/с",
      "0,35 Мбит/с"
    ],
    "correct": 3
  },
  {
    "question": "Что используется для полной скорости передачи сигналов USB?",
    "options": [
      "Экранированная витая пара с импедансом 150 Ом и длиной сегмента до 5 м",
      "Экранированная витая пара с импедансом 200 Ом и длиной сегмента до 5 м",
      "Неэкранированная витая пара с импедансом 90 Ом и длиной сегмента до 5 м",
      "Экранированная витая пара с импедансом 90 Ом и длиной сегмента до 100 м",
      "Экранированная витая пара с импедансом 90 Ом и длиной сегмента до 5 м"
    ],
    "correct": 4
  },
  {
    "question": "Что используется для низкой скорости передачи сигналов USB?",
    "options": [
      "Невитый неэкранированный кабель до 5 м",
      "Невитый неэкранированный кабель до 3 м",
      "Невитый неэкранированный кабель до 10 м",
      "Витый неэкранированный кабель до 3 м",
      "Невитый экранированный кабель до 3 м"
    ],
    "correct": 1
  },
  {
    "question": "Какой тип передачи данных не допускает Архитектура USB?",
    "options": [
      "Прерывания (Interrupt)",
      "Отсоединение (Disconnected)",
      "Сплошные передачи (Bulk Data Transfers)",
      "Изохронные передачи (Isochronous Transfers)",
      "Управляющие посылки (Control Transfers)"
    ],
    "correct": 1
  },
  {
    "question": "Для чего не используются внешние шины?",
    "options": [
      "Для подключения цифровых камер",
      "Для подключения внешних жестких дисков",
      "Для подключения DVD-устройств",
      "Для подключения по локальной сети",
      "Для подключения принтеров и сканеров"
    ],
    "correct": 3
  },
  {
    "question": "К какому интерфейсу относиться международный стандарт для подключения периферийных устройств персонального компьютера IEEE 1284?",
    "options": [
      "К последовательному интерфейсу",
      "К параллельному интерфейсу",
      "К прямому интерфейсу",
      "К физическому интерфейсу",
      "К техническому интерфейсу"
    ],
    "correct": 1
  },
  {
    "question": "Как по другому называется LPT-порт?",
    "options": [
      "IEEE 1288",
      "IEEE 1286",
      "IEEE 1284",
      "IEEE 1282",
      "IEE 1284"
    ],
    "correct": 2
  },
  {
    "question": "Что можно подключить к LPT-порту?",
    "options": [
      "Клавиатуру",
      "Монитор",
      "Принтер",
      "Факс",
      "Модем"
    ],
    "correct": 2
  },
  {
    "question": "Как расшифровывается аббревиатура LPT порта?",
    "options": [
      "Line Protocol Transport",
      "Line Print Transport",
      "Line Protocol Terminal",
      "Left Print Transport",
      "Line Print Terminal"
    ],
    "correct": 4
  },
  {
    "question": "Функции представляют собой устройства, способные передавать или принимать данные или управляющую информацию по шине. Примерами функций не являются:",
    "options": [
      "материнская плата",
      "указатели - мышь, планшет, световое перо",
      "телефонный адаптер ISDN",
      "устройства ввода - клавиатура или сканер",
      "устройство вывода - принтер, звуковые колонки (цифровые)"
    ],
    "correct": 0
  },
  {
    "question": "Сколько у каждого хаба имеется восходящих портов (Upstream Port), предназначенных для подключения к хосту или хабу верхнего уровня?",
    "options": [
      "3",
      "2",
      "1",
      "4",
      "0"
    ],
    "correct": 2
  },
  {
    "question": "Для чего не используется Хаб?",
    "options": [
      "Для того чтобы отключить устройства от портов",
      "Для обеспечения изоляции сегментов с низкой скоростью от высокоскоростных",
      "Для того чтобы распознать подключение устройств к портам",
      "Для того чтобы управлять подачей питания на сегменты устройств",
      "Для того чтобы подключить жесткий диск к материнской плате"
    ],
    "correct": 4
  },
  {
    "question": "Сплошные передачи (Bulk Data Transfers) допускаются при:",
    "options": [
      "только на полной скорости передачи",
      "8 байт на полной и 64 бит на низкой",
      "64 байт на полной скорости и 8 байт на низкой",
      "скорость передачи не имеет значения",
      "1-255 мс для полной скорости и 10-255 мс - для низкой."
    ],
    "correct": 0
  },
  {
    "question": "Что позволяет возможность удаленного пробуждения (Remote Wakeup)?",
    "options": [
      "В этой возможности нет необходимости",
      "Позволяет приостановленному устройству подать сигнал хост-компьютеру, который тоже может находиться в приостановленном состоянии",
      "Позволяет приостановленному устройству подать сигнал хост-компьютеру, который находиться только остановленном состоянии",
      "Позволяет приостановленному устройству не подавать сигнал хост-компьютеру",
      "Позволяет выйти компьютеру из спящего режима"
    ],
    "correct": 1
  },
  {
    "question": "В каком состоянии не могут находиться нисходящие (Downstream) порты хабов?",
    "options": [
      "Powered (питание отключено)",
      "Enabled (разрешен)",
      "Interrupt (прерывание)",
      "Disconnected (отсоединен)",
      "Disabled (запрещен)"
    ],
    "correct": 2
  },
  {
    "question": "Хост-компьютер общается с устройствами через контроллер. Какие обязанности не входят в Хост?",
    "options": [
      "Сбор статистики",
      "Манипулирование потоком управления между устройствами и хостом",
      "Обнаружение подключения и отсоединения устройств USB",
      "Подключение по локальной сети",
      "Управление потоками данных"
    ],
    "correct": 3
  },
  {
    "question": "Для чего чаще всего используются СОМ-порты?",
    "options": [
      "Для подключения цифровых камер",
      "Для подключения принтеров и сканеров",
      "Для подключения внешних жестких дисков",
      "Для подключения манипуляторов (мышь, трекбол)",
      "Для подключения DVD-устройств"
    ],
    "correct": 3
  },
  {
    "question": "Какой порт используется для подключения электронных ключей (Security Devices), предназначенных для защиты от нелицензированного использования ПО?",
    "options": [
      "СОМ",
      "SPP",
      "USB",
      "LPT",
      "IEEE 1284"
    ],
    "correct": 0
  },
  {
    "question": "Какой кабель используется для подключения внешних модемов?",
    "options": [
      "Полный (9-проводный) кабель",
      "Экранированный кабель",
      "Невитый экранированный кабель",
      "Невитый неэкранированный кабель",
      "Витая пара"
    ],
    "correct": 0
  },
  {
    "question": "Какой кабель используют для связи двух компьютеров, удаленных друг от друга на небольшое расстояние, и непосредственное соединение их СОМ-портов?",
    "options": [
      "Витая пара",
      "Неэкранированный кабель",
      "Нуль- модемный кабель",
      "Полный (9-проводный) кабель",
      "Экранированный кабель"
    ],
    "correct": 2
  },
  {
    "question": "Какой интерфейс позволяет осуществлять связь между парой устройств, удаленных на расстояние, достигающее нескольких метров?",
    "options": [
      "IR (Infra Red) Connection",
      "DMA",
      "Centronics",
      "LPT",
      "UART"
    ],
    "correct": 0
  },
  {
    "question": "Выберите достоинство Инфракрасных излучателей?",
    "options": [
      "Не создают помех в радиочастотном диапазоне и не обеспечивают конфиденциальность передачи",
      "Создают помехи в радиочастотном диапазоне и обеспечивают быстроту передачи данных",
      "Проходят через стены, поэтому зона приема не ограничивается",
      "Не создают помех в радиочастотном диапазоне и обеспечивают конфиденциальность передачи",
      "Создают помехи в радиочастотном диапазоне и обеспечивают конфиденциальность передачи"
    ],
    "correct": 3
  },
  {
    "question": "Чем определяется разрядность шины данных?",
    "options": [
      "Разрядностью материнской платы",
      "Разрядностью процессора (ЦПУ)",
      "Разрядностью жесткого диска",
      "Разрядностью оперативной памяти",
      "Разрядностью внешних устройств"
    ],
    "correct": 1
  },
  {
    "question": "Для чего используется шина адреса?",
    "options": [
      "Для указания информации о готовности микропроцессора выполнить пересылку данных",
      "Для указания адреса ячеек памяти или портов ввода\\вывода, к которому устройство желает обратиться для проведения операции чтения или записи",
      "Для передачи сигналов которые позволяют памяти обращаться к процессору с запросами",
      "Для передает информации о готовности микропроцессора выполнить пересылку данных",
      "Для передачи данных идущих из памяти к процессору или из процессора"
    ],
    "correct": 1
  },
  {
    "question": "Для чего служат источник (передатчик) и получатель (приемник)?",
    "options": [
      "Для возможности «общения» компьютера и пользователя",
      "Для быстродействия жесткого диска",
      "Для быстродействия материнской платы",
      "Для быстродействия модема",
      "Для обмена некоторой информацией"
    ],
    "correct": 4
  },
  {
    "question": "Куда в первую очередь поступает сигнал при передаче сообщения?",
    "options": [
      "На декодер",
      "На линию связи",
      "На кодирующее устройство (кодер)",
      "На приемник",
      "На модулятор"
    ],
    "correct": 2
  },
  {
    "question": "Что происходит при передаче сообщения, когда сигнал поступает на кодирующее устройство (кодер)?",
    "options": [
      "Первичный (НЧ) сигнал преобразуется во вторичный (ВЧ) сигнал, пригодный для передачи по каналу связи на большие расстояния",
      "Происходит восстановление закодированного сообщения",
      "Происходит передача модулированного сигнала от передатчика к приемнику",
      "Происходит преобразование последовательности элементов сообщения в некоторую последовательность кодовых символов",
      "Происходит преобразование принятого приемником модулированного первичного (ВЧ) сигнала во вторичный (НЧ) сигнал"
    ],
    "correct": 3
  },
  {
    "question": "Дайте определение линии связи?",
    "options": [
      "Линия связи – это среда, используемая для передачи модулированного сигнала от модема к компьютеру",
      "Линия связи – это среда, используемая для передачи демодулированного сигнала от приемника к передатчику",
      "Линия связи – это среда, используемая для передачи модулированного сигнала от приемника к передатчику",
      "Линия связи – это среда, используемая для передачи модулированного сигнала от передатчика к приемнику",
      "Линия связи – это среда, используемая для передачи демодулированного сигнала от передатчика к приемнику"
    ],
    "correct": 3
  },
  {
    "question": "Что подразумевается под помехоустойчивостью системы связи?",
    "options": [
      "Способность системы устранять угрозы",
      "Способность системы приостанавливать сигналы с угрозами",
      "Устойчивость при перенапряжении",
      "Устойчивость от компьютерных вирусов",
      "Способность системы восстанавливать сигналы с заданной достоверностью"
    ],
    "correct": 4
  },
  {
    "question": "Многомашинные вычислительные системы – это…",
    "options": [
      "системы, содержащие один компьютер и принтер, связанных между собой по каналам связи",
      "системы, содержащие несколько принтеров, связанных между собой напрямую",
      "системы, содержащие один компьютер и принтер, связанных между собой напрямую",
      "системы, содержащие несколько одинаковых или различных, относительно самостоятельных компьютеров, связанных между собой напрямую",
      "системы, содержащие несколько одинаковых или различных, относительно самостоятельных компьютеров, связанных между собой через устройство обмена информацией, в частности по каналам связи"
    ],
    "correct": 4
  },
  {
    "question": "Распределенная обработка данных – это…",
    "options": [
      "обработка данных, выполняемая на зависимых компьютерах, представляющих территориально распределенную систему",
      "обработка данных, выполняемая на независимых компьютерах, представляющих территориально распределенную систему",
      "обработка данных, выполняемая на компьютерах, представляющих территориально распределенную систему",
      "обработка данных, выполняемая на независимых, но связанных между собой компьютерах, представляющих территориально распределенную систему",
      "обработка данных, выполняемая на компьютерах, представляющих территориально распределенную систему"
    ],
    "correct": 3
  },
  {
    "question": "Назовите первых представителей(я) систем распределенной обработки данных?",
    "options": [
      "Только многомашинные вычислительные системы",
      "Сама распределенная обработка данных",
      "Системы телеобработки данных и одномашинные вычислительные системы",
      "Системы телеобработки данных и многомашинные вычислительные системы",
      "Только системы телеобработки данных"
    ],
    "correct": 3
  },
  {
    "question": "Что не включает в себя система телеобработки информации?",
    "options": [
      "ЭВМ",
      "Материнская плата",
      "Абонентские пункты (АП)",
      "Устройство сопряжения (УС) компьютера",
      "Аппаратура передачи данных"
    ],
    "correct": 1
  },
  {
    "question": "Что является многоканальными устройствами согласования?",
    "options": [
      "Шины",
      "Линейные адаптеры",
      "Порты",
      "Модемы",
      "Мультиплексоры передачи данных"
    ],
    "correct": 4
  },
  {
    "question": "Как называется связанный набор полноценных компьютеров, используемый в качестве единого ресурса?",
    "options": [
      "Процессор",
      "Пластер",
      "Кластер",
      "Ядро",
      "Мат.платa"
    ],
    "correct": 2
  },
  {
    "question": "Как называется завершенная компьютерная система, обладающая всем, что требуется для ее функционирования, включая процессоры, память, подсистему ввода/вывода, а также операционную систему, подсистемы, приложения и т.д.?",
    "options": [
      "Компьютер клиент",
      "“Персональный компьютер”",
      "“Компьютер – Сервер”",
      "“Полноценный компьютер”",
      "Усовершенствованный компьютер"
    ],
    "correct": 3
  },
  {
    "question": "Как называются слабосвязанные системы, в связи узлов которых используется одна из стандартных сетевых технологий (Fast/Gigabit Ethernet, Myrinet) на базе шинной архитектуры или коммутатора?",
    "options": [
      "Кластеры",
      "Ядро",
      "Мастер",
      "Операционная система (ОС)",
      "Клинт"
    ],
    "correct": 0
  },
  {
    "question": "Дайте определение «вычислительный кластер» -",
    "options": [
      "это совокупность компьютеров, объединенных в рамках некоторой сети для решения одной задачи, которая для пользователя представляется в качестве единого ресурса.",
      "это компьютеры ориентированные на удаление вредоносных программ.",
      "это оборудование, предназначенное для выведения и подсказок решения задач.",
      "это программа служащая для уведомления об ошибках ОС.",
      "это совокупность компьютеров, для решения множества задач, которые для пользователя представляются в качестве единого ресурса."
    ],
    "correct": 0
  },
  {
    "question": "Вычислительный кластер — это совокупность компьютеров, объединенных в рамках некоторой сети для решения одной задачи, которая для пользователя представляется в качестве единого ресурса. В каких годах корпорация Digital Equipment предложила и реализовала такую концепцию кластера?",
    "options": [
      "В 50-х годах",
      "В 40-х годах",
      "В 60-х годах",
      "В 70-х годах",
      "В 80-х годах"
    ],
    "correct": 4
  },
  {
    "question": "Какое понятие означает наличие программного обеспечения, дающего возможность пользователям, администраторам и прикладным программам считать, что имеется только одна сущность, с которой они работают - кластер?",
    "options": [
      "Двумерный массив",
      "“Множественный ресурс”",
      "Неповторяющийся ресурс",
      "“Одномерный массив”",
      "“Единый ресурс”"
    ],
    "correct": 4
  },
  {
    "question": "Дисковый массив RAID —",
    "options": [
      "это система вывода, для хранения данных большого объема",
      "это серверная подсистема ввода- вывода для хранения данных большого объема",
      "это подсистема ввода, для хранения данных небольшого объема",
      "это система ввода, для создания данных",
      "это система ввода-вывода, для редактирования хранимой информации"
    ],
    "correct": 1
  },
  {
    "question": "Какая компания первой анонсировала концепцию кластерной системы в 1983 году?",
    "options": [
      "Asus",
      "DEC",
      "Samsung",
      "Microsoft",
      "Philips"
    ],
    "correct": 1
  },
  {
    "question": "В каком году компания DEC первой анонсировала концепцию кластерной системы?",
    "options": [
      "1943",
      "1983",
      "1973",
      "1963",
      "1953"
    ],
    "correct": 1
  },
  {
    "question": "Как определила компания DEC концепцию кластерной системы, которую она же анонсировала в 1983 году?",
    "options": [
      "Как одну вычислительную машину, представляющую собой единый узел обработки информации",
      "Как несколько вычислительных машин не связанных между собой",
      "Как одну вычислительную машину",
      "Как группу объединенных между собой вычислительных машин, представляющих собой единый узел обработки информации",
      "Как сеть компьютеров, служащую для дефрагментации и форматирования информации предоставленной пользователю"
    ],
    "correct": 3
  },
  {
    "question": "В каком году в Лос-Аламосской национальной лаборатории астрофизик Michael Warren и другие ученые из группы теоретической астрофизики построили суперкомпьютер Avalon?",
    "options": [
      "1958",
      "1968",
      "1998",
      "1978",
      "1988"
    ],
    "correct": 2
  },
  {
    "question": "Где в 1998 году астрофизик Michael Warren и другие ученые из группы теоретической астрофизики построили суперкомпьютер Avalon?",
    "options": [
      "В Лос-Аламосской национальной лаборатории",
      "В Немецкой национальной лаборатории",
      "В Лос-Анжелесской национальной лаборатории",
      "В Американской национальной лаборатории",
      "В Английской национальной лаборатории"
    ],
    "correct": 0
  },
  {
    "question": "Что построили ученые из группы теоретической астрофизики в 1998 году в Лос-Аламосской национальной лаборатории?",
    "options": [
      "Суперкомпьютер Avalon",
      "Компьютер HP",
      "Super компьютер",
      "Cуперкомпьютер Asus",
      "Персональный Компьютер"
    ],
    "correct": 0
  },
  {
    "question": "Благодаря чему стало возможным реальное распространение архитектуры \"клиент-сервер\"?",
    "options": [
      "Благодаря течению времени",
      "Благодаря эволюции",
      "Благодаря развитию и широкому внедрению в практику концепции открытых систем",
      "Благодаря развитию и широкому внедрению в практику концепции закрытых систем",
      "Благодаря экономическим предпосылкам"
    ],
    "correct": 2
  },
  {
    "question": "В связи с чем открытые системы приобретают еще большее значение и масштабность?",
    "options": [
      "В связи с закрытостью рынка",
      "В связи с бурным развитием технологий глобальных коммуникаций",
      "В связи с развитием технологий локальных коммуникаций",
      "В связи с экономическим кризисом",
      "В связи с всеобщим нежеланием развития"
    ],
    "correct": 1
  },
  {
    "question": "Какая идея лежит в основе широкого распространения локальных сетей компьютеров?",
    "options": [
      "Идея разделения ресурсов",
      "Идея расширения клиентов",
      "Идея разделения серверов",
      "Идея разделения капитала",
      "Идея разделения направления"
    ],
    "correct": 0
  },
  {
    "question": "Что предназначена для непосредственной работы пользователя или категории пользователей и обладает ресурсами, соответствующими локальным потребностям данного пользователя?",
    "options": [
      "Рабочий сервер",
      "Рабочая группа",
      "Станция проверки",
      "Рабочая станция",
      "Станция допуска"
    ],
    "correct": 3
  },
  {
    "question": "Какие черты технология клиент-сервер позаимствовала от мэйнфреймов?",
    "options": [
      "Своеобразность, надежность, целостность, рушимость",
      "Безопасность, своеобразность, надежность,безконкуретность",
      "Обособленность, безопасность, надежность, нерушимость",
      "Раздробленность, централизованное администрирование",
      "Централизованное администрирование, безопасность, надежность"
    ],
    "correct": 4
  },
  {
    "question": "Что является основной частью любой системы “клиент-сервер”?",
    "options": [
      "Данные",
      "Клиент БД",
      "Пользователь БД",
      "База данных",
      "Сервер БД"
    ],
    "correct": 4
  },
  {
    "question": "Основное требование к серверу БД –",
    "options": [
      "обеспечение максимального времени выполнения запросов, для проведения своеобразных операций",
      "обеспечение минимально времени, с увеличением рабочего такта",
      "обеспечение минимального времени выполнения запросов при максимально возможном числе пользователей",
      "обеспечение максимального числа запросов",
      "обеспечение минимального времени, минимальное число запросов"
    ],
    "correct": 2
  },
  {
    "question": "Сколько существует основных архитектур для построения процессора БД?",
    "options": [
      "3",
      "4",
      "2",
      "6",
      "5"
    ],
    "correct": 2
  },
  {
    "question": "Какие две основные архитектуры существует для построения процессора БД?",
    "options": [
      "Однопроцессорная архитектура и многопоточная",
      "Архитектура с несколькими процессами и многопоточная архитектура",
      "Выполняющая несколько процессов архитектура",
      "Без процессорная и многопоточная архитектура",
      "Несколько процессов и однопоточная архитектура"
    ],
    "correct": 1
  },
  {
    "question": "При помощи чего осуществляется управление работой большинства устройств ввода-вывода компьютера?",
    "options": [
      "Жесткого диска",
      "Процессора",
      "Портов",
      "ОЗУ",
      "Мат.платы"
    ],
    "correct": 2
  },
  {
    "question": "Что называется виртуальной ячейкой, соответствующей внешнему входу (или выходу) в компьютере?",
    "options": [
      "Кулер",
      "Процессор",
      "Мат.плато",
      "Кластер",
      "Порт"
    ],
    "correct": 4
  },
  {
    "question": "Что для процессора представляет собой операция ввода-вывода?",
    "options": [
      "Пересылку данных из порта или в порт",
      "Форматирование данных",
      "Пересылку данных из кластера в кластер",
      "Пересылку файлов из кулера в ОЗУ",
      "Изменение данных"
    ],
    "correct": 0
  },
  {
    "question": "Все порты ввода-вывода (ПВВ) AVR-микроконтроллеров работают по принципу…",
    "options": [
      "чтение-модификация",
      "запись-чтение",
      "модификация-запись",
      "чтение-модификация-запись",
      "чтение-запись"
    ],
    "correct": 3
  },
  {
    "question": "Сколько ячеек зарезервировано для каждого порта ввода-вывода в памяти ввода-вывода?",
    "options": [
      "5",
      "7",
      "3",
      "6",
      "4"
    ],
    "correct": 2
  },
  {
    "question": "Выберите порт соответствующий данному определению - порт, осуществляющий ввод /вывод данных байтами (все биты одновременно):",
    "options": [
      "звездообразный",
      "ключевой",
      "параллельный",
      "крестовой",
      "последовательный"
    ],
    "correct": 2
  },
  {
    "question": "Что такое параллельная обработка?",
    "options": [
      "Выполнение нескольких процессов в разное время",
      "Одновременное прекращение выполнения процессов",
      "Не одновременное выполнение процесса",
      "Прекращение выполнения процесса",
      "Одновременное выполнение нескольких процессов в компьютере"
    ],
    "correct": 4
  },
  {
    "question": "Название передатчика в виде светодиода и приемника в виде фотодиода, работающих в инфракрасном диапазоне.",
    "options": [
      "Фотодиодный приемник.",
      "Инфракрасный порт.",
      "Светодиодный передатчик.",
      "Звукосветовой порт",
      "Преобразующий порт"
    ],
    "correct": 1
  },
  {
    "question": "Самым главным элементом в компьютере, его «мозгом» является …",
    "options": [
      "микропроцессор",
      "видеоадаптер",
      "кулер",
      "оперативно запоминающее устройство",
      "жесткий диск"
    ],
    "correct": 0
  },
  {
    "question": "В каком году был создан первый микропроцессор?",
    "options": [
      "1961 году",
      "1951 году",
      "1971 году",
      "1941 году",
      "1931 году"
    ],
    "correct": 2
  },
  {
    "question": "Память первого уровня – небольшая (несколько десятков килобайт) сверхбыстрая память, предназначена для хранения промежуточных результатов -",
    "options": [
      "ВЗУ",
      "КЭШ",
      "ОЗУ",
      "ПЗУ",
      "МП"
    ],
    "correct": 1
  },
  {
    "question": "Какая память обеспечивает работу с программным обеспечением?",
    "options": [
      "КЭШ",
      "МП",
      "ОЗУ",
      "ПЗУ",
      "ВЗУ"
    ],
    "correct": 2
  },
  {
    "question": "Название основной платы компьютера -",
    "options": [
      "неизменяемая плата",
      "дедовская плата",
      "отцовская плата",
      "материнская плата",
      "располагающая плата"
    ],
    "correct": 3
  },
  {
    "question": "Контроллер, предназначенный для работы в графическом режиме - …",
    "options": [
      "микропроцессор.",
      "сетевая плата.",
      "микросхема.",
      "аудио плата.",
      "видеоадаптер."
    ],
    "correct": 4
  },
  {
    "question": "Что предназначено для постоянного хранения информации, используемой при работе компьютера: операционной системы, документов, игр и т.д.?",
    "options": [
      "КЭШ память",
      "Флоппи диск",
      "Жесткий диск",
      "Гибкий диск",
      "Оперативное запоминающее устройство"
    ],
    "correct": 2
  },
  {
    "question": "Устройство, необходимое для редактирования и вывода звука, посредством звуковых колонок-это…",
    "options": [
      "звуковая карта",
      "сетевая карта",
      "микропроцессор",
      "материнская плата",
      "видеокарта"
    ],
    "correct": 0
  },
  {
    "question": "Базовая система ввода-вывода – микросхема, установленная на материнской плате. Назовите её.",
    "options": [
      "DDR",
      "BIOS",
      "CMOS",
      "RAM",
      "SIMOS"
    ],
    "correct": 1
  },
  {
    "question": "Какая плата освобождает процессор от прямого управления накопителями на магнитных дисках, что существенно повышает эффективное быстродействие ПК?",
    "options": [
      "Контроллер прерываний",
      "Контроллер прямого доступа к памяти",
      "Математический сопроцессор",
      "Генератор тактовых импульсов",
      "Сопроцессор ввода-вывода"
    ],
    "correct": 1
  },
  {
    "question": "Какая плата за счет параллельной работы с процессором значительно ускоряет выполнение процедур ввода-вывода при обслуживании нескольких внешних устройств; освобождает процессор от обработки процедур ввода-вывода, в т.ч. реализуют и режим прямого доступа к памяти?",
    "options": [
      "Математический сопроцессор",
      "Сопроцессор ввода-вывода",
      "Контроллер прерываний",
      "Контроллер прямого доступа к памяти",
      "Генератор тактовых импульсов"
    ],
    "correct": 1
  },
  {
    "question": "Обслуживает процедуры прерывания, принимает запрос на прерывание от внешних устройств, определяет уровень приоритета этого запроса и выдает сигнал прерывания в процессор…",
    "options": [
      "генератор тактовых импульсов",
      "математический сопроцессор",
      "контроллер остановки",
      "контроллер перезагрузки",
      "контроллер прерываний"
    ],
    "correct": 4
  },
  {
    "question": "При какой организации внутримашинного интерфейса каждый блок ПК связан с прочими блоками своими локальными проводами?",
    "options": [
      "Многосвязный интерфейс",
      "N-связный интерфейс",
      "Двухсвязный интерфейс",
      "Односвязный интерфейс",
      "Трехсвязный интерфейс"
    ],
    "correct": 0
  },
  {
    "question": "Шины общего назначения, позволяющие подключать большое число самых разнообразных устройств-это…",
    "options": [
      "шины расширений",
      "локальные шины",
      "общие шины",
      "шины устройств",
      "односвязные шины"
    ],
    "correct": 0
  },
  {
    "question": "Пункты системного интерфейса ПК, через которые процессор обменивается информацией с другими устройствами-это…",
    "options": [
      "схема управления шиной и портами",
      "системная магистраль",
      "порты ввода-вывода",
      "шлейфы",
      "шины"
    ],
    "correct": 2
  },
  {
    "question": "Параллельный интерфейс обладает пропускной способностью порядка…",
    "options": [
      "102 – 104 бод",
      "102 – 103 бод",
      "104 – 105 бод",
      "103 – 105 бод",
      "104 – 106 бод"
    ],
    "correct": 2
  },
  {
    "question": "Последовательной интерфейс обладает пропускной способностью порядка…",
    "options": [
      "103 – 105 бит/с",
      "103 – 104 бит/с",
      "102 – 104 бит/с",
      "102 – 106 бит/с",
      "104 – 105 бит/с"
    ],
    "correct": 0
  },
  {
    "question": "При какой организации внутримашинного интерфейса все блоки ПК связаны друг с другом через общую или системную шину?",
    "options": [
      "Двухсвязный интерфейс",
      "N-связный интерфейс",
      "Многосвязный интерфейс",
      "Трехсвязный интерфейс",
      "Односвязный интерфейс"
    ],
    "correct": 4
  },
  {
    "question": "Шины – это…",
    "options": [
      "наборы проводников, по которым происходит обмен сигналами между внутренними устройствами компьютера",
      "основное устройство для долговременного хранения данных",
      "набор микросхем, предназначенных для временного хранения данных, когда компьютер включен.",
      "микросхема, предназначенная для длительного хранения данных, в том числе и когда компьютер выключен.",
      "основная микросхема компьютера, в которой производится все вычисления"
    ],
    "correct": 0
  },
  {
    "question": "Связные интерфейсы обеспечивают передачу данных на любые расстояния с небольшой скоростью в пределах…",
    "options": [
      "103 – 104 бит/с",
      "102 – 103 бит/с",
      "10 – 102 бит/с",
      "10 – 103 бит/с",
      "102 – 104 бит/с"
    ],
    "correct": 2
  },
  {
    "question": "При обмене данными между узлами используются три метода передачи данных:",
    "options": [
      "симплексная, асинхронная, синхронная",
      "асинхронная, синхронная, полудуплексная",
      "полудуплексная, дуплексная, асинхронная",
      "асинхронная, синхронная, дуплексная",
      "симплексная, дуплексная, полудуплексная"
    ],
    "correct": 4
  },
  {
    "question": "Симплексный режим – это…",
    "options": [
      "одновременные передача и прием сообщений",
      "попеременная передача информации, когда источник и приемник последовательно меняются местами",
      "передача данных только в одном направлении",
      "передача данных при помощи специальной аппаратуры",
      "передача данных вообще не происходит"
    ],
    "correct": 2
  },
  {
    "question": "Полудуплексный режим –это…",
    "options": [
      "передача данных вообще не происходит",
      "одновременные передача и прием сообщений",
      "передача данных только в одном направлении",
      "попеременная передача информации, когда источник и приемник последовательно меняются местами",
      "передача данных при помощи специальной аппаратуры"
    ],
    "correct": 3
  },
  {
    "question": "Дуплексный режим –это…",
    "options": [
      "передача данных вообще не происходит",
      "попеременная передача информации, когда источник и приемник последовательно меняются местами",
      "передача данных только в одном направлении",
      "передача данных при помощи специальной аппаратуры",
      "одновременные передача и прием сообщений"
    ],
    "correct": 4
  },
  {
    "question": "Для передачи информации по каналам связи используются коды:",
    "options": [
      "передаваемый, последовательный",
      "последовательный, двоичный",
      "параллельный, последовательный",
      "информационный, параллельный",
      "параллельный, переменный"
    ],
    "correct": 2
  },
  {
    "question": "По степени централизации управления вычислительные системы делятся на:",
    "options": [
      "централизованные, децентрализованные и смешанные",
      "совмещенные и распределенные",
      "системы с пакетным режимом, режимом «запрос-ответ» и режимом реального времени",
      "универсальные, специализированные",
      "однородные и неоднородные"
    ],
    "correct": 0
  },
  {
    "question": "Перечислите виды режимов передачи данных:",
    "options": [
      "полудуплексный и дуплексный",
      "симплексный, дуплексный, графический",
      "цифровой и графический",
      "симплексный и цифровой",
      "симплексный, полудуплексный, дуплексный"
    ],
    "correct": 4
  },
  {
    "question": "В каком режиме передачи данных передача происходит только в одном направлении?",
    "options": [
      "Симплексном",
      "Графическом",
      "Полудуплексном",
      "Триплексном",
      "Дуплексном"
    ],
    "correct": 0
  },
  {
    "question": "В каком режиме передачи данных передача происходит одновременно с приемом данных?",
    "options": [
      "Триплексном",
      "Графическом",
      "Полудуплексном",
      "Дуплексном",
      "Симплексном"
    ],
    "correct": 3
  },
  {
    "question": "В каком случае процессы называются синхронными?",
    "options": [
      "В том случае, когда один из процессов может начаться только после того, как получит часть информации от другого процесса",
      "В том случае, когда один из процессов может начаться только после того, как получит полностью данные от другого процесса",
      "В том случае, когда группа байтов передается по одному проводу",
      "В том случае, когда информация кодируется и передается по одному проводу",
      "В том случае, когда процессы не зависят друг от друга"
    ],
    "correct": 1
  },
  {
    "question": "Процессы передачи и приема данных, обратные синхронным называются…",
    "options": [
      "несинхронные",
      "кодированные",
      "последовательные",
      "асинхронные",
      "параллельные"
    ],
    "correct": 3
  },
  {
    "question": "Что такое синхронизация данных?",
    "options": [
      "Передача данных последовательным кодом",
      "Кодирование информации",
      "Процессы, не ограниченные во времени",
      "Согласование различных процессов во времени",
      "Передача данных параллельным кодом"
    ],
    "correct": 3
  },
  {
    "question": "Устройство для ручного ввода числовой, текстовой и управляющей информации в ПК- это…",
    "options": [
      "сканер",
      "манипуляторы",
      "графический планшет",
      "клавиатура",
      "принтер"
    ],
    "correct": 3
  },
  {
    "question": "Устройство для автоматического считывания с бумажных носителей и ввода в ПК машинописных текстов, графиков, рисунков, чертежей-это…",
    "options": [
      "манипуляторы",
      "клавиатуру",
      "принтер",
      "графический планшет",
      "сканер"
    ],
    "correct": 4
  },
  {
    "question": "Печатающие устройства для регистрации информации на бумажный носитель - это…",
    "options": [
      "графический планшет",
      "сенсорные экраны",
      "манипуляторы",
      "сканер",
      "принтер"
    ],
    "correct": 4
  },
  {
    "question": "Устройства, использующиеся для связи с приборами и другими средствами автоматизации и для подключения ПК к каналам связи, к другим ЭВМ и вычислительным сетям- это…",
    "options": [
      "сенсорные экраны",
      "устройства вывода информации",
      "устройства ввода информации",
      "устройства связи и телекоммуникации",
      "графопостроители"
    ],
    "correct": 3
  },
  {
    "question": "К каким устройствам можно отнести принтер?",
    "options": [
      "Средствам связи и телекоммуникациями,",
      "Внутренним устройствам",
      "Диалоговым средствам",
      "Устройствам ввода информации",
      "Устройствам вывода информации"
    ],
    "correct": 4
  },
  {
    "question": "К каким устройствам можно отнести клавиатуру, сканер?",
    "options": [
      "Устройствам ввода информации,",
      "Внутренним устройствам",
      "Устройствам вывода информации",
      "Средствам связи и телекоммуникациями,",
      "Диалоговым средствам"
    ],
    "correct": 0
  },
  {
    "question": "Что необходимо использовать для одновременного подключения нескольких устройств USB?",
    "options": [
      "Принтер",
      "Концентратор",
      "Адаптер",
      "Модем",
      "Сканер"
    ],
    "correct": 1
  },
  {
    "question": "Сколько линий используется в параллельных портах для одновременной передачи байта информации?",
    "options": [
      "8 линий",
      "3 линии",
      "1 линия",
      "5 линий",
      "10 линий"
    ],
    "correct": 0
  },
  {
    "question": "В первых компьютерах использовались …",
    "options": [
      "триоды",
      "диоды",
      "перфокарты",
      "электроды",
      "микросхемы"
    ],
    "correct": 0
  },
  {
    "question": "В каком году компания Hewlett Packard представила компьютер для бизнеса HP 2115?",
    "options": [
      "1945",
      "1990",
      "1960",
      "1970",
      "1966"
    ],
    "correct": 4
  },
  {
    "question": "Какой первый коммерческий модем разработала компания Bell Labs?",
    "options": [
      "TPLink",
      "Acorp",
      "DLink",
      "Dataphone",
      "Telephone"
    ],
    "correct": 3
  },
  {
    "question": "Кто описал машину для суммирования чисел?",
    "options": [
      "Чарльз Бэббидж",
      "Джон Непер",
      "Джон фон Нейман",
      "Блез Паскаль",
      "Ли Ди Форест"
    ],
    "correct": 3
  },
  {
    "question": "В каком году создана электронно-вычислительная машина ENIAC ?",
    "options": [
      "В 1970 году",
      "В 1945 году",
      "В 1950 году",
      "В 1940 году",
      "В 1946 году"
    ],
    "correct": 4
  },
  {
    "question": "Кто создал интегральную схему, расположив соединительные каналы непосредственно на кремниевой пластине?",
    "options": [
      "Морис Вилкс",
      "Роберт Меткалф",
      "Роберт Нойс",
      "Стив Возняк",
      "Джек Килби"
    ],
    "correct": 2
  },
  {
    "question": "Как называется максимальное количество ячеек основной памяти, которое может быть непосредственно адресовано микропроцессором?",
    "options": [
      "Адресное пространство",
      "Тактовая частота",
      "Интерфейс",
      "Кэш-память",
      "Разрядность"
    ],
    "correct": 0
  },
  {
    "question": "Компьютеры 1-го поколения используют …",
    "options": [
      "32-битовые микропроцессоры",
      "24-битовые микропроцессоры",
      "64-битовые микропроцессоры",
      "8-битовые микропроцессоры",
      "16-битовые микропроцессоры"
    ],
    "correct": 3
  },
  {
    "question": "Компьютеры 2-го поколения используют …",
    "options": [
      "32-битовые микропроцессоры",
      "16-битовые микропроцессоры",
      "8-битовые микропроцессоры",
      "36-битовые микропроцессоры",
      "64-битовые микропроцессоры"
    ],
    "correct": 1
  },
  {
    "question": "Компьютеры 3-го поколения используют …",
    "options": [
      "8-битовые микропроцессоры",
      "32-битовые микропроцессоры",
      "24-битовые микропроцессоры",
      "64-битовые микропроцессоры",
      "32-битовые микропроцессоры"
    ],
    "correct": 1
  },
  {
    "question": "Компьютеры 4-го поколения используют …",
    "options": [
      "64-битовые микропроцессоры",
      "16-битовые микропроцессоры",
      "128-битовые микропроцессоры",
      "8-битовые микропроцессоры",
      "32-битовые микропроцессоры"
    ],
    "correct": 0
  },
  {
    "question": "Мощные многопроцессорные вычислительные машины с быстродействием сотни миллионов — десятки миллиардов операций в секунду относятся к …",
    "options": [
      "проблемно-ориентированным компьютерам",
      "суперкомпьютерам",
      "большим ЭВМ",
      "микрокомпьютерам",
      "персональным компьютерам"
    ],
    "correct": 1
  },
  {
    "question": "Исторически первыми появились …",
    "options": [
      "персональные компьютеры",
      "малые ЭВМ",
      "микрокомпьютеры",
      "большие ЭВМ",
      "суперкомпьютеры"
    ],
    "correct": 3
  },
  {
    "question": "Процессоры семейства Intel Pentium 4 - это",
    "options": [
      "семейство двухъядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на микроархитектуре Intel NetBurst",
      "семейство двухъядерных процессоров AMD, на одном кристалле которых расположены два процессорных ядра, построенных на основе архитектуры Intel NetBurst",
      "одноядерные процессоры на основе микроархитектуры Intel NetBurst",
      "одноядерные процессоры на основе архитектуры AMD64",
      "семейство двухъядерных процессоров AMD, на одном кристалле которых расположены два процессорных ядра, построенных на основе архитектуры AMD64"
    ],
    "correct": 2
  },
  {
    "question": "Intel Pentium D- это",
    "options": [
      "семейство одноядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на микроархитектуре Intel NetBurst",
      "семейство двухъядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на основе архитектуры AMD64",
      "семейство двухъядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на микроархитектуре Intel NetBurst",
      "семейство двухъядерных моделей процессоров AMD, причем каждое ядро такого процессора основано на микроархитектуре Intel NetBurst",
      "семейство одноядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на основе архитектуры AMD64"
    ],
    "correct": 2
  },
  {
    "question": "AMD Athlon 64 X2 Dual-Core — это",
    "options": [
      "семейство одноядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на основе архитектуры AMD64",
      "семейство одноядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на микроархитектуре Intel NetBurst",
      "семейство двухъядерных моделей процессоров Intel, причем каждое ядро такого процессора основано на основе архитектуры AMD64",
      "семейство двухъядерных моделей процессоров AMD, причем каждое ядро такого процессора основано на микроархитектуре Intel NetBurst",
      "cемейство двухъядерных процессоров AMD, на одном кристалле которых расположены два процессорных ядра, построенных на основе архитектуры AMD64"
    ],
    "correct": 4
  },
  {
    "question": "2-ое поколение компьютеров создано на основе …",
    "options": [
      "транзисторов",
      "нейронной структуры",
      "сверхбольших интегральных схем",
      "больших интегральных схем",
      "электронных вакуумных ламп"
    ],
    "correct": 0
  },
  {
    "question": "Какое устройство реализует сопряжение и связь с другими устройствами ПК?",
    "options": [
      "Микропроцессорная память",
      "Математический сопроцессор",
      "Устройство управления",
      "Арифметико-логарифмическое устройство",
      "Интерфейсная система микропроцессора"
    ],
    "correct": 4
  },
  {
    "question": "Как называется временный останов выполнения одной программы в целях оперативного выполнения другой, в данный момент более важной (приоритетной) программы?",
    "options": [
      "Загрузка",
      "Задержание",
      "Перезагрузка",
      "Остановка",
      "Прерывание"
    ],
    "correct": 4
  },
  {
    "question": "Что обслуживает процедуры прерывания, принимает запрос на прерывание от внешних устройств, определяет уровень приоритета этого запроса и выдает сигнал прерывания в процессор?",
    "options": [
      "Контроллер прерываний",
      "Математический сопроцессор",
      "Контроллер перезагрузки",
      "Генератор тактовых импульсов",
      "Контроллер остановки"
    ],
    "correct": 0
  },
  {
    "question": "Что определяет количество элементарных операций выполняемые процессором за единицу времени?",
    "options": [
      "Рабочее напряжение",
      "Размер кэш памяти",
      "Разрядность",
      "Тактовая частота",
      "Коэффициент внутреннего умножения тактовой частоты"
    ],
    "correct": 3
  },
  {
    "question": "На какие типы можно разделить всю память с произвольным доступом? а)GRAM, б)FRAM, в)CRAM, г)DRAM, д)SRAM",
    "options": [
      "а, б",
      "а, г",
      "г, д",
      "б, д",
      "в, г"
    ],
    "correct": 2
  },
  {
    "question": "В каком году был выпущен первый микропроцессор?",
    "options": [
      "В 1965 году.",
      "В 1980 году.",
      "В 1959 году.",
      "В 1971 году.",
      "В 1945 году."
    ],
    "correct": 3
  },
  {
    "question": "Как называется устройство для автоматического считывания с бумажных носителей и ввода в ПК машинописных текстов, графиков, рисунков, чертежей?",
    "options": [
      "Графический планшет",
      "Сенсорный экран",
      "Манипулятор",
      "Сканер",
      "Клавиатура"
    ],
    "correct": 3
  },
  {
    "question": "Как называется устройство для ручного ввода графической информации, изображений путем перемещения специального указателя?",
    "options": [
      "Сенсорный экран",
      "Графический планшет",
      "Клавиатура",
      "Сканер",
      "Манипулятор"
    ],
    "correct": 1
  },
  {
    "question": "Как называется устройство для ввода графической информации на экран дисплея путем управления движением курсора по экрану с последующим кодированием координат курсора и вводом их в ПК?",
    "options": [
      "Сканер",
      "Клавиатура",
      "Сенсорный экран",
      "Графический планшет",
      "Манипулятор"
    ],
    "correct": 4
  },
  {
    "question": "Как называется устройство для ввода отдельных элементов изображения программ или команд с полиэкрана дисплея в ПК?",
    "options": [
      "Графический планшет",
      "Сканер",
      "Графопостроитель",
      "Принтер",
      "Сенсорный экран"
    ],
    "correct": 4
  },
  {
    "question": "Как называются печатающие устройства для регистрации информации на бумажный носитель?",
    "options": [
      "Сканеры",
      "Сенсорные экраны",
      "Графические планшеты",
      "Принтеры",
      "Манипуляторы"
    ],
    "correct": 3
  },
  {
    "question": "Как называются устройства для вывода графической информации из ПК на бумажный носитель?",
    "options": [
      "Сканеры",
      "Сенсорные экраны",
      "Графические планшеты",
      "Модемы",
      "Графопостроители"
    ],
    "correct": 4
  },
  {
    "question": "Какая плата за счет параллельной работы с процессором значительно ускоряет выполнение процедур ввода-вывода при обслуживании нескольких внешних устройств, освобождает процессор от обработки процедур ввода-вывода, в т.ч. реализуют и режим прямого доступа к памяти?",
    "options": [
      "Сопроцессор ввода-вывода",
      "Генератор тактовых импульсов",
      "Контроллер прерываний",
      "Контроллер прямого доступа к памяти",
      "Математический сопроцессор"
    ],
    "correct": 0
  },
  {
    "question": "Что показывает сколько бит данных процессор может принять и обработать в своих регистрах за один такт?",
    "options": [
      "Разрядность",
      "Тактовая частота",
      "Коэффициент внутреннего умножения тактовой частоты",
      "Размер кэш памяти",
      "Рабочее напряжение"
    ],
    "correct": 0
  },
  {
    "question": "Как называется коэффициент, на который следует умножить тактовую частоту материнской платы, для достижения частоты процессора?",
    "options": [
      "Коэффициент внутреннего умножения материнской платы",
      "Коэффициент внутреннего умножения работы процессора",
      "Коэффициент внутреннего умножения процессора",
      "Коэффициент внутреннего умножения частоты процессора",
      "Коэффициент внутреннего умножения тактовой частоты"
    ],
    "correct": 4
  },
  {
    "question": "Что такое процессор?",
    "options": [
      "Основная микросхема выполняющая основные логические операции.",
      "Вспомогательная микросхема выполняющая логические операции над дробями.",
      "Микросхема предназначенная для математических операций.",
      "Микросхема выполняющая операции ввода и вывода информации на экран.",
      "Основная микросхема, выполняющая большинство математических и логических операций."
    ],
    "correct": 4
  },
  {
    "question": "Что такое регистры?",
    "options": [
      "Это внутренние ячейки процессора",
      "Это устройство для обработки данных",
      "Это устройство компьютера",
      "Это ячейки микропроцессора",
      "Это устройство производящее вычисления"
    ],
    "correct": 0
  },
  {
    "question": "Как называются проводники связывающие процессор с оперативной памятью и остальными устройствами компьютера?",
    "options": [
      "Шинами",
      "Модулями",
      "Чипсетами",
      "Регистрами",
      "Контроллёрами"
    ],
    "correct": 0
  },
  {
    "question": "Сколько основных шин в компьютере?",
    "options": [
      "5",
      "7",
      "9",
      "10",
      "3"
    ],
    "correct": 4
  },
  {
    "question": "Выберите правильные варианты основных шин:",
    "options": [
      "шина устройств, шина команд, шина протоколов.",
      "адресная шина, шина устройств, шина команд.",
      "шина форм, шина команд, шина данных.",
      "адресная шина, шина данных, шина команд.",
      "шина протоколов, шина устройств, адресная шина."
    ],
    "correct": 3
  },
  {
    "question": "Сколько проводников входит в адресную шину?",
    "options": [
      "30",
      "35",
      "40",
      "25",
      "32"
    ],
    "correct": 4
  },
  {
    "question": "Из скольких линий состоит шина данных?",
    "options": [
      "40",
      "30",
      "35",
      "64",
      "20"
    ],
    "correct": 3
  },
  {
    "question": "Какие устройства называют периферийными?",
    "options": [
      "Внутренние дополнительные устройства, предназначенные для ввода, вывода и длительного хранения данных",
      "Внешние дополнительные устройства, предназначенные для ввода, вывода и обработки данных",
      "Внутренние основные устройства, предназначенные для ввода, вывода и длительного хранения данных",
      "Внешние дополнительные устройства, предназначенные для ввода, вывода и длительного хранения данных",
      "Внешние основные устройства, предназначенные для передачи данных и длительного хранения данных"
    ],
    "correct": 3
  },
  {
    "question": "Дать определение клавиатуре.",
    "options": [
      "Это устройство для беспроводной связи",
      "Это устройство вывода информации на бумагу",
      "Это устройство для ввода графической информации",
      "Это сенсорное устройство управления ПК",
      "Это клавишное устройство управления ПК"
    ],
    "correct": 4
  },
  {
    "question": "Что такое сканер?",
    "options": [
      "Устройство вывода информации",
      "Устройство визуального представления данных",
      "Устройство ввода в компьютер информации непосредственно с бумажного документа",
      "Устройство беспроводной связи с системным блоком",
      "Устройство вывода данных на бумагу"
    ],
    "correct": 2
  },
  {
    "question": "Что такое принтер?",
    "options": [
      "Клавишное устройство",
      "Устройство для ввода графической информации",
      "Устройство вывода информации на бумагу",
      "Операционная шина",
      "Устройство беспроводной связи с системным блоком"
    ],
    "correct": 2
  },
  {
    "question": "Что такое стримеры?",
    "options": [
      "Накопители на магнитной ленте",
      "Устройство вывода информации",
      "Жесткие диски",
      "Клавишное устройство",
      "Устройство работающее с дисковыми носителями"
    ],
    "correct": 0
  },
  {
    "question": "Что такое модем?",
    "options": [
      "Устройство производящее вычисления и обработку информации",
      "Внутреннее дополнительное устройство, предназначенное для ввода, вывода и длительного хранения данных",
      "Внешнее устройство вывода данных на бумагу и выполняющее логические операции над данными",
      "Устройство для ввода и длительного хранения графической информации",
      "Устройство предназначенное для обмена информацией между удаленными компьютерами по каналам связи"
    ],
    "correct": 4
  },
  {
    "question": "Назовите важнейшее для пользователя устройство, с помощью которого осуществляется ввод данных, команд и управляющих воздействий в ПК.",
    "options": [
      "Джойстик",
      "Манипулятор «мышь»",
      "Клавиатура",
      "Графопостроитель",
      "Манипулятор"
    ],
    "correct": 2
  },
  {
    "question": "Все микропроцессоры можно разделить на группы: а) с полным набором команд, б) с сокращенным набором команд, в) с минимальным набором команд, г) с максимальным набором команд.(Выбрать правильные варианты ответов).",
    "options": [
      "а, б, в, г",
      "а, б, в",
      "б, в, г",
      "а, г",
      "б, в"
    ],
    "correct": 1
  },
  {
    "question": "Как называется шина, по которой из оперативной памяти поступают команды выполняемые процессором?",
    "options": [
      "Шина данных",
      "Операционная шина",
      "Адресная шина",
      "Интерфейсные шины",
      "Командная шина"
    ],
    "correct": 4
  },
  {
    "question": "Как называется шина, по которой происходит копирование данных из оперативной памяти в регистры процессора и наоборот?",
    "options": [
      "Операционная шина",
      "Командная шина",
      "Шина данных",
      "Адресная шина",
      "Интерфейсные шины"
    ],
    "correct": 2
  },
  {
    "question": "Данные, которые передаются по этой шине трактуются как адреса ячеек оперативной памяти.",
    "options": [
      "Шина данных",
      "Операционная шина",
      "Командная шина",
      "Интерфейсные шины",
      "Адресная шина"
    ],
    "correct": 4
  },
  {
    "question": "Как называются шины, специализирующиеся на обслуживании небольшого количества устройств определенного класса?",
    "options": [
      "Общие шины",
      "Локальные шины",
      "Односвязные шины",
      "Шины устройств",
      "Шины расширений"
    ],
    "correct": 1
  },
  {
    "question": "Как называются шины общего назначения, позволяющие подключать большое число самых разнообразных устройств?",
    "options": [
      "Шины устройств",
      "Односвязные шины",
      "Общие шины",
      "Локальные шины",
      "Шины расширений"
    ],
    "correct": 4
  },
  {
    "question": "К каким устройствам можно отнести принтер, графопостроители?",
    "options": [
      "Внутренним устройствам",
      "Внешним устройствам",
      "Устройствам связи и телекоммуникаций",
      "Устройствам ввода информации",
      "Устройствам вывода информации"
    ],
    "correct": 4
  },
  {
    "question": "К каким устройствам можно отнести клавиатуру, сканер, графический планшет, манипуляторы?",
    "options": [
      "Устройствам обработки данных",
      "Устройствам вывода информации",
      "Устройствам передачи данных",
      "Устройствам ввода информации",
      "Внутренним устройствам ввода"
    ],
    "correct": 3
  },
  {
    "question": "Что обеспечивает взаимодействие машины с окружающей средой?",
    "options": [
      "Системный блок",
      "Источники питания",
      "Внешние устройства",
      "Процессор",
      "Внутренние устройства"
    ],
    "correct": 2
  },
  {
    "question": "Какая шина имеет провода и схемы сопряжения для подключения блоков ПК к системе энергопитания?",
    "options": [
      "Кодовая шина адреса",
      "Шина данных",
      "Кодовая шина инструкции",
      "Шина питания",
      "Кодовая шина операции"
    ],
    "correct": 3
  }
];

// Экспорт для использования
if (typeof window !== 'undefined') {
    window.hardwareISR221Questions = hardwareISR221Questions;
}
