// Parsed 523 questions for Innovation Technologies
const innovationQuestions = [
  {
    "id": 1,
    "question": "Ценность информации определяется…",
    "answers": [
      {
        "text": "её стоимостью на рынке",
        "isCorrect": false
      },
      {
        "text": "её значимостью и полезностью для владельца",
        "isCorrect": true
      },
      {
        "text": "количеством символов",
        "isCorrect": false
      },
      {
        "text": "размером файла",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 2,
    "question": "Информация, хранящаяся и обрабатываемая в компьютерных системах, рассматривается как…",
    "answers": [
      {
        "text": "виртуальные данные",
        "isCorrect": false
      },
      {
        "text": "цифровой контент",
        "isCorrect": false
      },
      {
        "text": "информационный ресурс",
        "isCorrect": true
      },
      {
        "text": "объект собственности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 3,
    "question": "Организация защиты информации — …",
    "answers": [
      {
        "text": "покупка антивирусов",
        "isCorrect": false
      },
      {
        "text": "процесс создания условий безопасной обработки информации",
        "isCorrect": true
      },
      {
        "text": "настройка Windows",
        "isCorrect": false
      },
      {
        "text": "резервное копирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 4,
    "question": "Для обозначения ценности конфиденциальной коммерческой информации используются три категории:",
    "answers": [
      {
        "text": "общая, специальная, закрытая",
        "isCorrect": false
      },
      {
        "text": "низкая, средняя, высокая",
        "isCorrect": true
      },
      {
        "text": "открытая, условная, тайная",
        "isCorrect": false
      },
      {
        "text": "коммерческая, секретная, проектная",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 5,
    "question": "Компьютерная сис¬тема или автоматизированная система обработки данных (АСОД)- является…",
    "answers": [
      {
        "text": "совокупностью технических устройств",
        "isCorrect": false
      },
      {
        "text": "системой для вычислений",
        "isCorrect": false
      },
      {
        "text": "системой для автоматизированной обработки данных",
        "isCorrect": true
      },
      {
        "text": "программой, установленной на ПК",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 6,
    "question": "Комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации – это…",
    "answers": [
      {
        "text": "операционная система",
        "isCorrect": false
      },
      {
        "text": "компьютерная сеть",
        "isCorrect": false
      },
      {
        "text": "информационная система",
        "isCorrect": true
      },
      {
        "text": "база данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 7,
    "question": "Зависимость ценности информации от времени приближенно определяется в соответствии с выражением:",
    "answers": [
      {
        "text": "C = t²",
        "isCorrect": false
      },
      {
        "text": "C = C₀·e^(–αt)",
        "isCorrect": true
      },
      {
        "text": "C = 1/t",
        "isCorrect": false
      },
      {
        "text": "C = C₀ + t",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 8,
    "question": "Какие подходы существуют к измерению количества информации?",
    "answers": [
      {
        "text": "физический, химический, математический",
        "isCorrect": false
      },
      {
        "text": "статистический, семантический, синтаксический",
        "isCorrect": true
      },
      {
        "text": "практический, теоретический, комбинированный",
        "isCorrect": false
      },
      {
        "text": "логический, философский, структурный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 9,
    "question": "Информация, которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках, называется…",
    "answers": [
      {
        "text": "объективной",
        "isCorrect": true
      },
      {
        "text": "технической",
        "isCorrect": false
      },
      {
        "text": "избыточной",
        "isCorrect": false
      },
      {
        "text": "случайной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 10,
    "question": "Информация называется достоверной…",
    "answers": [
      {
        "text": "она красиво оформлена",
        "isCorrect": false
      },
      {
        "text": "она соответствует реальности",
        "isCorrect": true
      },
      {
        "text": "она получена из интернета",
        "isCorrect": false
      },
      {
        "text": "она не содержит цифр",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 11,
    "question": "Как называется информация, если она искажена умышленно?",
    "answers": [
      {
        "text": "Ложная информация",
        "isCorrect": true
      },
      {
        "text": "Служебная информация",
        "isCorrect": false
      },
      {
        "text": "Ошибочная информация",
        "isCorrect": false
      },
      {
        "text": "Конфиденциальная информация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 12,
    "question": "Какая из этих формул является формулой Шеннона?",
    "answers": [
      {
        "text": "H = – Σ pᵢ log₂ pᵢ",
        "isCorrect": true
      },
      {
        "text": "I = k ln N",
        "isCorrect": false
      },
      {
        "text": "Q = U · I",
        "isCorrect": false
      },
      {
        "text": "S = a + b · log t",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 13,
    "question": "Предметом защиты в КС является…",
    "answers": [
      {
        "text": "Информация",
        "isCorrect": true
      },
      {
        "text": "Жёсткий диск",
        "isCorrect": false
      },
      {
        "text": "Блок питания",
        "isCorrect": false
      },
      {
        "text": "Сетевая карта",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 14,
    "question": "С помощью какого выражения определяется зависимость ценности информации от времени?",
    "answers": [
      {
        "text": "C(t) = C₀ · e⁻ᵏᵗ",
        "isCorrect": true
      },
      {
        "text": "T = k · log₂ N",
        "isCorrect": false
      },
      {
        "text": "S = p · q",
        "isCorrect": false
      },
      {
        "text": "R = p / t",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 15,
    "question": "Компьютерные системы относятся к классу…",
    "answers": [
      {
        "text": "Автоматизированных систем",
        "isCorrect": true
      },
      {
        "text": "Гидравлических систем",
        "isCorrect": false
      },
      {
        "text": "Тепловых систем",
        "isCorrect": false
      },
      {
        "text": "Физико-механических систем",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 16,
    "question": "Целью создания любой КС является…",
    "answers": [
      {
        "text": "Обработка информации",
        "isCorrect": true
      },
      {
        "text": "Ускорение интернета",
        "isCorrect": false
      },
      {
        "text": "Создание мультимедиа",
        "isCorrect": false
      },
      {
        "text": "Охлаждение оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 17,
    "question": "Какой подход предложил Шрейдер к измерению количества информации?",
    "answers": [
      {
        "text": "Вероятностный",
        "isCorrect": true
      },
      {
        "text": "Логический",
        "isCorrect": false
      },
      {
        "text": "Комбинаторный",
        "isCorrect": false
      },
      {
        "text": "Иерархический",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 18,
    "question": "Компьютерные системы, в которых обеспечивается безопасность информации, называются…",
    "answers": [
      {
        "text": "Защищённые",
        "isCorrect": true
      },
      {
        "text": "Открытые",
        "isCorrect": false
      },
      {
        "text": "Рекламные",
        "isCorrect": false
      },
      {
        "text": "Облегчённые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 19,
    "question": "Компьютерная система — это…",
    "answers": [
      {
        "text": "Комплекс аппаратных и программных средств для хранения, обработки и передачи информации",
        "isCorrect": true
      },
      {
        "text": "Только компьютер без периферии",
        "isCorrect": false
      },
      {
        "text": "Набор сетевых кабелей",
        "isCorrect": false
      },
      {
        "text": "Операционная система",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 20,
    "question": "Зависимость ценности информации от времени приближённо определяется в соответствии с выражением:",
    "answers": [
      {
        "text": "C(t) = C₀ · e⁻ᵏᵗ",
        "isCorrect": true
      },
      {
        "text": "P = m · g",
        "isCorrect": false
      },
      {
        "text": "Q = I²R",
        "isCorrect": false
      },
      {
        "text": "S = a + bt",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 21,
    "question": "Перечислите несколько подходов к измерению количества информации?",
    "answers": [
      {
        "text": "Вероятностный, алфавитный, семантический",
        "isCorrect": true
      },
      {
        "text": "Географический, биометрический, таксономический",
        "isCorrect": false
      },
      {
        "text": "Физический, реактивный, адаптивный",
        "isCorrect": false
      },
      {
        "text": "Графический, линейный, координатный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 22,
    "question": "Объектом защиты информации является компьютерная…",
    "answers": [
      {
        "text": "Информация",
        "isCorrect": true
      },
      {
        "text": "Клавиатура",
        "isCorrect": false
      },
      {
        "text": "Материнская плата",
        "isCorrect": false
      },
      {
        "text": "Память",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 23,
    "question": "… – это комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации.",
    "answers": [
      {
        "text": "Компьютерная система",
        "isCorrect": true
      },
      {
        "text": "Локальная сеть",
        "isCorrect": false
      },
      {
        "text": "Электронный документ",
        "isCorrect": false
      },
      {
        "text": "Сервер",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 24,
    "question": "… рассматривается как информация, хранящаяся, обрабатываемая в компьютерных системах.",
    "answers": [
      {
        "text": "Компьютерная информация",
        "isCorrect": true
      },
      {
        "text": "Архивный документ",
        "isCorrect": false
      },
      {
        "text": "Физический носитель",
        "isCorrect": false
      },
      {
        "text": "Электронное письмо",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 25,
    "question": "Дайте понятие организации защиты информации.",
    "answers": [
      {
        "text": "Совокупность мер, методов и средств, направленных на обеспечение безопасности информации",
        "isCorrect": true
      },
      {
        "text": "Настройка цветовой схемы интерфейса",
        "isCorrect": false
      },
      {
        "text": "Ремонт компьютерного оборудования",
        "isCorrect": false
      },
      {
        "text": "Установка драйверов и программ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 26,
    "question": "Компьютерная система или автоматизированная система обработки данных является…",
    "answers": [
      {
        "text": "Набором случайных устройств",
        "isCorrect": false
      },
      {
        "text": "Совокупностью аппаратных и программных средств для обработки информации",
        "isCorrect": true
      },
      {
        "text": "Только процессором и памятью",
        "isCorrect": false
      },
      {
        "text": "Любым электронным оборудованием",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 27,
    "question": "… - это комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации.",
    "answers": [
      {
        "text": "Компьютерная система",
        "isCorrect": true
      },
      {
        "text": "Локальная сеть",
        "isCorrect": false
      },
      {
        "text": "Системный блок",
        "isCorrect": false
      },
      {
        "text": "Интерфейс",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 28,
    "question": "Единый комплекс правовых норм, организационных мер, технических, программных и криптографических средств, обеспечивающих защищенность информации называется …",
    "answers": [
      {
        "text": "Информационный канал",
        "isCorrect": false
      },
      {
        "text": "Система защиты информации",
        "isCorrect": true
      },
      {
        "text": "Модель угроз",
        "isCorrect": false
      },
      {
        "text": "Программный комплекс",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 29,
    "question": "Техническое, программное средство, вещество и/или материал, предназначенные или используемые для защиты информации — это…",
    "answers": [
      {
        "text": "Информационный объект",
        "isCorrect": false
      },
      {
        "text": "Средство защиты информации",
        "isCorrect": true
      },
      {
        "text": "Ложная информация",
        "isCorrect": false
      },
      {
        "text": "Программный модуль",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 30,
    "question": "Информация хранится и передается на:",
    "answers": [
      {
        "text": "Только в оперативной памяти",
        "isCorrect": false
      },
      {
        "text": "На носителях информации",
        "isCorrect": true
      },
      {
        "text": "Только в облаке",
        "isCorrect": false
      },
      {
        "text": "Только в устройствах ввода",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 31,
    "question": "Если доступ к информации ограничивается, то такая информация является…",
    "answers": [
      {
        "text": "Открытой",
        "isCorrect": false
      },
      {
        "text": "Конфиденциальной",
        "isCorrect": true
      },
      {
        "text": "Ошибочной",
        "isCorrect": false
      },
      {
        "text": "Общедоступной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 32,
    "question": "Информации не присущи следующие свойства:",
    "answers": [
      {
        "text": "Полезность",
        "isCorrect": false
      },
      {
        "text": "Актуальность",
        "isCorrect": false
      },
      {
        "text": "Вес и объём как физического объекта",
        "isCorrect": true
      },
      {
        "text": "Достоверность",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 33,
    "question": "Комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации — это:",
    "answers": [
      {
        "text": "Компьютерная система",
        "isCorrect": true
      },
      {
        "text": "Сетевая топология",
        "isCorrect": false
      },
      {
        "text": "Драйвер",
        "isCorrect": false
      },
      {
        "text": "Серверный шкаф",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 34,
    "question": "Под еди¬ным комплексом правовых норм, организационных мер, техниче¬ских, программных и криптографических средств, обеспечиваю¬щий защищенность информации в КС в соответствии с принятой политикой безопасности понимается:",
    "answers": [
      {
        "text": "Система защиты информации",
        "isCorrect": true
      },
      {
        "text": "Лицензионный договор",
        "isCorrect": false
      },
      {
        "text": "Программа обеспечения",
        "isCorrect": false
      },
      {
        "text": "Сертификат безопасности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 35,
    "question": "Существующие подходы к измерению количества информации?",
    "answers": [
      {
        "text": "Биологический, реактивный",
        "isCorrect": false
      },
      {
        "text": "Алфавитный, вероятностный, семантический",
        "isCorrect": true
      },
      {
        "text": "Геометрический, линейный",
        "isCorrect": false
      },
      {
        "text": "Электрический, тепловой",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 36,
    "question": "Достоверной называется такая информация…",
    "answers": [
      {
        "text": "Которая легко передаётся",
        "isCorrect": false
      },
      {
        "text": "Которая соответствует реальности",
        "isCorrect": true
      },
      {
        "text": "Которая распространяется быстро",
        "isCorrect": false
      },
      {
        "text": "Которая находится в базе данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 37,
    "question": "Искаженную информацию называют…",
    "answers": [
      {
        "text": "Архивной",
        "isCorrect": false
      },
      {
        "text": "Дезинформацией",
        "isCorrect": true
      },
      {
        "text": "Логической",
        "isCorrect": false
      },
      {
        "text": "Оптимизированной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 38,
    "question": "Информация, которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках, называется…",
    "answers": [
      {
        "text": "Достоверная информация",
        "isCorrect": true
      },
      {
        "text": "Сжатая информация",
        "isCorrect": false
      },
      {
        "text": "Кодированная информация",
        "isCorrect": false
      },
      {
        "text": "Ресурсная информация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 39,
    "question": "Какая информация называется достоверной?",
    "answers": [
      {
        "text": "Которая создана на компьютере",
        "isCorrect": false
      },
      {
        "text": "Которая красиво оформлена",
        "isCorrect": false
      },
      {
        "text": "Которая соответствует действительности",
        "isCorrect": true
      },
      {
        "text": "Которая зашифрована",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 40,
    "question": "Степенью полезности информации для владельца определяется её…",
    "answers": [
      {
        "text": "Скорость",
        "isCorrect": false
      },
      {
        "text": "Ценность",
        "isCorrect": true
      },
      {
        "text": "Длина",
        "isCorrect": false
      },
      {
        "text": "Формат",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 41,
    "question": "… - называется информация, которая искажена умышленно.",
    "answers": [
      {
        "text": "Дезинформация",
        "isCorrect": true
      },
      {
        "text": "Ошибка системы",
        "isCorrect": false
      },
      {
        "text": "Информационный шум",
        "isCorrect": false
      },
      {
        "text": "Системный сбой",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 42,
    "question": "Дезинформацией называется …",
    "answers": [
      {
        "text": "Информация, хранящаяся на сервере",
        "isCorrect": false
      },
      {
        "text": "Информация, намеренно искажённая",
        "isCorrect": true
      },
      {
        "text": "Информация, потерянная при передаче",
        "isCorrect": false
      },
      {
        "text": "Информация, прошедшая шифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 43,
    "question": "Под угрозой безопасности информации понимается…",
    "answers": [
      {
        "text": "Любая полезная информация",
        "isCorrect": false
      },
      {
        "text": "Возможность нарушения конфиденциальности, целостности или доступности информации",
        "isCorrect": true
      },
      {
        "text": "Процесс обновления данных",
        "isCorrect": false
      },
      {
        "text": "Любой сетевой обмен",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 44,
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют…",
    "answers": [
      {
        "text": "Непреднамеренными угрозами",
        "isCorrect": true
      },
      {
        "text": "Активными атаками",
        "isCorrect": false
      },
      {
        "text": "Программными угрозами",
        "isCorrect": false
      },
      {
        "text": "Пассивными атаками",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 45,
    "question": "Угрозы безопасности информации в КС делятся на:",
    "answers": [
      {
        "text": "Внутренние и цифровые",
        "isCorrect": false
      },
      {
        "text": "Преднамеренные и непреднамеренные",
        "isCorrect": true
      },
      {
        "text": "Основные и резервные",
        "isCorrect": false
      },
      {
        "text": "Конечные и начальные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 46,
    "question": "В результате сбоев и отказов нарушается…",
    "answers": [
      {
        "text": "Конфиденциальность",
        "isCorrect": false
      },
      {
        "text": "Доступность",
        "isCorrect": true
      },
      {
        "text": "Форматирование данных",
        "isCorrect": false
      },
      {
        "text": "Производительность процессора",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 47,
    "question": "«Логические бомбы» — это…",
    "answers": [
      {
        "text": "Оборудование для криптографии",
        "isCorrect": false
      },
      {
        "text": "Программы, которые активируются при наступлении определённых условий",
        "isCorrect": true
      },
      {
        "text": "Случайные ошибки в алгоритмах",
        "isCorrect": false
      },
      {
        "text": "Механизмы резервного копирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 48,
    "question": "«Червями» называются…",
    "answers": [
      {
        "text": "Аппаратные средства защиты",
        "isCorrect": false
      },
      {
        "text": "Программы, которые работают только внутри одного файла",
        "isCorrect": false
      },
      {
        "text": "Самораспространяющиеся программы, распространяющиеся по сетям",
        "isCorrect": true
      },
      {
        "text": "Набор команд для архивирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 49,
    "question": "«Троянские кони» — это…",
    "answers": [
      {
        "text": "Антивирусные программы",
        "isCorrect": false
      },
      {
        "text": "Вредоносные программы, замаскированные под полезные",
        "isCorrect": true
      },
      {
        "text": "Ошибки в операционной системе",
        "isCorrect": false
      },
      {
        "text": "Средства шифрования данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 50,
    "question": "«Компьютерные вирусы» — это…",
    "answers": [
      {
        "text": "Ошибки при передаче информации",
        "isCorrect": false
      },
      {
        "text": "Программы, ускоряющие работу системы",
        "isCorrect": false
      },
      {
        "text": "Вредоносные программы, способные к самокопированию",
        "isCorrect": true
      },
      {
        "text": "Модули, отвечающие за обновления",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 51,
    "question": "Злоумышленником может быть…",
    "answers": [
      {
        "text": "разработчик КС",
        "isCorrect": false
      },
      {
        "text": "сотрудник из числа обслуживающего персонала",
        "isCorrect": false
      },
      {
        "text": "пользователь",
        "isCorrect": false
      },
      {
        "text": "постороннее лицо",
        "isCorrect": false
      },
      {
        "text": "уборщица",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 52,
    "question": "Несанкционированный доступ к информации возможен только с использованием штатных аппаратных и программных средств в следующем случае...",
    "answers": [
      {
        "text": "отсутствует система разграничения доступа",
        "isCorrect": true
      },
      {
        "text": "сбой или отказ в КС, ошибки в СРД",
        "isCorrect": false
      },
      {
        "text": "ошибочные действия пользователей или обслуживающего персонала компьютерных систем",
        "isCorrect": false
      },
      {
        "text": "фальсификация полномочий",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 53,
    "question": "Термин «несанкционированный доступ к информации» (НСДИ) определен как…",
    "answers": [
      {
        "text": "регистрация пользователей",
        "isCorrect": false
      },
      {
        "text": "доступ, нарушающий правила разграничения доступа",
        "isCorrect": true
      },
      {
        "text": "работа с резервными копиями",
        "isCorrect": false
      },
      {
        "text": "использование лицензированного ПО",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 54,
    "question": "Под правилами разграничения доступа понимается…",
    "answers": [
      {
        "text": "установленный порядок определения прав пользователей",
        "isCorrect": true
      },
      {
        "text": "структура ЛВС",
        "isCorrect": false
      },
      {
        "text": "установка драйверов устройств",
        "isCorrect": false
      },
      {
        "text": "запуск процессов ядра",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 55,
    "question": "Электромагнитные излучения используются злоумышленниками не только для получения информации, но и для её…",
    "answers": [
      {
        "text": "разрушения",
        "isCorrect": true
      },
      {
        "text": "кодирования",
        "isCorrect": false
      },
      {
        "text": "резервирования",
        "isCorrect": false
      },
      {
        "text": "шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 56,
    "question": "Электромагнитные импульсы способны уничтожить информацию на…",
    "answers": [
      {
        "text": "флеш-памяти",
        "isCorrect": false
      },
      {
        "text": "магнитных носителях",
        "isCorrect": true
      },
      {
        "text": "принтере",
        "isCorrect": false
      },
      {
        "text": "сетевом адаптере",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 57,
    "question": "Стетоскопные микрофоны позволяют прослушивать разговоры при толщине стен до…",
    "answers": [
      {
        "text": "10 см",
        "isCorrect": false
      },
      {
        "text": "20 см",
        "isCorrect": false
      },
      {
        "text": "50 см",
        "isCorrect": true
      },
      {
        "text": "1 м",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 58,
    "question": "Реальное расстояние подслушивания с помощью направленных микрофонов составляет…",
    "answers": [
      {
        "text": "до 10 м",
        "isCorrect": false
      },
      {
        "text": "до 20 м",
        "isCorrect": false
      },
      {
        "text": "до 50 м",
        "isCorrect": false
      },
      {
        "text": "до 100 м",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 59,
    "question": "Обеспечение безопасности информации в КС должно предусматривать…",
    "answers": [
      {
        "text": "мониторинг температуры процессора",
        "isCorrect": false
      },
      {
        "text": "комплекс организационных и технических мер",
        "isCorrect": true
      },
      {
        "text": "ускорение работы сети",
        "isCorrect": false
      },
      {
        "text": "резервирование принтера",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 60,
    "question": "Радиозакладки, рассчитаны на работу в диапазоне расстояния…",
    "answers": [
      {
        "text": "1–5 м",
        "isCorrect": false
      },
      {
        "text": "50–300 м",
        "isCorrect": true
      },
      {
        "text": "500–800 м",
        "isCorrect": false
      },
      {
        "text": "до 5 км",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 61,
    "question": "Радиозакладки, могут использовать в качестве источника…",
    "answers": [
      {
        "text": "бумагу",
        "isCorrect": false
      },
      {
        "text": "флеш-память",
        "isCorrect": false
      },
      {
        "text": "сеть электропитания",
        "isCorrect": true
      },
      {
        "text": "BIOS",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 62,
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют",
    "answers": [
      {
        "text": "случайными",
        "isCorrect": true
      },
      {
        "text": "активными",
        "isCorrect": false
      },
      {
        "text": "пассивными",
        "isCorrect": false
      },
      {
        "text": "интеллектуальными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 63,
    "question": "Этот термин  определен как доступ к информации, нарушающий правила разграничения доступа с использованием штатных средств вычислительной техники или автоматизированных систем:",
    "answers": [
      {
        "text": "санкционированный доступ",
        "isCorrect": false
      },
      {
        "text": "доступ, нарушающий правила разграничения",
        "isCorrect": true
      },
      {
        "text": "временное хранение",
        "isCorrect": false
      },
      {
        "text": "перенос данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 64,
    "question": "Кто определяет право доступа к ресурсам КС?",
    "answers": [
      {
        "text": "администратор системы",
        "isCorrect": true
      },
      {
        "text": "пользователь",
        "isCorrect": false
      },
      {
        "text": "программист",
        "isCorrect": false
      },
      {
        "text": "оператор печати",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 65,
    "question": "Не представляет большую угрозу безопасности информации в КС:",
    "answers": [
      {
        "text": "вирусы",
        "isCorrect": false
      },
      {
        "text": "трояны",
        "isCorrect": false
      },
      {
        "text": "временные файлы",
        "isCorrect": true
      },
      {
        "text": "сетевые атаки",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 66,
    "question": "Одним из основных источников угроз безопасности информации в КС является использование специальных программ, получивших общее название:",
    "answers": [
      {
        "text": "архиваторами",
        "isCorrect": false
      },
      {
        "text": "вредоносными",
        "isCorrect": true
      },
      {
        "text": "планировщиками",
        "isCorrect": false
      },
      {
        "text": "компиляторами",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 67,
    "question": "Не относится к вредительским программам…",
    "answers": [
      {
        "text": "вирусы",
        "isCorrect": false
      },
      {
        "text": "трояны",
        "isCorrect": false
      },
      {
        "text": "логические бомбы",
        "isCorrect": false
      },
      {
        "text": "архиваторы",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 68,
    "question": "Программы или их части, постоянно находящиеся в ЭВМ или вычислительных системах и выполняемые только при соблюдении определенных условий - это:",
    "answers": [
      {
        "text": "логические бомбы",
        "isCorrect": true
      },
      {
        "text": "драйверы",
        "isCorrect": false
      },
      {
        "text": "макросы",
        "isCorrect": false
      },
      {
        "text": "редакторы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 69,
    "question": "Программы, которые выполняются каждый раз при загрузке системы, обладают способностью перемещаться в ВС или сети и самовоспроизводить копии, называются:",
    "answers": [
      {
        "text": "трояны",
        "isCorrect": false
      },
      {
        "text": "черви",
        "isCorrect": true
      },
      {
        "text": "резиденты",
        "isCorrect": false
      },
      {
        "text": "архиваторы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 70,
    "question": "Программы, полученные путем явного изменения или добавления команд в пользовательские программы – это:",
    "answers": [
      {
        "text": "модифицированные (инфицированные) программы",
        "isCorrect": true
      },
      {
        "text": "драйверы",
        "isCorrect": false
      },
      {
        "text": "антивирусы",
        "isCorrect": false
      },
      {
        "text": "виртуальные машины",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 71,
    "question": "Небольшие программы, кото¬рые после внедрения в ЭВМ самостоятельно распространяются путем создания своих копий, а при выполнении определенных условий оказывают негативное воздействие на КС-это:",
    "answers": [
      {
        "text": "вирусы",
        "isCorrect": true
      },
      {
        "text": "утилиты",
        "isCorrect": false
      },
      {
        "text": "драйверы",
        "isCorrect": false
      },
      {
        "text": "фильтры",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 72,
    "question": "Стихийные бедствия относятся к…",
    "answers": [
      {
        "text": "природным угрозам",
        "isCorrect": true
      },
      {
        "text": "техногенным",
        "isCorrect": false
      },
      {
        "text": "преднамеренным",
        "isCorrect": false
      },
      {
        "text": "случайным",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 73,
    "question": "Электромагнитные излучения и наводки относятся к…",
    "answers": [
      {
        "text": "программным угрозам",
        "isCorrect": false
      },
      {
        "text": "техногенным угрозам",
        "isCorrect": true
      },
      {
        "text": "природным угрозам",
        "isCorrect": false
      },
      {
        "text": "организационным мерам",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 74,
    "question": "Несанкционированный доступ к информации относится к…",
    "answers": [
      {
        "text": "природным угрозам",
        "isCorrect": false
      },
      {
        "text": "преднамеренным угрозам",
        "isCorrect": true
      },
      {
        "text": "бытовым факторам",
        "isCorrect": false
      },
      {
        "text": "техобслуживанию",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 75,
    "question": "Сбои и отказы технических средств относятся к…",
    "answers": [
      {
        "text": "преднамеренным угрозам",
        "isCorrect": false
      },
      {
        "text": "техногенным угрозам",
        "isCorrect": true
      },
      {
        "text": "природным",
        "isCorrect": false
      },
      {
        "text": "криптографическим",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 76,
    "question": "Алгоритмические и программные ошибки относятся к …",
    "answers": [
      {
        "text": "Природным угрозам",
        "isCorrect": false
      },
      {
        "text": "Преднамеренным угрозам",
        "isCorrect": false
      },
      {
        "text": "Случайным угрозам",
        "isCorrect": true
      },
      {
        "text": "Электромагнитным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 77,
    "question": "Стихийные бедствия относятся…",
    "answers": [
      {
        "text": "К техногенным угрозам",
        "isCorrect": false
      },
      {
        "text": "К природным угрозам",
        "isCorrect": true
      },
      {
        "text": "К организационным угрозам",
        "isCorrect": false
      },
      {
        "text": "К преднамеренным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 78,
    "question": "В зависимости от механизма действия вредительские программы делятся на…",
    "answers": [
      {
        "text": "«черви»",
        "isCorrect": true
      },
      {
        "text": "«троянские кони»",
        "isCorrect": true
      },
      {
        "text": "«компьютерные вирусы»",
        "isCorrect": true
      },
      {
        "text": "«логические бомбы»",
        "isCorrect": true
      },
      {
        "text": "«вредоносные события»",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 79,
    "question": "Комплексная система защиты информации создается на объектах для … всех возможных или, по крайней мере, наиболее вероятных угроз безопасности информации.",
    "answers": [
      {
        "text": "Снижения стоимости оборудования",
        "isCorrect": false
      },
      {
        "text": "Обеспечения стабильности сети",
        "isCorrect": false
      },
      {
        "text": "Ограничения доступа пользователей",
        "isCorrect": false
      },
      {
        "text": "Нейтрализации всех возможных или наиболее вероятных угроз",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 80,
    "question": "Какие методы защиты информации используются для блокирования (парирования) нескольких угроз?",
    "answers": [
      {
        "text": "Только программные",
        "isCorrect": false
      },
      {
        "text": "Только аппаратные",
        "isCorrect": false
      },
      {
        "text": "Только правовые",
        "isCorrect": false
      },
      {
        "text": "Комплексные методы защиты",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 81,
    "question": "Правовой статус информации устанавливается с учетом ее … и степени достоверности, которую способна обеспечить компьютерная система.",
    "answers": [
      {
        "text": "Формы хранения",
        "isCorrect": false
      },
      {
        "text": "Способа получения",
        "isCorrect": false
      },
      {
        "text": "Ценности и достоверности",
        "isCorrect": true
      },
      {
        "text": "Количества пользователей",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 82,
    "question": "Важной составляющей правового регулирования в области информационных технологий является:",
    "answers": [
      {
        "text": "Техническое обслуживание",
        "isCorrect": false
      },
      {
        "text": "Электромагнитный контроль",
        "isCorrect": false
      },
      {
        "text": "Информационное законодательство",
        "isCorrect": true
      },
      {
        "text": "Сетевые протоколы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 83,
    "question": "Преступления, совершенные с использованием КС или причинившие ущерб владельцам компьютерных систем, получили название … .",
    "answers": [
      {
        "text": "Правонарушениями общего вида",
        "isCorrect": false
      },
      {
        "text": "Социальными преступлениями",
        "isCorrect": false
      },
      {
        "text": "Кибератаками бытового уровня",
        "isCorrect": false
      },
      {
        "text": "Компьютерными преступлениями",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 84,
    "question": "По времени восстановления информации методы дублирования могут быть разделены на…",
    "answers": [
      {
        "text": "Программные и аппаратные",
        "isCorrect": false
      },
      {
        "text": "Быстровосстанавливающие и медленно восстанавливающие",
        "isCorrect": true
      },
      {
        "text": "Дорогие и дешёвые",
        "isCorrect": false
      },
      {
        "text": "Сетевые и автономные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 85,
    "question": "Методы дублирования информации, которые позволяют использовать дублирующую информацию в реальном масштабе времени относятся к…",
    "answers": [
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Гибридное копирование",
        "isCorrect": false
      },
      {
        "text": "Кластеризация",
        "isCorrect": false
      },
      {
        "text": "Зеркальное копирование",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 86,
    "question": "Помехоустойчивое кодирование — это…",
    "answers": [
      {
        "text": "Оптимизация сетевого трафика",
        "isCorrect": false
      },
      {
        "text": "Введение избыточности для исправления ошибок",
        "isCorrect": true
      },
      {
        "text": "Шифрование данных",
        "isCorrect": false
      },
      {
        "text": "Дублирование данных на сервере",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 87,
    "question": "В соответствии с процедурой дублирования различают методы…",
    "answers": [
      {
        "text": "Нулевое и гибридное копирование",
        "isCorrect": false
      },
      {
        "text": "Интенсивное и пассивное копирование",
        "isCorrect": false
      },
      {
        "text": "Полное и частичное копирование",
        "isCorrect": true
      },
      {
        "text": "Стандартное и сверхнадёжное",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 88,
    "question": "При зеркальном копировании…",
    "answers": [
      {
        "text": "Данные копируются раз в сутки",
        "isCorrect": false
      },
      {
        "text": "Данные записываются одновременно на два диска",
        "isCorrect": true
      },
      {
        "text": "Информация переносится только вручную",
        "isCorrect": false
      },
      {
        "text": "Дублирование происходит по расписанию",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 89,
    "question": "По виду дублирующей информации методы дубли¬рования разделяются на…",
    "answers": [
      {
        "text": "Документальные и цифровые",
        "isCorrect": false
      },
      {
        "text": "Аудио и визуальные",
        "isCorrect": false
      },
      {
        "text": "Аппаратные и программные",
        "isCorrect": true
      },
      {
        "text": "Сетевые и локальные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 90,
    "question": "Частичное копирование предполагает…",
    "answers": [
      {
        "text": "Копирование всего диска",
        "isCorrect": false
      },
      {
        "text": "Копирование лишь изменённых данных",
        "isCorrect": true
      },
      {
        "text": "Создание только системного образа",
        "isCorrect": false
      },
      {
        "text": "Ручной перенос файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 91,
    "question": "Как называется жесткий магнитный диск отдельного накопителя, на котором хранится информация, полностью идентичная информации на рабочем диске?",
    "answers": [
      {
        "text": "Backup-диск",
        "isCorrect": false
      },
      {
        "text": "Зеркальный диск",
        "isCorrect": true
      },
      {
        "text": "Локальный диск",
        "isCorrect": false
      },
      {
        "text": "Архивный диск",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 92,
    "question": "Съемные машинные носители могут использоваться для дублирования информации…",
    "answers": [
      {
        "text": "Только системных файлов",
        "isCorrect": false
      },
      {
        "text": "Только операционной системы",
        "isCorrect": false
      },
      {
        "text": "Для резервного офлайн-копирования",
        "isCorrect": true
      },
      {
        "text": "Исключительно сетевых данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 93,
    "question": "Любая отказоустойчивая система обладает…",
    "answers": [
      {
        "text": "Повышенной скоростью",
        "isCorrect": false
      },
      {
        "text": "Уменьшенной нагрузкой",
        "isCorrect": false
      },
      {
        "text": "Минимальной стоимостью",
        "isCorrect": false
      },
      {
        "text": "Избыточностью",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 94,
    "question": "Для блокировки ошибочных действий используются…",
    "answers": [
      {
        "text": "Цветовые индикаторы",
        "isCorrect": false
      },
      {
        "text": "Средства контроля и фильтрации действий",
        "isCorrect": true
      },
      {
        "text": "Внешние антенны",
        "isCorrect": false
      },
      {
        "text": "Механические устройства",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 95,
    "question": "Одним из наиболее простых и действенных путей создания отказоустойчивых систем является…",
    "answers": [
      {
        "text": "Обновление интерфейса",
        "isCorrect": false
      },
      {
        "text": "Снижение трафика",
        "isCorrect": false
      },
      {
        "text": "Резервирование",
        "isCorrect": true
      },
      {
        "text": "Увеличение мощности вентиляции",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 96,
    "question": "Какое кодирование основано на использовании информационной избыточности?",
    "answers": [
      {
        "text": "Оптимизационное",
        "isCorrect": false
      },
      {
        "text": "Графическое",
        "isCorrect": false
      },
      {
        "text": "Помехоустойчивое",
        "isCorrect": true
      },
      {
        "text": "Контрольное",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 97,
    "question": "Какое резервирование основано на использовании устройств, блоков, узлов, схем только в качестве резервных?",
    "answers": [
      {
        "text": "Линейное резервирование",
        "isCorrect": false
      },
      {
        "text": "Standby-резервирование",
        "isCorrect": true
      },
      {
        "text": "Циклическое резервирование",
        "isCorrect": false
      },
      {
        "text": "Многоуровневое резервирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 98,
    "question": "Помехоустойчивое кодирование наиболее эффективно при па¬рировании самоустраняющихся отказов, называемых",
    "answers": [
      {
        "text": "Разрушительных отказах",
        "isCorrect": false
      },
      {
        "text": "Полных физических сбоях",
        "isCorrect": false
      },
      {
        "text": "Самоустраняющихся отказах",
        "isCorrect": true
      },
      {
        "text": "Физическом повреждении носителя",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 99,
    "question": "Наиболее совершенными системами, устойчивыми к отказам, являются:",
    "answers": [
      {
        "text": "Системы с одной резервной копией",
        "isCorrect": false
      },
      {
        "text": "Локальные автономные системы",
        "isCorrect": false
      },
      {
        "text": "Системы с многократным резервированием",
        "isCorrect": true
      },
      {
        "text": "Узкоспециализированные терминалы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 100,
    "question": "Какие средства позволяют блокировать вычислительный процесс?",
    "answers": [
      {
        "text": "Сетевые маршрутизаторы",
        "isCorrect": false
      },
      {
        "text": "Пульт наблюдения",
        "isCorrect": false
      },
      {
        "text": "Средства защиты и прерывания",
        "isCorrect": true
      },
      {
        "text": "Любые виртуальные машины",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 101,
    "question": "На каком уровне могут устанавливаться атрибуты файлов?",
    "answers": [
      {
        "text": "На уровне сетевого протокола",
        "isCorrect": false
      },
      {
        "text": "На уровне файловой системы",
        "isCorrect": true
      },
      {
        "text": "На уровне BIOS",
        "isCorrect": false
      },
      {
        "text": "На уровне процессора",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 102,
    "question": "Одним из основных направлений защиты информации в КС от непреднамеренных угроз являются…",
    "answers": [
      {
        "text": "Аппаратные закладки",
        "isCorrect": false
      },
      {
        "text": "Методы повышения надежности",
        "isCorrect": true
      },
      {
        "text": "Средства криптоанализа",
        "isCorrect": false
      },
      {
        "text": "Социальная инженерия",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 103,
    "question": "Атрибуты файлов устанавливаются на…",
    "answers": [
      {
        "text": "Уровне программ пользователя",
        "isCorrect": false
      },
      {
        "text": "Уровне операционной памяти",
        "isCorrect": false
      },
      {
        "text": "Уровне файловой системы",
        "isCorrect": true
      },
      {
        "text": "Уровне сетевых устройств",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 104,
    "question": "Какие коды обладают различными возможностями по обнаружению и исправлению ошибок?",
    "answers": [
      {
        "text": "Пароли доступа",
        "isCorrect": false
      },
      {
        "text": "Графические коды",
        "isCorrect": false
      },
      {
        "text": "Корректирующие коды",
        "isCorrect": true
      },
      {
        "text": "Кодеки мультимедиа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 105,
    "question": "Какие средства позволяют блокировать вычислительный процесс при нарушениях адресных пространств оперативной памяти?",
    "answers": [
      {
        "text": "Антивирусы",
        "isCorrect": false
      },
      {
        "text": "Сетевые экраны",
        "isCorrect": false
      },
      {
        "text": "Средства защиты памяти (MMU, аппаратные проверки)",
        "isCorrect": true
      },
      {
        "text": "Файрволы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 106,
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени называются…",
    "answers": [
      {
        "text": "Внешними",
        "isCorrect": false
      },
      {
        "text": "Активными",
        "isCorrect": false
      },
      {
        "text": "Непреднамеренными",
        "isCorrect": true
      },
      {
        "text": "Целенаправленными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 107,
    "question": "Несанкционированный доступ к информации – это…",
    "answers": [
      {
        "text": "Защита данных",
        "isCorrect": false
      },
      {
        "text": "Доступ к информации без прав",
        "isCorrect": true
      },
      {
        "text": "Резервное копирование",
        "isCorrect": false
      },
      {
        "text": "Политика безопасности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 108,
    "question": "По времени восстановления информации методы дублирования могут быть разделены на:",
    "answers": [
      {
        "text": "Шифрованные и нешифрованные",
        "isCorrect": false
      },
      {
        "text": "Горячее, тёплое и холодное резервирование",
        "isCorrect": true
      },
      {
        "text": "Локальное и удалённое",
        "isCorrect": false
      },
      {
        "text": "Активное и пассивное",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 109,
    "question": "По числу копий методы дублирования делятся на:",
    "answers": [
      {
        "text": "Документированные и недокументированные",
        "isCorrect": false
      },
      {
        "text": "Аппаратные и программные",
        "isCorrect": false
      },
      {
        "text": "Однократные и многократные",
        "isCorrect": true
      },
      {
        "text": "Горизонтальные и вертикальные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 110,
    "question": "Свойство системы выполнять возложенные на нее задачи в определённых условиях эксплуатации:",
    "answers": [
      {
        "text": "Доступность",
        "isCorrect": false
      },
      {
        "text": "Конфиденциальность",
        "isCorrect": false
      },
      {
        "text": "Надёжность",
        "isCorrect": true
      },
      {
        "text": "Эффективность",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 111,
    "question": "Как правило, ценность информации со временем…",
    "answers": [
      {
        "text": "Растёт",
        "isCorrect": false
      },
      {
        "text": "Уменьшается",
        "isCorrect": true
      },
      {
        "text": "Не изменяется",
        "isCorrect": false
      },
      {
        "text": "Удваивается",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 112,
    "question": "Как правило ценность информации уменьшается",
    "answers": [
      {
        "text": "Только для государственных структур",
        "isCorrect": false
      },
      {
        "text": "Только для конфиденциальных данных",
        "isCorrect": false
      },
      {
        "text": "Со временем у большинства видов информации",
        "isCorrect": true
      },
      {
        "text": "Только при утечке",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 113,
    "question": "Назовите один из путей получения информации.",
    "answers": [
      {
        "text": "Шифрование",
        "isCorrect": false
      },
      {
        "text": "Наблюдение",
        "isCorrect": true
      },
      {
        "text": "Фильтрация пакетов",
        "isCorrect": false
      },
      {
        "text": "Мониторинг доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 114,
    "question": "Назовите один из путей получения информации.",
    "answers": [
      {
        "text": "Уничтожение данных",
        "isCorrect": false
      },
      {
        "text": "Резервирование",
        "isCorrect": false
      },
      {
        "text": "Перехват",
        "isCorrect": true
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 115,
    "question": "Назовите пути получения информации",
    "answers": [
      {
        "text": "Только через интернет",
        "isCorrect": false
      },
      {
        "text": "Только открытые источники",
        "isCorrect": false
      },
      {
        "text": "Наблюдение, перехват, анализ, опрос, обработка данных",
        "isCorrect": true
      },
      {
        "text": "Только перехват сетевого трафика",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 116,
    "question": "Приобретение информации на рынке – пример",
    "answers": [
      {
        "text": "Несанкционированного доступа",
        "isCorrect": false
      },
      {
        "text": "Хакерской атаки",
        "isCorrect": false
      },
      {
        "text": "Легального получения информации",
        "isCorrect": true
      },
      {
        "text": "Утечки данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 117,
    "question": "Назовите подходы к изменению количества информации",
    "answers": [
      {
        "text": "Только её удаление",
        "isCorrect": false
      },
      {
        "text": "Сжатие и расширение",
        "isCorrect": true
      },
      {
        "text": "Перезапись данных",
        "isCorrect": false
      },
      {
        "text": "Изменение носителя",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 118,
    "question": "По числу копий методы дублирования делятся на:",
    "answers": [
      {
        "text": "Локальные и облачные",
        "isCorrect": false
      },
      {
        "text": "Полные и инкрементальные",
        "isCorrect": false
      },
      {
        "text": "Однократные и многократные",
        "isCorrect": true
      },
      {
        "text": "Прозрачные и скрытые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 119,
    "question": "Процесс преобразования открытой информации в зашифрованную — это…",
    "answers": [
      {
        "text": "Аутентификация",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Буферизация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 120,
    "question": "Какие существуют подходы к созданию отказоустойчивых систем?",
    "answers": [
      {
        "text": "Модернизация интерфейсов",
        "isCorrect": false
      },
      {
        "text": "Дублирование, резервирование, избыточность",
        "isCorrect": true
      },
      {
        "text": "Создание новых ОС",
        "isCorrect": false
      },
      {
        "text": "Отключение сетевых устройств",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 121,
    "question": "Эта система представляет собой множество сосредоточенных компьютерных систем, связанных в единую систему с помощью коммуникационной подсистемы:",
    "answers": [
      {
        "text": "Суперкомпьютер",
        "isCorrect": false
      },
      {
        "text": "Распределенная система",
        "isCorrect": true
      },
      {
        "text": "Микропроцессорный комплекс",
        "isCorrect": false
      },
      {
        "text": "Автономная система",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 122,
    "question": "Коммуникационная подсистема не включает в себя:",
    "answers": [
      {
        "text": "Каналы связи",
        "isCorrect": false
      },
      {
        "text": "Коммуникационное оборудование",
        "isCorrect": false
      },
      {
        "text": "Пользовательские приложения",
        "isCorrect": true
      },
      {
        "text": "Коммуникационные протоколы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 123,
    "question": "Они объединяют элементы сети в единую сеть:",
    "answers": [
      {
        "text": "Принтеры",
        "isCorrect": false
      },
      {
        "text": "Серверы печати",
        "isCorrect": false
      },
      {
        "text": "Коммуникационные устройства (маршрутизаторы, коммутаторы)",
        "isCorrect": true
      },
      {
        "text": "Мониторы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 124,
    "question": "Используются для уплотнения информации перед передачей ее по высокоскоростным каналам:",
    "answers": [
      {
        "text": "Криптомодули",
        "isCorrect": false
      },
      {
        "text": "Прокси-серверы",
        "isCorrect": false
      },
      {
        "text": "Устройства и методы компрессии",
        "isCorrect": true
      },
      {
        "text": "Фильтры пакетов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 125,
    "question": "Для защиты объектов КС от традиционного шпионажа и диверсий должны быть решены следующие задачи:",
    "answers": [
      {
        "text": "создание системы охраны объекта;",
        "isCorrect": true
      },
      {
        "text": "организация работ с конфиденциальными информационными ресурсами на объекте КС;",
        "isCorrect": true
      },
      {
        "text": "противодействие наблюдению;",
        "isCorrect": true
      },
      {
        "text": "противодействие подслушиванию;",
        "isCorrect": true
      },
      {
        "text": "защита от злоумышленных действий персонала.",
        "isCorrect": true
      },
      {
        "text": "ознакомление персонала с современными технологиями",
        "isCorrect": false
      },
      {
        "text": "введение нового программного обеспечения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 126,
    "question": "Назовите рубеж защиты объекта, на котором производятся работы с ценной конфиденциальной информацией. Назовите те из них, которые, как правило, необходимо защищать от шпионажа и диверсий?",
    "answers": [
      {
        "text": "контролируемая территория, здание",
        "isCorrect": false
      },
      {
        "text": "помещение",
        "isCorrect": true
      },
      {
        "text": "устройство, носитель информации",
        "isCorrect": true
      },
      {
        "text": "программа",
        "isCorrect": true
      },
      {
        "text": "информационные ресурсы.",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 127,
    "question": "Система охраны объекта (СОО) КС создается с целью …",
    "answers": [
      {
        "text": "Ускорения вычислений",
        "isCorrect": false
      },
      {
        "text": "Уменьшения затрат на персонал",
        "isCorrect": false
      },
      {
        "text": "Предотвращения несанкционированного доступа и обеспечения безопасности объекта",
        "isCorrect": true
      },
      {
        "text": "Увеличения скорости сети",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 128,
    "question": "Для предотвращения  несанкционированного проникновения на территорию и в помещения объекта посторонних лиц, обслуживающею персо¬нала и пользователей создается …",
    "answers": [
      {
        "text": "Система резервирования",
        "isCorrect": false
      },
      {
        "text": "Система охраны периметра",
        "isCorrect": true
      },
      {
        "text": "Система охлаждения",
        "isCorrect": false
      },
      {
        "text": "Система виртуализации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 129,
    "question": "Что означает идентификация?",
    "answers": [
      {
        "text": "Проверка подлинности личности",
        "isCorrect": false
      },
      {
        "text": "Процедура установления, кто перед системой (присвоение идентификатора)",
        "isCorrect": true
      },
      {
        "text": "Предоставление доступа",
        "isCorrect": false
      },
      {
        "text": "Регистрация событий",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 130,
    "question": "Что означает аутентификация?",
    "answers": [
      {
        "text": "Назначение прав доступа",
        "isCorrect": false
      },
      {
        "text": "Определение ресурсов пользователя",
        "isCorrect": false
      },
      {
        "text": "Проверка подлинности субъекта или объекта",
        "isCorrect": true
      },
      {
        "text": "Шифрование данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 131,
    "question": "Доступны для восприятия только при специальном облучении лучами света?",
    "answers": [
      {
        "text": "Логические каналы",
        "isCorrect": false
      },
      {
        "text": "Электромагнитные поля",
        "isCorrect": false
      },
      {
        "text": "Светящиеся метки (люминофоры, УФ-метки)",
        "isCorrect": true
      },
      {
        "text": "Криптопротоколы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 132,
    "question": "Для биометрической идентификации человека используются:",
    "answers": [
      {
        "text": "Папиллярные узоры пальцев",
        "isCorrect": true
      },
      {
        "text": "Узоры сетчатки глаз",
        "isCorrect": true
      },
      {
        "text": "Форма кисти руки",
        "isCorrect": true
      },
      {
        "text": "Особенности речи",
        "isCorrect": true
      },
      {
        "text": "Форма и размеры лица",
        "isCorrect": true
      },
      {
        "text": "Динамика подписи",
        "isCorrect": true
      },
      {
        "text": "Ритм работы на клавиатуре",
        "isCorrect": true
      },
      {
        "text": "Запах тела",
        "isCorrect": true
      },
      {
        "text": "Термические характеристики тела",
        "isCorrect": true
      },
      {
        "text": "Фигура",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 133,
    "question": "Применяются несколько способов частотного преобразования сигнала:",
    "answers": [
      {
        "text": "Особенности речи",
        "isCorrect": false
      },
      {
        "text": "частотная инверсия спектра сигнала со смещением несущей частоты",
        "isCorrect": true
      },
      {
        "text": "разделение полосы частот речевого сигнала на поддиапазоны с последующей перестановкой и инверсией",
        "isCorrect": true
      },
      {
        "text": "Частотная инверсия спектра сигнала",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 134,
    "question": "Все методы защиты от электромагнитных излучений и наводок можно разделить на …",
    "answers": [
      {
        "text": "Электронные и акустические",
        "isCorrect": false
      },
      {
        "text": "Шумовые и беспроводные",
        "isCorrect": false
      },
      {
        "text": "Пассивные и активные",
        "isCorrect": true
      },
      {
        "text": "Контактные и дистанционные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 135,
    "question": "Пассивные методы обеспечивают…",
    "answers": [
      {
        "text": "Усиление сигнала",
        "isCorrect": false
      },
      {
        "text": "Уменьшение уровня опасного сигнала",
        "isCorrect": true
      },
      {
        "text": "Генерацию шумов",
        "isCorrect": false
      },
      {
        "text": "Наращивание трафика",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 136,
    "question": "Активные методы защиты направлены на…",
    "answers": [
      {
        "text": "Охлаждение оборудования",
        "isCorrect": false
      },
      {
        "text": "Фильтрацию данных",
        "isCorrect": false
      },
      {
        "text": "Создание помех и маскирующих сигналов",
        "isCorrect": true
      },
      {
        "text": "Увеличение скорости каналов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 137,
    "question": "Как называется поле в котором при малых токах и высоких напряжениях в создаваемом поле преобладает электрическая составляющая?",
    "answers": [
      {
        "text": "Магнитное",
        "isCorrect": false
      },
      {
        "text": "Электрическое",
        "isCorrect": true
      },
      {
        "text": "Поле избыточности",
        "isCorrect": false
      },
      {
        "text": "Смешанное",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 138,
    "question": "Как называется поле если в проводнике протекает ток большой величины при малых значениях напряжения, то в поле преобладает магнитная составляющая?",
    "answers": [
      {
        "text": "Электрическое",
        "isCorrect": false
      },
      {
        "text": "Магнитное",
        "isCorrect": true
      },
      {
        "text": "Волновое",
        "isCorrect": false
      },
      {
        "text": "Поле наведений",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 139,
    "question": "Поля, у которых электрическая и магнитная составляющие соизмеримы, называются …",
    "answers": [
      {
        "text": "Низкочастотными",
        "isCorrect": false
      },
      {
        "text": "Полями рассеяния",
        "isCorrect": false
      },
      {
        "text": "Электромагнитными волнами",
        "isCorrect": true
      },
      {
        "text": "Индуктивными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 140,
    "question": "В зависимости от типа создаваемого электромагнитного поля различают следующие виды экранирования:",
    "answers": [
      {
        "text": "Механическое и программное",
        "isCorrect": false
      },
      {
        "text": "Графитовое и оптическое",
        "isCorrect": false
      },
      {
        "text": "Электрическое, магнитное, электромагнитное",
        "isCorrect": true
      },
      {
        "text": "Протонное и нейтронное",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 141,
    "question": "Экранирование электрического поля заземленным металлическим экраном обеспечивает?",
    "answers": [
      {
        "text": "Уменьшение магнитной составляющей",
        "isCorrect": false
      },
      {
        "text": "Увод заряда в землю, снижение электрической компоненты",
        "isCorrect": true
      },
      {
        "text": "Ускорение сигнала",
        "isCorrect": false
      },
      {
        "text": "Полную защиту от всех помех",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 142,
    "question": "Низкочастотные магнитные поля шунтируются экраном за счет направленности силовых линий…",
    "answers": [
      {
        "text": "В воздухе",
        "isCorrect": false
      },
      {
        "text": "В материал с высокой магнитной проницаемостью",
        "isCorrect": true
      },
      {
        "text": "В изолирующий слой",
        "isCorrect": false
      },
      {
        "text": "В заземляющий контур",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 143,
    "question": "Экранирование осуществляется следующими уровнями:",
    "answers": [
      {
        "text": "Глобальный, локальный",
        "isCorrect": false
      },
      {
        "text": "Технический, конструктивный, организационный",
        "isCorrect": true
      },
      {
        "text": "Виртуальный, физический",
        "isCorrect": false
      },
      {
        "text": "Программный, аппаратный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 144,
    "question": "Помехоустойчивое кодирование наиболее эффективно при парировании самоустраняющихся отказов, называемых…",
    "answers": [
      {
        "text": "Постоянными",
        "isCorrect": false
      },
      {
        "text": "Случайными",
        "isCorrect": true
      },
      {
        "text": "Критическими",
        "isCorrect": false
      },
      {
        "text": "Фатальными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 145,
    "question": "Изменения электрических схем осуществляются для…",
    "answers": [
      {
        "text": "Уменьшения нагрузки персонала",
        "isCorrect": false
      },
      {
        "text": "Повышения помехоустойчивости",
        "isCorrect": true
      },
      {
        "text": "Снижения стоимости",
        "isCorrect": false
      },
      {
        "text": "Увеличения нагрева",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 146,
    "question": "Перспективным направлением борьбы с ПЭМИН является использование…",
    "answers": [
      {
        "text": "Биометрии",
        "isCorrect": false
      },
      {
        "text": "Ультразвука",
        "isCorrect": false
      },
      {
        "text": "Оптоволоконных линий связи",
        "isCorrect": true
      },
      {
        "text": "Видеонаблюдения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 147,
    "question": "Использование фильтров является одним из основных способов защиты от…",
    "answers": [
      {
        "text": "НСД",
        "isCorrect": false
      },
      {
        "text": "Криптоатак",
        "isCorrect": false
      },
      {
        "text": "Электромагнитных наводок",
        "isCorrect": true
      },
      {
        "text": "Сетевых червей",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 148,
    "question": "Электромагнитные излучения и наводки относятся…",
    "answers": [
      {
        "text": "К программным угрозам",
        "isCorrect": false
      },
      {
        "text": "К техническим каналам утечки информации",
        "isCorrect": true
      },
      {
        "text": "К административным мерам",
        "isCorrect": false
      },
      {
        "text": "К логическим ошибкам",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 149,
    "question": "Уменьшение уровня опасного сигнала или снижение информативности",
    "answers": [
      {
        "text": "Активные методы защиты",
        "isCorrect": false
      },
      {
        "text": "Пассивные методы защиты",
        "isCorrect": true
      },
      {
        "text": "Методы экранирования магнитных полей",
        "isCorrect": false
      },
      {
        "text": "Методы повышения надежности оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 150,
    "question": "Этапы разработки, производства и модернизации аппаратных средств КС завершаются…",
    "answers": [
      {
        "text": "эксплуатацией и обучением персонала",
        "isCorrect": false
      },
      {
        "text": "выполнением технического задания",
        "isCorrect": false
      },
      {
        "text": "приемкой в эксплуатацию и сертификационными испытаниями",
        "isCorrect": true
      },
      {
        "text": "монтажом оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 151,
    "question": "Снижение информативности сигналов ПЭМИН, затрудняющее их использование при перехвате, осуществляется следующими путями:",
    "answers": [
      {
        "text": "Повышение мощности передатчиков",
        "isCorrect": false
      },
      {
        "text": "Маскирующее зашумление, фильтрация, искажение структуры сигналов",
        "isCorrect": true
      },
      {
        "text": "Увеличение длины кабелей",
        "isCorrect": false
      },
      {
        "text": "Использование более ярких индикаторов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 152,
    "question": "Для предотвращения утечки информации используется …",
    "answers": [
      {
        "text": "Оптимизация вычислений",
        "isCorrect": false
      },
      {
        "text": "Комплекс организационных, технических и криптографических мер",
        "isCorrect": true
      },
      {
        "text": "Повышение тактовой частоты",
        "isCorrect": false
      },
      {
        "text": "Установка офисных программ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 153,
    "question": "Активные методы защиты от ПЭМИН предполагают применение…",
    "answers": [
      {
        "text": "Металлических экранов",
        "isCorrect": false
      },
      {
        "text": "Маскирующих сигналов и генераторов помех",
        "isCorrect": true
      },
      {
        "text": "Экранирующего заземления",
        "isCorrect": false
      },
      {
        "text": "Сверхпроводников",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 154,
    "question": "Пространственное зашумление осуществляется за счет…",
    "answers": [
      {
        "text": "Сжатия данных",
        "isCorrect": false
      },
      {
        "text": "Излучения маскирующего электромагнитного шума через антенны",
        "isCorrect": true
      },
      {
        "text": "Организации логирования",
        "isCorrect": false
      },
      {
        "text": "Увеличения расстояния между устройствами",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 155,
    "question": "Излучения с помощью антенн электромагнитных сигналов в …",
    "answers": [
      {
        "text": "В инфракрасном диапазоне",
        "isCorrect": false
      },
      {
        "text": "В полосе частот, где возможен перехват ПЭМИН",
        "isCorrect": true
      },
      {
        "text": "В оптическом диапазоне",
        "isCorrect": false
      },
      {
        "text": "В низкочастотной акустике",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 156,
    "question": "Какие структуры КС могут быть подвергнуты несанкционированному изменению?",
    "answers": [
      {
        "text": "Только сетевые протоколы",
        "isCorrect": false
      },
      {
        "text": "Данные, программы, конфигурации оборудования",
        "isCorrect": true
      },
      {
        "text": "Только BIOS",
        "isCorrect": false
      },
      {
        "text": "Только сетевые карты",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 157,
    "question": "Повышенную опасность для безопасности информации на этапе эксплуатации представляют работы по …",
    "answers": [
      {
        "text": "Техобслуживанию интерьера помещения",
        "isCorrect": false
      },
      {
        "text": "Ремонту, настройке, модификации оборудования и ПО",
        "isCorrect": true
      },
      {
        "text": "Закупке мебели",
        "isCorrect": false
      },
      {
        "text": "Уборке офисов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 158,
    "question": "На этапе разработки и при модернизации КС основной задачей является …",
    "answers": [
      {
        "text": "Ускорение интерфейса",
        "isCorrect": false
      },
      {
        "text": "Формирование требований безопасности и их реализация",
        "isCorrect": true
      },
      {
        "text": "Повышение яркости индикаторов",
        "isCorrect": false
      },
      {
        "text": "Сокращение персонала",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 159,
    "question": "Разработке программных и аппаратных средств предшествует….",
    "answers": [
      {
        "text": "Монтаж оборудования",
        "isCorrect": false
      },
      {
        "text": "Анализ угроз и разработка требований безопасности",
        "isCorrect": true
      },
      {
        "text": "Обслуживание серверов",
        "isCorrect": false
      },
      {
        "text": "Создание резервных копий",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 160,
    "question": "К основным принципам разработки алгоритмов, программ и аппаратных средств НЕ относится…",
    "answers": [
      {
        "text": "Надежность",
        "isCorrect": false
      },
      {
        "text": "Простота проверки",
        "isCorrect": false
      },
      {
        "text": "Независимость от требований безопасности",
        "isCorrect": true
      },
      {
        "text": "Защищенность",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 161,
    "question": "Под дублированием разработки алгоритма программы понимается…",
    "answers": [
      {
        "text": "Увеличение количества пользователей",
        "isCorrect": false
      },
      {
        "text": "Параллельная разработка несколькими группами для исключения ошибок и закладок",
        "isCorrect": true
      },
      {
        "text": "Установка копий программы на сервер",
        "isCorrect": false
      },
      {
        "text": "Запуск в несколько потоков",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 162,
    "question": "Тестирование является универсальным средством проверки…",
    "answers": [
      {
        "text": "Производительности сети",
        "isCorrect": false
      },
      {
        "text": "Пропускной способности сервера",
        "isCorrect": false
      },
      {
        "text": "Правильности функционирования программных и аппаратных средств",
        "isCorrect": true
      },
      {
        "text": "Форматов файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 163,
    "question": "К атрибутивным идентификаторам не относится…",
    "answers": [
      {
        "text": "ФИО",
        "isCorrect": false
      },
      {
        "text": "Должность",
        "isCorrect": false
      },
      {
        "text": "Пароль",
        "isCorrect": true
      },
      {
        "text": "Номер телефона",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 164,
    "question": "Разработка защищенных КС и элементов для них завершается…",
    "answers": [
      {
        "text": "Архивированием данных",
        "isCorrect": false
      },
      {
        "text": "Закупкой мебели",
        "isCorrect": false
      },
      {
        "text": "Сертификационными испытаниями",
        "isCorrect": true
      },
      {
        "text": "Обновлением операционной системы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 165,
    "question": "Какие действия не выполняют при организации доступа к оборудованию пользователей, операторов, администраторов?",
    "answers": [
      {
        "text": "Разграничение прав",
        "isCorrect": false
      },
      {
        "text": "Идентификация и аутентификация",
        "isCorrect": false
      },
      {
        "text": "Регистрация действий",
        "isCorrect": false
      },
      {
        "text": "Передача паролей третьим лицам",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 166,
    "question": "Паролем называют…",
    "answers": [
      {
        "text": "Комбинацию символов, известную только пользователю",
        "isCorrect": true
      },
      {
        "text": "Идентификатор оборудования",
        "isCorrect": false
      },
      {
        "text": "Вирусную сигнатуру",
        "isCorrect": false
      },
      {
        "text": "Ключ шифрования алгоритма AES",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 167,
    "question": "С какой периодичностью меняется псевдослучайная буквенно-цифровая последовательность (слово) в жетоне?",
    "answers": [
      {
        "text": "Раз в сутки",
        "isCorrect": false
      },
      {
        "text": "Раз в месяц",
        "isCorrect": false
      },
      {
        "text": "Через фиксированный интервал (обычно 30–60 секунд)",
        "isCorrect": true
      },
      {
        "text": "После каждого включения ПК",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 168,
    "question": "Первый жетон SecurID появился в…",
    "answers": [
      {
        "text": "1980 г.",
        "isCorrect": false
      },
      {
        "text": "1986 г.",
        "isCorrect": true
      },
      {
        "text": "1995 г.",
        "isCorrect": false
      },
      {
        "text": "2001 г.",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 169,
    "question": "Для идентификации субъекта доступа в КС чаще всего используются…",
    "answers": [
      {
        "text": "Квантовые датчики",
        "isCorrect": false
      },
      {
        "text": "Логин и пароль",
        "isCorrect": true
      },
      {
        "text": "Радиопередатчики",
        "isCorrect": false
      },
      {
        "text": "Внешние носители памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 170,
    "question": "Биометрическая идентификация проще всего осуществляется…",
    "answers": [
      {
        "text": "В темноте",
        "isCorrect": false
      },
      {
        "text": "При контролируемых условиях измерения и стабильных параметрах",
        "isCorrect": true
      },
      {
        "text": "Через интернет",
        "isCorrect": false
      },
      {
        "text": "На большом расстоянии",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 171,
    "question": "Какое из перечисленных выражений НЕ отвечает требованиям к контрольно-испытательному стенду?",
    "answers": [
      {
        "text": "Возможность имитации отказов",
        "isCorrect": false
      },
      {
        "text": "Наличие инструментария анализа",
        "isCorrect": false
      },
      {
        "text": "Наличие игр и сторонних развлечений",
        "isCorrect": true
      },
      {
        "text": "Проведение нагрузочных испытаний",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 172,
    "question": "Какие модули не может содержать контрольно-испытательный стенд?",
    "answers": [
      {
        "text": "Модули анализа",
        "isCorrect": false
      },
      {
        "text": "Модули тестирования ПО",
        "isCorrect": false
      },
      {
        "text": "Модули диагностики",
        "isCorrect": false
      },
      {
        "text": "Модули для развлечений или игр",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 173,
    "question": "Выполняемые модули программных средств проверяются в процессе…",
    "answers": [
      {
        "text": "Архивирования",
        "isCorrect": false
      },
      {
        "text": "Разгонки процессора",
        "isCorrect": false
      },
      {
        "text": "Тестирования",
        "isCorrect": true
      },
      {
        "text": "Шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 174,
    "question": "Операция, обратная транслированию — …",
    "answers": [
      {
        "text": "Аутентификация",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": false
      },
      {
        "text": "Декодирование (декодирование/дезассемблирование)",
        "isCorrect": true
      },
      {
        "text": "Архивация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 175,
    "question": "Аппаратные закладки не могут внедряться в процессе…",
    "answers": [
      {
        "text": "Производства микросхем",
        "isCorrect": false
      },
      {
        "text": "Монтажа оборудования",
        "isCorrect": false
      },
      {
        "text": "Эксплуатации пользователем",
        "isCorrect": true
      },
      {
        "text": "Разработки устройства",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 176,
    "question": "Для упрощения анализа выполняемых модулей применяются программы-трассировщики, которые позволяют…",
    "answers": [
      {
        "text": "Проводить электромонтаж",
        "isCorrect": false
      },
      {
        "text": "Ускорять выполнение программы",
        "isCorrect": false
      },
      {
        "text": "Пошагово отслеживать выполнение инструкций программы",
        "isCorrect": true
      },
      {
        "text": "Удалять вредоносный код автоматически",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 177,
    "question": "Одним из наиболее эффективных путей обнаружения закладок и ошибок в разрабатываемых программных средствах является…",
    "answers": [
      {
        "text": "Сжатие кода",
        "isCorrect": false
      },
      {
        "text": "Оптимизация интерфейса",
        "isCorrect": false
      },
      {
        "text": "Независимая экспертиза и многоуровневое тестирование",
        "isCorrect": true
      },
      {
        "text": "Установка драйверов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 178,
    "question": "Для исследования неразборных конструкций (микросхем, конденсаторов, резисторов, печатных плат и др.) используются…",
    "answers": [
      {
        "text": "Отвёртки и паяльники",
        "isCorrect": false
      },
      {
        "text": "Анализаторы пакетов",
        "isCorrect": false
      },
      {
        "text": "Рентгенографические и томографические методы",
        "isCorrect": true
      },
      {
        "text": "Растровые принтеры",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 179,
    "question": "Методы противодействия дизассемблированию:",
    "answers": [
      {
        "text": "Ускорение процессора",
        "isCorrect": false
      },
      {
        "text": "Обфускация кода, упаковка, вставка ложных переходов",
        "isCorrect": true
      },
      {
        "text": "Фрагментация дисков",
        "isCorrect": false
      },
      {
        "text": "Настройка сети",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 180,
    "question": "Для противодействия трассировке программы в её состав вводятся следующие механизмы:",
    "answers": [
      {
        "text": "Лицензирование",
        "isCorrect": false
      },
      {
        "text": "Анитдебаг-конструкции, проверки целостности, ловушки",
        "isCorrect": true
      },
      {
        "text": "Перезагрузка ОС",
        "isCorrect": false
      },
      {
        "text": "Ускорение компиляции",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 181,
    "question": "Злоумышленник осуществляет НСДИ, используя…",
    "answers": [
      {
        "text": "Официальный API",
        "isCorrect": false
      },
      {
        "text": "Режим ввода-вывода",
        "isCorrect": false
      },
      {
        "text": "Уязвимости, ошибки систем защиты, обход механизмов контроля",
        "isCorrect": true
      },
      {
        "text": "Центр обновлений",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 182,
    "question": "Одним из путей добывания информации о недостатках системы защиты является…",
    "answers": [
      {
        "text": "Установка офисных программ",
        "isCorrect": false
      },
      {
        "text": "Чтение учебников",
        "isCorrect": false
      },
      {
        "text": "Анализ поведения системы, атаки-проверки, исследование утечек",
        "isCorrect": true
      },
      {
        "text": "Перезагрузка оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 183,
    "question": "Что может сделать злоумышленник с системой защиты?",
    "answers": [
      {
        "text": "Повысить её эффективность",
        "isCorrect": false
      },
      {
        "text": "Улучшить интерфейс",
        "isCorrect": false
      },
      {
        "text": "Обойти, отключить, изменить или разрушить механизмы защиты",
        "isCorrect": true
      },
      {
        "text": "Оптимизировать энергопотребление",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 184,
    "question": "Под криптографической защитой информации понимается такое преобразование исходной информации:",
    "answers": [
      {
        "text": "После которого данные ускоряются",
        "isCorrect": false
      },
      {
        "text": "После которого информация становится недоступной без ключа",
        "isCorrect": true
      },
      {
        "text": "После которого она становится цветной",
        "isCorrect": false
      },
      {
        "text": "После чего её можно напечатать",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 185,
    "question": "Проведением обратимых математических, логических, комбинаторных и других преобразований исходной информации называется…",
    "answers": [
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Сигнализация",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Моделирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 186,
    "question": "Для шифрования информации используются?",
    "answers": [
      {
        "text": "Цветовые профили",
        "isCorrect": false
      },
      {
        "text": "Модуляторы громкости",
        "isCorrect": false
      },
      {
        "text": "Криптографические алгоритмы и ключи",
        "isCorrect": true
      },
      {
        "text": "Лабораторные источники питания",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 187,
    "question": "Как правило, алгоритм для определённого метода шифрования является…",
    "answers": [
      {
        "text": "Секретным",
        "isCorrect": false
      },
      {
        "text": "Физическим",
        "isCorrect": false
      },
      {
        "text": "Открытым, а секретным является только ключ",
        "isCorrect": true
      },
      {
        "text": "Аппаратным",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 188,
    "question": "Исходными данными для алгоритма шифрования служат информация…",
    "answers": [
      {
        "text": "Только служебная",
        "isCorrect": false
      },
      {
        "text": "Кодеки аудио",
        "isCorrect": false
      },
      {
        "text": "Исходный текст (открытые данные) и ключ",
        "isCorrect": true
      },
      {
        "text": "Формат изображения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 189,
    "question": "Методы стеганографии позволяют скрыть…",
    "answers": [
      {
        "text": "Локальные сети",
        "isCorrect": false
      },
      {
        "text": "Антенны",
        "isCorrect": false
      },
      {
        "text": "Сам факт передачи информации",
        "isCorrect": true
      },
      {
        "text": "Уровень шума в помещении",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 190,
    "question": "Система разграничения доступа к информации должна содержать четыре функциональных блока:",
    "answers": [
      {
        "text": "Отчётность, оптика, сеть, питание",
        "isCorrect": false
      },
      {
        "text": "Идентификация, аутентификация, диспетчеризация доступа, регистрация",
        "isCorrect": true
      },
      {
        "text": "Вентиляция, питание, интерфейсы, мониторинг",
        "isCorrect": false
      },
      {
        "text": "Пароли, ключи, карточки, двери",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 191,
    "question": "Идентификация и аутентификация субъектов осуществляется в момент…",
    "answers": [
      {
        "text": "Выключения ПК",
        "isCorrect": false
      },
      {
        "text": "Передачи данных",
        "isCorrect": false
      },
      {
        "text": "Обращения к ресурсу",
        "isCorrect": true
      },
      {
        "text": "Завершения работы системы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 192,
    "question": "Для аппаратной поддержки защиты и изоляции ядра в архитектуре ЭВМ должны быть предусмотрены:",
    "answers": [
      {
        "text": "Индикаторы уровня сигнала",
        "isCorrect": false
      },
      {
        "text": "Режимы сопряжения, защита памяти, разграничение привилегий",
        "isCorrect": true
      },
      {
        "text": "Блок бесперебойного питания",
        "isCorrect": false
      },
      {
        "text": "Принтеры",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 193,
    "question": "Для применения ядра безопасности требуется провести…",
    "answers": [
      {
        "text": "Антивирусную проверку",
        "isCorrect": false
      },
      {
        "text": "Установку офисного ПО",
        "isCorrect": false
      },
      {
        "text": "Формальное описание, проверку корректности, строгую изоляцию",
        "isCorrect": true
      },
      {
        "text": "Настройку обоев рабочего стола",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 194,
    "question": "Что используется для шифрования информации?",
    "answers": [
      {
        "text": "Антенны",
        "isCorrect": false
      },
      {
        "text": "Драйвера",
        "isCorrect": false
      },
      {
        "text": "Ключи и криптографические алгоритмы",
        "isCorrect": true
      },
      {
        "text": "Лампы дневного света",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 195,
    "question": "Диспетчер доступа реализуется в виде…",
    "answers": [
      {
        "text": "Принтера",
        "isCorrect": false
      },
      {
        "text": "Охранной системы",
        "isCorrect": false
      },
      {
        "text": "Программно-аппаратного модуля, контролирующего доступ",
        "isCorrect": true
      },
      {
        "text": "Блока питания",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 196,
    "question": "Локализованную, минимизированную, чётко ограниченную и надёжно изолированную совокупность программно-аппаратных механизмов, доказательно правильно реализующих функции диспетчера доступа, называют…",
    "answers": [
      {
        "text": "Брандмауэр",
        "isCorrect": false
      },
      {
        "text": "Драйвер ввода-вывода",
        "isCorrect": false
      },
      {
        "text": "Ядром безопасности (trusted computing base)",
        "isCorrect": true
      },
      {
        "text": "Шлюзом доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 197,
    "question": "Процесс загрузки ОС должен исключать…",
    "answers": [
      {
        "text": "Чтение конфигурации",
        "isCorrect": false
      },
      {
        "text": "Возможность подмены загрузочных модулей",
        "isCorrect": true
      },
      {
        "text": "Инициализацию драйверов",
        "isCorrect": false
      },
      {
        "text": "Запуск служб",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 198,
    "question": "Создание копий программных средств для изучения или несанкционированного использования осуществляется с помощью устройств…",
    "answers": [
      {
        "text": "Принтеров",
        "isCorrect": false
      },
      {
        "text": "Источников питания",
        "isCorrect": false
      },
      {
        "text": "Копировальных устройств (дупликаторов, программаторов)",
        "isCorrect": true
      },
      {
        "text": "Проекторов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 199,
    "question": "Архивацию можно рассматривать как…",
    "answers": [
      {
        "text": "Уничтожение данных",
        "isCorrect": false
      },
      {
        "text": "Маскировку информации",
        "isCorrect": false
      },
      {
        "text": "Метод резервного хранения и уплотнения данных",
        "isCorrect": true
      },
      {
        "text": "Модуляцию громкости",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 200,
    "question": "Что является главным условием создания ядра безопасности?",
    "answers": [
      {
        "text": "Яркий интерфейс",
        "isCorrect": false
      },
      {
        "text": "Увеличение количества пользователей",
        "isCorrect": false
      },
      {
        "text": "Минимизация, формальная проверяемость и строгая изоляция",
        "isCorrect": true
      },
      {
        "text": "Высокая частота процессора",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 201,
    "question": "Под «обманом» дизассемблера понимают…",
    "answers": [
      {
        "text": "Встраивание в код дополнительных библиотек",
        "isCorrect": false
      },
      {
        "text": "Использование некорректных или запутывающих машинных инструкций",
        "isCorrect": true
      },
      {
        "text": "Увеличение размера исполняемого файла",
        "isCorrect": false
      },
      {
        "text": "Применение цифровой подписи",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 202,
    "question": "Целью сжатия информации является…",
    "answers": [
      {
        "text": "Усложнение анализа структуры",
        "isCorrect": false
      },
      {
        "text": "Повышение криптоустойчивости",
        "isCorrect": false
      },
      {
        "text": "Снижение объёма данных при сохранении содержания",
        "isCorrect": true
      },
      {
        "text": "Маскировка вредоносного кода",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 203,
    "question": "Для противодействия трассировке программы в её состав вводится следующий механизм…",
    "answers": [
      {
        "text": "Обнаружение отладчика и изменение поведения",
        "isCorrect": true
      },
      {
        "text": "Шифрование файловой системы",
        "isCorrect": false
      },
      {
        "text": "Оптимизация ветвлений",
        "isCorrect": false
      },
      {
        "text": "Увеличение числа потоков",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 204,
    "question": "«Случайные» переходы выполняются за счёт…",
    "answers": [
      {
        "text": "Использования жёсткого алгоритма",
        "isCorrect": false
      },
      {
        "text": "Статического анализа кода",
        "isCorrect": false
      },
      {
        "text": "Генерации псевдослучайных значений",
        "isCorrect": true
      },
      {
        "text": "Встроенных таблиц переходов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 205,
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют…",
    "answers": [
      {
        "text": "Активными",
        "isCorrect": false
      },
      {
        "text": "Структурными",
        "isCorrect": false
      },
      {
        "text": "Социальными",
        "isCorrect": false
      },
      {
        "text": "Стихийными",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 206,
    "question": "Маскировка скрытых действий часто осуществляется с применением…",
    "answers": [
      {
        "text": "Линейного шифрования",
        "isCorrect": false
      },
      {
        "text": "Стеганографии",
        "isCorrect": true
      },
      {
        "text": "Надёжного кэширования",
        "isCorrect": false
      },
      {
        "text": "Полиморфного ввода",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 207,
    "question": "Обеспечение многоуровневого режима выполнения команд является главным условием…",
    "answers": [
      {
        "text": "Повышения производительности",
        "isCorrect": false
      },
      {
        "text": "Построения защищённой архитектуры",
        "isCorrect": true
      },
      {
        "text": "Оптимизации оперативной памяти",
        "isCorrect": false
      },
      {
        "text": "Снижения нагрузки на процессор",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 208,
    "question": "Обеспечение многоуровневого режима выполнения команд является главным условием создания ядра безопасности. Сколько должно быть многоуровневых режимов выполнения команд?",
    "answers": [
      {
        "text": "Один",
        "isCorrect": false
      },
      {
        "text": "Два",
        "isCorrect": false
      },
      {
        "text": "Минимум два — для ядра и пользователя",
        "isCorrect": true
      },
      {
        "text": "Четыре",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 209,
    "question": "Имеется два пути получения защищённых от НСД КС. Какие?",
    "answers": [
      {
        "text": "Полиморфизм и модульность",
        "isCorrect": false
      },
      {
        "text": "Аппаратный и программный",
        "isCorrect": true
      },
      {
        "text": "Локальный и сетевой",
        "isCorrect": false
      },
      {
        "text": "Контрольный и адаптивный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 210,
    "question": "Угроза несанкционированного копирования информации блокируется методами, которые могут быть распределены по двум группам…",
    "answers": [
      {
        "text": "Аналитические и структурные",
        "isCorrect": false
      },
      {
        "text": "Логические и линейные",
        "isCorrect": false
      },
      {
        "text": "Организационные и технические",
        "isCorrect": true
      },
      {
        "text": "Открытые и закрытые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 211,
    "question": "Программные системы защиты в качестве идентификатора используют, как правило, только…",
    "answers": [
      {
        "text": "Пользовательский логин",
        "isCorrect": false
      },
      {
        "text": "Тип операционной системы",
        "isCorrect": false
      },
      {
        "text": "Серийный номер устройства или части оборудования",
        "isCorrect": true
      },
      {
        "text": "Локальный порт сети",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 212,
    "question": "Основной задачей противодействия трассировке является увеличение…",
    "answers": [
      {
        "text": "Контента программы",
        "isCorrect": false
      },
      {
        "text": "Числа библиотек",
        "isCorrect": false
      },
      {
        "text": "Сложности анализа хода выполнения",
        "isCorrect": true
      },
      {
        "text": "Размеров исполняемого файла",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 213,
    "question": "Одним из наиболее эффективных методов разграничения доступа является:",
    "answers": [
      {
        "text": "Комбинация ключей",
        "isCorrect": false
      },
      {
        "text": "Структурная изоляция",
        "isCorrect": false
      },
      {
        "text": "Шифрование логов",
        "isCorrect": false
      },
      {
        "text": "Мандатное управление доступом",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 214,
    "question": "Процесс, заключающийся в проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации, в результате которых зашифрованная информация представляет собой хаотический набор символов, называется:",
    "answers": [
      {
        "text": "Аутентификация",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Маскирование",
        "isCorrect": false
      },
      {
        "text": "Стеганография",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 215,
    "question": "Содержанием какого процесса является замена смысловых конструкций исходной информации кодами?",
    "answers": [
      {
        "text": "Конвертация",
        "isCorrect": false
      },
      {
        "text": "Кодирование",
        "isCorrect": true
      },
      {
        "text": "Регистрация",
        "isCorrect": false
      },
      {
        "text": "Структурирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 216,
    "question": "Совокупность обратимых преобразований открытой информации в закрытую в соответствии с алгоритмом шифрования называется:",
    "answers": [
      {
        "text": "Процедурой контроля",
        "isCorrect": false
      },
      {
        "text": "Криптографическим преобразованием",
        "isCorrect": true
      },
      {
        "text": "Моделированием",
        "isCorrect": false
      },
      {
        "text": "Электронной подписью",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 217,
    "question": "Какой алгоритм предусматривает сложение по mod 2 исходной последовательности бит с последовательностью бит гаммы?",
    "answers": [
      {
        "text": "RSA",
        "isCorrect": false
      },
      {
        "text": "AES",
        "isCorrect": false
      },
      {
        "text": "Потоковое шифрование (гаммирование)",
        "isCorrect": true
      },
      {
        "text": "DES",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 218,
    "question": "В какой стране применяли шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "Япония",
        "isCorrect": false
      },
      {
        "text": "Германия",
        "isCorrect": false
      },
      {
        "text": "США",
        "isCorrect": true
      },
      {
        "text": "Китай",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 219,
    "question": "В каком году применяли шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "1988",
        "isCorrect": false
      },
      {
        "text": "1977",
        "isCorrect": true
      },
      {
        "text": "1995",
        "isCorrect": false
      },
      {
        "text": "1963",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 220,
    "question": "Процесс преобразования закрытой информации в открытую?",
    "answers": [
      {
        "text": "Контроль",
        "isCorrect": false
      },
      {
        "text": "Дешифрование",
        "isCorrect": true
      },
      {
        "text": "Копирование",
        "isCorrect": false
      },
      {
        "text": "Сжатие",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 221,
    "question": "Криптосистема Мак-Элиса использует коды…",
    "answers": [
      {
        "text": "Хамминга",
        "isCorrect": false
      },
      {
        "text": "Рида-Соломона",
        "isCorrect": false
      },
      {
        "text": "Гоппа",
        "isCorrect": true
      },
      {
        "text": "Голомба",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 222,
    "question": "Система, основана на сложности вычисления дискретных логарифмов в конечных полях…",
    "answers": [
      {
        "text": "AES",
        "isCorrect": false
      },
      {
        "text": "DES",
        "isCorrect": false
      },
      {
        "text": "ElGamal",
        "isCorrect": true
      },
      {
        "text": "SHA-1",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 223,
    "question": "Процесс преобразования открытой информации в закрытую получил название…",
    "answers": [
      {
        "text": "Форматирование",
        "isCorrect": false
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Анализ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 224,
    "question": "Откуда предпочтительней загружать информацию?",
    "answers": [
      {
        "text": "Со случайных ресурсов",
        "isCorrect": false
      },
      {
        "text": "С непроверенных носителей",
        "isCorrect": false
      },
      {
        "text": "Из доверенных источников",
        "isCorrect": true
      },
      {
        "text": "С сетевых хранилищ без контроля",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 225,
    "question": "Процесс преобразования открытой информации в закрытую получил название?",
    "answers": [
      {
        "text": "Модуляция",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Компрессия",
        "isCorrect": false
      },
      {
        "text": "Фильтрация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 226,
    "question": "В каком году впервые применили шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "1984",
        "isCorrect": false
      },
      {
        "text": "1969",
        "isCorrect": false
      },
      {
        "text": "1977",
        "isCorrect": true
      },
      {
        "text": "1991",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 227,
    "question": "В какой стране впервые применили шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "Германия",
        "isCorrect": false
      },
      {
        "text": "Великобритания",
        "isCorrect": false
      },
      {
        "text": "США",
        "isCorrect": true
      },
      {
        "text": "Франция",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 228,
    "question": "Криптостойкость методов шифрования определяется длиной ключа, которая для современных систем должна быть, по крайней мере…",
    "answers": [
      {
        "text": "32 бита",
        "isCorrect": false
      },
      {
        "text": "64 бита",
        "isCorrect": false
      },
      {
        "text": "128 бит",
        "isCorrect": true
      },
      {
        "text": "80 бит",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 229,
    "question": "Угрозы, не связанные с преднамеренными действиями злоумышленников и реализующиеся в случайные моменты времени, называют…",
    "answers": [
      {
        "text": "Активными",
        "isCorrect": false
      },
      {
        "text": "Программными",
        "isCorrect": false
      },
      {
        "text": "Стихийными",
        "isCorrect": true
      },
      {
        "text": "Пассивными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 230,
    "question": "Согласно данным NIST, 65% нарушений безопасности информации происходит в результате…",
    "answers": [
      {
        "text": "Внешних атак",
        "isCorrect": false
      },
      {
        "text": "Ошибок программного обеспечения",
        "isCorrect": false
      },
      {
        "text": "Действий персонала (человеческого фактора)",
        "isCorrect": true
      },
      {
        "text": "Сбоев оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 231,
    "question": "Что означает проверку принадлежности субъектов доступа предъявленного идентификатора, подтверждения подлинности?",
    "answers": [
      {
        "text": "Авторизацию",
        "isCorrect": false
      },
      {
        "text": "Аутентификацию",
        "isCorrect": true
      },
      {
        "text": "Маршрутизацию",
        "isCorrect": false
      },
      {
        "text": "Идентификацию",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 232,
    "question": "Различают способы идентификации людей:",
    "answers": [
      {
        "text": "Технические, социальные, структурные",
        "isCorrect": false
      },
      {
        "text": "По знанию, по владению, по биометрии",
        "isCorrect": true
      },
      {
        "text": "По уровню образования",
        "isCorrect": false
      },
      {
        "text": "По временным меткам",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 233,
    "question": "Какой способ предполагает выдачу субъекту доступа уникального предмета, пароля или предмета, содержащего код?",
    "answers": [
      {
        "text": "По биометрическим данным",
        "isCorrect": false
      },
      {
        "text": "По владению",
        "isCorrect": true
      },
      {
        "text": "По знанию",
        "isCorrect": false
      },
      {
        "text": "По роли",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 234,
    "question": "Для биометрической идентификации человека используются…",
    "answers": [
      {
        "text": "Логины и пароли",
        "isCorrect": false
      },
      {
        "text": "Носимые жетоны",
        "isCorrect": false
      },
      {
        "text": "Физиологические и поведенческие характеристики",
        "isCorrect": true
      },
      {
        "text": "Сетевые адреса",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 235,
    "question": "Под чем понимается изменение характеристик речевого сигнала для получения модулированного неузнаваемого сигнала?",
    "answers": [
      {
        "text": "Шифрованием аудиоданных",
        "isCorrect": false
      },
      {
        "text": "Речевой трансформацией",
        "isCorrect": true
      },
      {
        "text": "Компрессией",
        "isCorrect": false
      },
      {
        "text": "Вокальной фильтрацией",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 236,
    "question": "Как называются устройства защиты, использующие частотную инверсию спектра сигнала?",
    "answers": [
      {
        "text": "Фильтраторы",
        "isCorrect": false
      },
      {
        "text": "Глушители",
        "isCorrect": false
      },
      {
        "text": "Инверторы речи",
        "isCorrect": true
      },
      {
        "text": "Поляризаторы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 237,
    "question": "Что обеспечивает локализацию источника звука в замкнутом пространстве?",
    "answers": [
      {
        "text": "Инвертор спектра",
        "isCorrect": false
      },
      {
        "text": "Акустический пеленгатор",
        "isCorrect": true
      },
      {
        "text": "Фильтр нижних частот",
        "isCorrect": false
      },
      {
        "text": "Усилитель шума",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 238,
    "question": "При помощи чего осуществляется преобразование кинетической энергии звуковой волны в тепловую энергию?",
    "answers": [
      {
        "text": "Резонатора",
        "isCorrect": false
      },
      {
        "text": "Усилителя",
        "isCorrect": false
      },
      {
        "text": "Звукопоглощающего материала",
        "isCorrect": true
      },
      {
        "text": "Генератора",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 239,
    "question": "Средства борьбы с закладными подслушивающими устройствами делятся на:",
    "answers": [
      {
        "text": "Магнитные и сетевые",
        "isCorrect": false
      },
      {
        "text": "Поисковые и защитные",
        "isCorrect": true
      },
      {
        "text": "Статические и динамические",
        "isCorrect": false
      },
      {
        "text": "Открытые и скрытые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 240,
    "question": "Для подавления закладок используется:",
    "answers": [
      {
        "text": "Фильтрация пакетов",
        "isCorrect": false
      },
      {
        "text": "Распознавание речи",
        "isCorrect": false
      },
      {
        "text": "Оптимизация сети",
        "isCorrect": false
      },
      {
        "text": "Генерация маскирующих шумов",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 241,
    "question": "Исходными данными для вычисления хеш-функции являются исходная двоичная последовательность и…",
    "answers": [
      {
        "text": "Секретный ключ",
        "isCorrect": false
      },
      {
        "text": "Номер блока",
        "isCorrect": false
      },
      {
        "text": "Стартовый вектор (инициализационный)",
        "isCorrect": true
      },
      {
        "text": "Контрольная сумма",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 242,
    "question": "Стартовый вектор хеширования представляет собой двоичную последовательность длиной…",
    "answers": [
      {
        "text": "32 бит",
        "isCorrect": false
      },
      {
        "text": "Заданной алгоритмом (например, 128 или 256 бит)",
        "isCorrect": true
      },
      {
        "text": "16 бит",
        "isCorrect": false
      },
      {
        "text": "512 бит",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 243,
    "question": "Под криптографической защитой информации понимается…",
    "answers": [
      {
        "text": "Контроль доступа",
        "isCorrect": false
      },
      {
        "text": "Удаление данных",
        "isCorrect": false
      },
      {
        "text": "Преобразование информации с использованием криптографических методов",
        "isCorrect": true
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 244,
    "question": "Процесс шифрования заключается в проведении обратимых преобразований, в результате которых зашифрованная информация представляет собой…",
    "answers": [
      {
        "text": "Сжатый поток",
        "isCorrect": false
      },
      {
        "text": "Хаотический набор символов",
        "isCorrect": true
      },
      {
        "text": "Логическую структуру",
        "isCorrect": false
      },
      {
        "text": "Форматированный текст",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 245,
    "question": "Какой метод позволяет скрыть не только смысл информации, но и сам факт её хранения или передачи?",
    "answers": [
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Стеганография",
        "isCorrect": true
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Компрессия",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 246,
    "question": "Сжатие информации может быть отнесено к методам…",
    "answers": [
      {
        "text": "Криптографической защиты",
        "isCorrect": false
      },
      {
        "text": "Маскирующей обработки",
        "isCorrect": true
      },
      {
        "text": "Структурного контроля",
        "isCorrect": false
      },
      {
        "text": "Дешифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 247,
    "question": "Процесс преобразования закрытой информации в открытую — …",
    "answers": [
      {
        "text": "Контроль",
        "isCorrect": false
      },
      {
        "text": "Дешифрование",
        "isCorrect": true
      },
      {
        "text": "Форматирование",
        "isCorrect": false
      },
      {
        "text": "Коммутация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 248,
    "question": "Процесс преобразования открытой информации в зашифрованную — …",
    "answers": [
      {
        "text": "Верификация",
        "isCorrect": false
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Кодирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 249,
    "question": "Совокупность обратимых преобразований открытой информации в закрытую в соответствии с алгоритмом шифрования — …",
    "answers": [
      {
        "text": "Компрессия",
        "isCorrect": false
      },
      {
        "text": "Идентификация",
        "isCorrect": false
      },
      {
        "text": "Криптографическое преобразование",
        "isCorrect": true
      },
      {
        "text": "Маркировка",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 250,
    "question": "Стойкость шифра противостоять криптоанализу — …",
    "answers": [
      {
        "text": "Сложность реализации",
        "isCorrect": false
      },
      {
        "text": "Скорость работы",
        "isCorrect": false
      },
      {
        "text": "Криптографическая устойчивость",
        "isCorrect": true
      },
      {
        "text": "Длина сообщения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 251,
    "question": "Аддитивные методы шифрования называют…",
    "answers": [
      {
        "text": "Матричными",
        "isCorrect": false
      },
      {
        "text": "Комбинаторными",
        "isCorrect": false
      },
      {
        "text": "Методами гаммирования (сложение по mod 2)",
        "isCorrect": true
      },
      {
        "text": "Блочными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 252,
    "question": "Система Эль-Гамаля…",
    "answers": [
      {
        "text": "Основана на сложности факторизации",
        "isCorrect": false
      },
      {
        "text": "Основана на сложности вычисления дискретных логарифмов",
        "isCorrect": true
      },
      {
        "text": "Использует коды Гоппа",
        "isCorrect": false
      },
      {
        "text": "Работает только с блочными шифрами",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 253,
    "question": "Криптосистема Мак-Элиса…",
    "answers": [
      {
        "text": "Основана на дискретных логарифмах",
        "isCorrect": false
      },
      {
        "text": "Является симметричной",
        "isCorrect": false
      },
      {
        "text": "Использует код Гоппа",
        "isCorrect": true
      },
      {
        "text": "Является разновидностью DES",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 254,
    "question": "Стандарт США на шифрование информации…",
    "answers": [
      {
        "text": "ГОСТ 28147-89",
        "isCorrect": false
      },
      {
        "text": "DES",
        "isCorrect": true
      },
      {
        "text": "RC4",
        "isCorrect": false
      },
      {
        "text": "SHA-256",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 255,
    "question": "DES — это…",
    "answers": [
      {
        "text": "Хеш-функция",
        "isCorrect": false
      },
      {
        "text": "Потоковый шифр",
        "isCorrect": false
      },
      {
        "text": "Блочный симметричный шифр",
        "isCorrect": true
      },
      {
        "text": "Ассиметричная схема",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 256,
    "question": "Система, основана на сложности вычисления дискретных логарифмов в конечных полях…",
    "answers": [
      {
        "text": "RSA",
        "isCorrect": false
      },
      {
        "text": "ElGamal",
        "isCorrect": true
      },
      {
        "text": "AES",
        "isCorrect": false
      },
      {
        "text": "MD5",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 257,
    "question": "Процесс преобразования открытой информации в закрытую получил название…",
    "answers": [
      {
        "text": "Хеширования",
        "isCorrect": false
      },
      {
        "text": "Шифрования",
        "isCorrect": true
      },
      {
        "text": "Форматирования",
        "isCorrect": false
      },
      {
        "text": "Инкапсуляции",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 258,
    "question": "Откуда предпочтительней загружать информацию?",
    "answers": [
      {
        "text": "Из случайных интернет-источников",
        "isCorrect": false
      },
      {
        "text": "Из сетей без шифрования",
        "isCorrect": false
      },
      {
        "text": "Из доверенных источников",
        "isCorrect": true
      },
      {
        "text": "Из архивов неизвестного происхождения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 259,
    "question": "Процесс преобразования открытой информации в закрытую получил название?",
    "answers": [
      {
        "text": "Модуляции",
        "isCorrect": false
      },
      {
        "text": "Шифрования",
        "isCorrect": true
      },
      {
        "text": "Компрессии",
        "isCorrect": false
      },
      {
        "text": "Анализа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 260,
    "question": "В каком году впервые применили шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "1990",
        "isCorrect": false
      },
      {
        "text": "1977",
        "isCorrect": true
      },
      {
        "text": "2001",
        "isCorrect": false
      },
      {
        "text": "1960",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 261,
    "question": "В какой стране впервые применили шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "Великобритания",
        "isCorrect": false
      },
      {
        "text": "США",
        "isCorrect": true
      },
      {
        "text": "Германия",
        "isCorrect": false
      },
      {
        "text": "Япония",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 262,
    "question": "Криптостойкость рассмотренных методов шифрования определяется длиной ключа, которая для современных систем должна быть, по крайней мере…",
    "answers": [
      {
        "text": "32 бита",
        "isCorrect": false
      },
      {
        "text": "64 бита",
        "isCorrect": false
      },
      {
        "text": "128 бит",
        "isCorrect": true
      },
      {
        "text": "48 бит",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 263,
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют…",
    "answers": [
      {
        "text": "Специальными",
        "isCorrect": false
      },
      {
        "text": "Активными",
        "isCorrect": false
      },
      {
        "text": "Стихийными",
        "isCorrect": true
      },
      {
        "text": "Административными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 264,
    "question": "Согласно данным NIST, 65% случаев нарушения безопасности информации происходит в результате…",
    "answers": [
      {
        "text": "Хакерских атак из интернета",
        "isCorrect": false
      },
      {
        "text": "Аппаратных сбоев",
        "isCorrect": false
      },
      {
        "text": "Ошибок и действий персонала",
        "isCorrect": true
      },
      {
        "text": "Стихийных бедствий",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 265,
    "question": "Что означает проверку принадлежности субъекта доступа предъявленного им идентификатора?",
    "answers": [
      {
        "text": "Авторизацию",
        "isCorrect": false
      },
      {
        "text": "Логирование",
        "isCorrect": false
      },
      {
        "text": "Аутентификацию",
        "isCorrect": true
      },
      {
        "text": "Маршрутизацию",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 266,
    "question": "Способы идентификации людей:",
    "answers": [
      {
        "text": "Организационный, юридический, технический",
        "isCorrect": false
      },
      {
        "text": "По знанию, по владению, по биометрии",
        "isCorrect": true
      },
      {
        "text": "По роли, по уровню, по доступу",
        "isCorrect": false
      },
      {
        "text": "По возрасту и физическому состоянию",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 267,
    "question": "Какой способ предполагает выдачу субъекту доступа уникального предмета, пароля или носителя с кодом?",
    "answers": [
      {
        "text": "По биометрии",
        "isCorrect": false
      },
      {
        "text": "По знанию",
        "isCorrect": false
      },
      {
        "text": "По владению",
        "isCorrect": true
      },
      {
        "text": "По уровню доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 268,
    "question": "Для биометрической идентификации человека используются…",
    "answers": [
      {
        "text": "IP-адрес",
        "isCorrect": false
      },
      {
        "text": "Серийный номер устройства",
        "isCorrect": false
      },
      {
        "text": "Физиологические и поведенческие характеристики",
        "isCorrect": true
      },
      {
        "text": "Время входа в систему",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 269,
    "question": "Изменение характеристик речевого сигнала для получения неразборчивого модулированного — это…",
    "answers": [
      {
        "text": "Сжатие речи",
        "isCorrect": false
      },
      {
        "text": "Речевая трансформация",
        "isCorrect": true
      },
      {
        "text": "Частотная фильтрация",
        "isCorrect": false
      },
      {
        "text": "Обратная модуляция",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 270,
    "question": "Устройства защиты, использующие частотную инверсию спектра сигнала — это…",
    "answers": [
      {
        "text": "Глушители",
        "isCorrect": false
      },
      {
        "text": "Инверторы речи",
        "isCorrect": true
      },
      {
        "text": "Фильтры спектра",
        "isCorrect": false
      },
      {
        "text": "Ревербераторы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 271,
    "question": "Что обеспечивает локализацию источника звука в замкнутом пространстве?",
    "answers": [
      {
        "text": "Шифратор голоса",
        "isCorrect": false
      },
      {
        "text": "Инвертор спектра",
        "isCorrect": false
      },
      {
        "text": "Акустический пеленгатор",
        "isCorrect": true
      },
      {
        "text": "Линейный фильтр",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 272,
    "question": "Преобразование кинетической энергии звуковой волны в тепловую энергию осуществляется при помощи…",
    "answers": [
      {
        "text": "Резонатора",
        "isCorrect": false
      },
      {
        "text": "Усилителя",
        "isCorrect": false
      },
      {
        "text": "Звукопоглощающего материала",
        "isCorrect": true
      },
      {
        "text": "Электронного фильтра",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 273,
    "question": "Средства борьбы с закладными подслушивающими устройствами делятся на…",
    "answers": [
      {
        "text": "Акустические и оптические",
        "isCorrect": false
      },
      {
        "text": "Поисковые и защитные",
        "isCorrect": true
      },
      {
        "text": "Скрытые и открытые",
        "isCorrect": false
      },
      {
        "text": "Сигнальные и пассивные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 274,
    "question": "Для подавления закладок используется…",
    "answers": [
      {
        "text": "Криптографический анализ",
        "isCorrect": false
      },
      {
        "text": "Генерация маскирующих шумов",
        "isCorrect": true
      },
      {
        "text": "Логирование",
        "isCorrect": false
      },
      {
        "text": "Локальная маршрутизация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 275,
    "question": "Исходными данными для вычисления хэш-функции являются исходная последовательность и…",
    "answers": [
      {
        "text": "Название алгоритма",
        "isCorrect": false
      },
      {
        "text": "Стартовый (инициализационный) вектор",
        "isCorrect": true
      },
      {
        "text": "Таблица маршрутизации",
        "isCorrect": false
      },
      {
        "text": "Формат сообщения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 276,
    "question": "Стартовый вектор хэширования представляет собой двоичную последовательность длиной…",
    "answers": [
      {
        "text": "16 бит",
        "isCorrect": false
      },
      {
        "text": "32 бит",
        "isCorrect": false
      },
      {
        "text": "Заданной алгоритмом (обычно 128–512 бит)",
        "isCorrect": true
      },
      {
        "text": "8 бит",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 277,
    "question": "Под криптографической защитой информации понимается…",
    "answers": [
      {
        "text": "Запрет доступа к файлам",
        "isCorrect": false
      },
      {
        "text": "Маскировка данных",
        "isCorrect": false
      },
      {
        "text": "Преобразование информации с помощью криптографических методов",
        "isCorrect": true
      },
      {
        "text": "Архивирование данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 278,
    "question": "Шифрование заключается в проведении математических и логических преобразований, при которых зашифрованная информация представляет собой…",
    "answers": [
      {
        "text": "Отформатированный текст",
        "isCorrect": false
      },
      {
        "text": "Сокращённую последовательность",
        "isCorrect": false
      },
      {
        "text": "Хаотический набор символов",
        "isCorrect": true
      },
      {
        "text": "Восстановленный поток данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 279,
    "question": "Метод позволяет скрыть не только смысл информации, но и сам факт её передачи…",
    "answers": [
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Стеганография",
        "isCorrect": true
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Компрессия",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 280,
    "question": "Сжатие информации может быть отнесено к методам…",
    "answers": [
      {
        "text": "Шифрования",
        "isCorrect": false
      },
      {
        "text": "Маскирующей обработки",
        "isCorrect": true
      },
      {
        "text": "Дешифрования",
        "isCorrect": false
      },
      {
        "text": "Идентификации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 281,
    "question": "Процесс преобразования закрытой информации в открытую — это…",
    "answers": [
      {
        "text": "Кодирование",
        "isCorrect": false
      },
      {
        "text": "Форматирование",
        "isCorrect": false
      },
      {
        "text": "Дешифрование",
        "isCorrect": true
      },
      {
        "text": "Разделение данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 282,
    "question": "Процесс преобразования открытой информации в зашифрованную — это…",
    "answers": [
      {
        "text": "Анализ",
        "isCorrect": false
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Копирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 283,
    "question": "Совокупность обратимых преобразований открытой информации в закрытую в соответствии с алгоритмом — это…",
    "answers": [
      {
        "text": "Конвертация",
        "isCorrect": false
      },
      {
        "text": "Сегментация",
        "isCorrect": false
      },
      {
        "text": "Криптографическое преобразование",
        "isCorrect": true
      },
      {
        "text": "Кластеризация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 284,
    "question": "Стойкость шифра противостоять криптоанализу — это…",
    "answers": [
      {
        "text": "Скорость выполнения",
        "isCorrect": false
      },
      {
        "text": "Криптоустойчивость",
        "isCorrect": true
      },
      {
        "text": "Аппаратная совместимость",
        "isCorrect": false
      },
      {
        "text": "Количество блоков",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 285,
    "question": "Аддитивные методы шифрования называют…",
    "answers": [
      {
        "text": "Структурными",
        "isCorrect": false
      },
      {
        "text": "Каскадными",
        "isCorrect": false
      },
      {
        "text": "Гаммированием (сложением по mod 2)",
        "isCorrect": true
      },
      {
        "text": "Блочными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 286,
    "question": "Система Эль-Гамаля…",
    "answers": [
      {
        "text": "Использует блочное шифрование",
        "isCorrect": false
      },
      {
        "text": "Основана на факторизации чисел",
        "isCorrect": false
      },
      {
        "text": "Основана на сложности дискретных логарифмов",
        "isCorrect": true
      },
      {
        "text": "Является хеш-функцией",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 287,
    "question": "Криптосистема Мак-Элиса…",
    "answers": [
      {
        "text": "Основана на RSA",
        "isCorrect": false
      },
      {
        "text": "Является симметричной",
        "isCorrect": false
      },
      {
        "text": "Использует коды Гоппа",
        "isCorrect": true
      },
      {
        "text": "Основана на DES",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 288,
    "question": "Стандарт США на шифрование информации…",
    "answers": [
      {
        "text": "ГОСТ",
        "isCorrect": false
      },
      {
        "text": "DES",
        "isCorrect": true
      },
      {
        "text": "MD5",
        "isCorrect": false
      },
      {
        "text": "SHA",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 289,
    "question": "DES — это…",
    "answers": [
      {
        "text": "Потоковый шифратор",
        "isCorrect": false
      },
      {
        "text": "Хеширующий алгоритм",
        "isCorrect": false
      },
      {
        "text": "Блочный симметричный шифр",
        "isCorrect": true
      },
      {
        "text": "Алгоритм цифровой подписи",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 290,
    "question": "Какая система использует коды, исправляющие ошибки?",
    "answers": [
      {
        "text": "RSA",
        "isCorrect": false
      },
      {
        "text": "Мак-Элиса",
        "isCorrect": true
      },
      {
        "text": "ElGamal",
        "isCorrect": false
      },
      {
        "text": "AES",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 291,
    "question": "Какая система основана на сложности вычисления дискретных логарифмов в конечных полях?",
    "answers": [
      {
        "text": "RSA",
        "isCorrect": false
      },
      {
        "text": "Мак-Элиса",
        "isCorrect": false
      },
      {
        "text": "ElGamal",
        "isCorrect": true
      },
      {
        "text": "ГОСТ Р 34.11",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 292,
    "question": "К какому методу относится гаммирование?",
    "answers": [
      {
        "text": "Матричному",
        "isCorrect": false
      },
      {
        "text": "Аддитивному",
        "isCorrect": true
      },
      {
        "text": "Блочному",
        "isCorrect": false
      },
      {
        "text": "Компрессионному",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 293,
    "question": "Криптостойкость — это…",
    "answers": [
      {
        "text": "Скорость шифрования",
        "isCorrect": false
      },
      {
        "text": "Возможность восстановления данных",
        "isCorrect": false
      },
      {
        "text": "Способность противостоять криптоанализу",
        "isCorrect": true
      },
      {
        "text": "Эффективность упаковки данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 294,
    "question": "Методом шифрования называют…",
    "answers": [
      {
        "text": "Изменение формата данных",
        "isCorrect": false
      },
      {
        "text": "Удаление информации",
        "isCorrect": false
      },
      {
        "text": "Преобразование открытого текста в закрытый",
        "isCorrect": true
      },
      {
        "text": "Объединение файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 295,
    "question": "Стеганография — это…",
    "answers": [
      {
        "text": "Метод оптимизации хранения данных",
        "isCorrect": false
      },
      {
        "text": "Алгоритм цифровой подписи",
        "isCorrect": false
      },
      {
        "text": "Сокрытие факта передачи или хранения информации",
        "isCorrect": true
      },
      {
        "text": "Замена символов в алфавите",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 296,
    "question": "Преобразование исходной информации, делающее её недоступной — это…",
    "answers": [
      {
        "text": "Архивация",
        "isCorrect": false
      },
      {
        "text": "Модуляция",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Сегментация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 297,
    "question": "Методы шифрования классифицируются…",
    "answers": [
      {
        "text": "По цвету и формату",
        "isCorrect": false
      },
      {
        "text": "По типу процессора",
        "isCorrect": false
      },
      {
        "text": "На симметричные и асимметричные",
        "isCorrect": true
      },
      {
        "text": "На блочные и текстовые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 298,
    "question": "Атака на шифр — это…",
    "answers": [
      {
        "text": "Процесс настройки оборудования",
        "isCorrect": false
      },
      {
        "text": "Оптимизация каналов связи",
        "isCorrect": false
      },
      {
        "text": "Попытка извлечь ключ или открытую информацию без разрешения",
        "isCorrect": true
      },
      {
        "text": "Уменьшение размера данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 299,
    "question": "Одним из путей добывания информации о недостатках системы защиты является…",
    "answers": [
      {
        "text": "Удаление логов",
        "isCorrect": false
      },
      {
        "text": "Сжатие данных",
        "isCorrect": false
      },
      {
        "text": "Анализ уязвимостей",
        "isCorrect": true
      },
      {
        "text": "Увеличение пропускной способности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 300,
    "question": "Цель сжатия информации…",
    "answers": [
      {
        "text": "Скрыть структуру текста",
        "isCorrect": false
      },
      {
        "text": "Уменьшить объём данных",
        "isCorrect": true
      },
      {
        "text": "Увеличить скорость шифрования",
        "isCorrect": false
      },
      {
        "text": "Изменить кодировку сообщения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 301,
    "question": "Процесс преобразования открытой информации в закрытую…",
    "answers": [
      {
        "text": "Хэширование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Компрессия",
        "isCorrect": false
      },
      {
        "text": "Маршрутизация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 302,
    "question": "Процесс преобразования закрытой информации в открытую называется…",
    "answers": [
      {
        "text": "Кодирование",
        "isCorrect": false
      },
      {
        "text": "Реверсирование",
        "isCorrect": false
      },
      {
        "text": "Дешифрование",
        "isCorrect": true
      },
      {
        "text": "Архивация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 303,
    "question": "Аддитивные методы шифрования заключаются в суммировании кодов…",
    "answers": [
      {
        "text": "Символов открытого текста и ключа",
        "isCorrect": true
      },
      {
        "text": "Только символов ключа",
        "isCorrect": false
      },
      {
        "text": "Только символов текста",
        "isCorrect": false
      },
      {
        "text": "Символов двух случайных последовательностей",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 304,
    "question": "Аддитивные методы шифрования называют также…",
    "answers": [
      {
        "text": "Матричными",
        "isCorrect": false
      },
      {
        "text": "Дискретными",
        "isCorrect": false
      },
      {
        "text": "Арифметическими",
        "isCorrect": true
      },
      {
        "text": "Мультипликативными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 305,
    "question": "Криптографическая защита информации — это…",
    "answers": [
      {
        "text": "Сжатие данных",
        "isCorrect": false
      },
      {
        "text": "Преобразование информации для защиты от НСД",
        "isCorrect": true
      },
      {
        "text": "Ошибкоустойчивое кодирование",
        "isCorrect": false
      },
      {
        "text": "Хранение резервных копий",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 306,
    "question": "Процесс шифрования заключается…",
    "answers": [
      {
        "text": "В удалении лишних данных",
        "isCorrect": false
      },
      {
        "text": "В преобразовании открытого текста по ключу",
        "isCorrect": true
      },
      {
        "text": "В проверке целостности",
        "isCorrect": false
      },
      {
        "text": "В восстановлении структуры файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 307,
    "question": "Система разграничения доступа должна содержать четыре функциональных блока. Какие?",
    "answers": [
      {
        "text": "Сжатие, шифрование, архивирование, аутентификация",
        "isCorrect": false
      },
      {
        "text": "Коды, таблицы, ключи, протоколы",
        "isCorrect": false
      },
      {
        "text": "Идентификация, аутентификация, авторизация, аудит",
        "isCorrect": true
      },
      {
        "text": "Фильтрация, сигнализация, логирование, копирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 308,
    "question": "Имеются два пути получения защитных от НСД КС. Какие?",
    "answers": [
      {
        "text": "Аппаратные и физические",
        "isCorrect": false
      },
      {
        "text": "Физические и сетевые",
        "isCorrect": false
      },
      {
        "text": "Программные и аппаратные",
        "isCorrect": true
      },
      {
        "text": "Канальные и протокольные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 309,
    "question": "Программные системы защиты используют в качестве идентификатора…",
    "answers": [
      {
        "text": "Данные с камеры",
        "isCorrect": false
      },
      {
        "text": "Пароль",
        "isCorrect": true
      },
      {
        "text": "Сетевой протокол",
        "isCorrect": false
      },
      {
        "text": "Антивирусный ключ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 310,
    "question": "Контрольные характеристики файлов после работы на ПК записываются…",
    "answers": [
      {
        "text": "В BIOS",
        "isCorrect": false
      },
      {
        "text": "В файл подкачки",
        "isCorrect": false
      },
      {
        "text": "В специальные контрольные файлы",
        "isCorrect": true
      },
      {
        "text": "В оперативную память",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 311,
    "question": "Угроза несанкционированного копирования информации блокируется методами…",
    "answers": [
      {
        "text": "Дешифрования",
        "isCorrect": false
      },
      {
        "text": "Компрессии",
        "isCorrect": false
      },
      {
        "text": "Контроля доступа",
        "isCorrect": true
      },
      {
        "text": "Антивирусного анализа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 312,
    "question": "Архивация — это…",
    "answers": [
      {
        "text": "Защита от вирусов",
        "isCorrect": false
      },
      {
        "text": "Сжатие и упаковка данных",
        "isCorrect": true
      },
      {
        "text": "Шифрование данных",
        "isCorrect": false
      },
      {
        "text": "Очистка логов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 313,
    "question": "Под шифрованием понимается…",
    "answers": [
      {
        "text": "Проверка логов",
        "isCorrect": false
      },
      {
        "text": "Подпись данных",
        "isCorrect": false
      },
      {
        "text": "Преобразование информации по ключу",
        "isCorrect": true
      },
      {
        "text": "Перенос данных по каналам",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 314,
    "question": "Под … понимается процесс преобразования открытой информации в закрытую.",
    "answers": [
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Кодирование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 315,
    "question": "Преобразование закрытой информации в открытую — это…",
    "answers": [
      {
        "text": "Кодирование",
        "isCorrect": false
      },
      {
        "text": "Распаковка",
        "isCorrect": false
      },
      {
        "text": "Дешифрование",
        "isCorrect": true
      },
      {
        "text": "Оптимизация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 316,
    "question": "Основным показателем эффективности шифра является…",
    "answers": [
      {
        "text": "Длина пакета",
        "isCorrect": false
      },
      {
        "text": "Стойкость",
        "isCorrect": true
      },
      {
        "text": "Скорость копирования",
        "isCorrect": false
      },
      {
        "text": "Размер ключа в байтах (не всегда основной показатель)",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 317,
    "question": "Основные методы криптографического преобразования информации…",
    "answers": [
      {
        "text": "Аппаратные и физические",
        "isCorrect": false
      },
      {
        "text": "Линейные и сетевые",
        "isCorrect": false
      },
      {
        "text": "Симметричные и асимметричные",
        "isCorrect": true
      },
      {
        "text": "Динамические и статические",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 318,
    "question": "Процесс шифрования заключается…",
    "answers": [
      {
        "text": "В сравнении данных",
        "isCorrect": false
      },
      {
        "text": "В вычислении хеша",
        "isCorrect": false
      },
      {
        "text": "В преобразовании информации по ключу",
        "isCorrect": true
      },
      {
        "text": "В проверке подписи",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 319,
    "question": "Под … понимается такое преобразование информации, при котором она становится недоступной.",
    "answers": [
      {
        "text": "Архивированием",
        "isCorrect": false
      },
      {
        "text": "Шифрованием",
        "isCorrect": true
      },
      {
        "text": "Маршрутизацией",
        "isCorrect": false
      },
      {
        "text": "Контролем целостности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 320,
    "question": "Методы криптографического преобразования информации…",
    "answers": [
      {
        "text": "Сжатие и хеширование",
        "isCorrect": false
      },
      {
        "text": "Шифрование, кодирование, перестановки",
        "isCorrect": true
      },
      {
        "text": "Копирование и проверка",
        "isCorrect": false
      },
      {
        "text": "Логирование и аудит",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 321,
    "question": "Какой процесс заключается в математических, логических, комбинаторных преобразованиях?",
    "answers": [
      {
        "text": "Архивация",
        "isCorrect": false
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Компрессия",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 322,
    "question": "Метод … позволяет скрыть смысл и сам факт передачи информации.",
    "answers": [
      {
        "text": "Хеширования",
        "isCorrect": false
      },
      {
        "text": "Сжатия",
        "isCorrect": false
      },
      {
        "text": "Стеганографии",
        "isCorrect": true
      },
      {
        "text": "Архивирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 323,
    "question": "Процесс кодирования — это замена смысловых конструкций кодами.",
    "answers": [
      {
        "text": "Неверно",
        "isCorrect": false
      },
      {
        "text": "Верно",
        "isCorrect": true
      },
      {
        "text": "Частично верно",
        "isCorrect": false
      },
      {
        "text": "Только для симметричных систем",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 324,
    "question": "Компьютерные вирусы — это…",
    "answers": [
      {
        "text": "Системы архивирования",
        "isCorrect": false
      },
      {
        "text": "Самораспространяющиеся вредоносные программы",
        "isCorrect": true
      },
      {
        "text": "Криптографические модули",
        "isCorrect": false
      },
      {
        "text": "Средство шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 325,
    "question": "По среде обитания вирусы делятся на…",
    "answers": [
      {
        "text": "Графические и текстовые",
        "isCorrect": false
      },
      {
        "text": "Локальные и глобальные",
        "isCorrect": false
      },
      {
        "text": "Файловые, загрузочные, сетевые",
        "isCorrect": true
      },
      {
        "text": "Бинарные и символьные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 326,
    "question": "Средой обитания сетевых вирусов являются…",
    "answers": [
      {
        "text": "BIOS микросхемы",
        "isCorrect": false
      },
      {
        "text": "Буфер обмена",
        "isCorrect": false
      },
      {
        "text": "Компьютерные сети и сетевые протоколы",
        "isCorrect": true
      },
      {
        "text": "Архивы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 327,
    "question": "Файловые вирусы размещаются…",
    "answers": [
      {
        "text": "В оперативной памяти",
        "isCorrect": false
      },
      {
        "text": "В исполняемых файлах",
        "isCorrect": true
      },
      {
        "text": "В реестре",
        "isCorrect": false
      },
      {
        "text": "В таблицах маршрутизации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 328,
    "question": "Загрузочные вирусы находятся…",
    "answers": [
      {
        "text": "В файлах документов",
        "isCorrect": false
      },
      {
        "text": "В DLL-библиотеках",
        "isCorrect": false
      },
      {
        "text": "В загрузочных секторах дисков",
        "isCorrect": true
      },
      {
        "text": "В кэше браузера",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 329,
    "question": "Как называют загрузочные вирусы?",
    "answers": [
      {
        "text": "Файловыми",
        "isCorrect": false
      },
      {
        "text": "Терминальными",
        "isCorrect": false
      },
      {
        "text": "Boot-вирусами",
        "isCorrect": true
      },
      {
        "text": "Макровирусами",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 330,
    "question": "Какие вирусы размещаются в нескольких средах обитания?",
    "answers": [
      {
        "text": "Сетевые",
        "isCorrect": false
      },
      {
        "text": "Гибридные (многосегментные)",
        "isCorrect": true
      },
      {
        "text": "Макро",
        "isCorrect": false
      },
      {
        "text": "Микро",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 331,
    "question": "Термин «компьютерный вирус» был введён в середине…",
    "answers": [
      {
        "text": "1960-х",
        "isCorrect": false
      },
      {
        "text": "1970-х",
        "isCorrect": false
      },
      {
        "text": "1980-х",
        "isCorrect": true
      },
      {
        "text": "1990-х",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 332,
    "question": "По способу заражения среды обитания вирусы делятся на…",
    "answers": [
      {
        "text": "Файловые и логические",
        "isCorrect": false
      },
      {
        "text": "Паразитирующие, сетевые, загрузочные",
        "isCorrect": true
      },
      {
        "text": "Простые и составные",
        "isCorrect": false
      },
      {
        "text": "Микро и макро",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 333,
    "question": "Куда перемещаются резидентные вирусы после активации?",
    "answers": [
      {
        "text": "На диск",
        "isCorrect": false
      },
      {
        "text": "В ROM",
        "isCorrect": false
      },
      {
        "text": "В оперативную память",
        "isCorrect": true
      },
      {
        "text": "В Boot-сектор",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 334,
    "question": "По степени опасности для информационных ресурсов пользователя компьютерные вирусы можно разделить на:",
    "answers": [
      {
        "text": "Высокоскоростные и низкоскоростные",
        "isCorrect": false
      },
      {
        "text": "Нешаткие, опасные и чрезвычайно опасные",
        "isCorrect": true
      },
      {
        "text": "Сетевые и локальные",
        "isCorrect": false
      },
      {
        "text": "Крупные и мелкие",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 335,
    "question": "Какие вирусы существенно снижают эффективность КС, но не приводят к нарушению целостности и конфиденциальности информации, хранящейся в запоминающихся устройствах?",
    "answers": [
      {
        "text": "Чрезвычайно опасные",
        "isCorrect": false
      },
      {
        "text": "Неуловимые",
        "isCorrect": false
      },
      {
        "text": "Нешаткие (условно безвредные)",
        "isCorrect": true
      },
      {
        "text": "Boot-вирусы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 336,
    "question": "Вирусы, вызывающие нарушение конфиденциальности, уничтожение, необратимую модификацию информации, а также вирусы, блокирующие доступ к информации, приводящие к отказу аппаратных средств и наносящие ущерб здоровью пользователям, следует считать вирусы…",
    "answers": [
      {
        "text": "Лёгкими",
        "isCorrect": false
      },
      {
        "text": "Маскированными",
        "isCorrect": false
      },
      {
        "text": "Чрезвычайно опасными",
        "isCorrect": true
      },
      {
        "text": "Нешаткими",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 337,
    "question": "В соответствии с особенностями алгоритма функционирования вирусы можно разделить на два класса:",
    "answers": [
      {
        "text": "Линейные и блочные",
        "isCorrect": false
      },
      {
        "text": "Изменяющие среду и не изменяющие среду",
        "isCorrect": true
      },
      {
        "text": "Статические и динамические",
        "isCorrect": false
      },
      {
        "text": "Простые и сложные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 338,
    "question": "В свою очередь, вирусы, не изменяющие среду обитания, могут быть разделены на две группы:",
    "answers": [
      {
        "text": "Блокирующие и разрушающие",
        "isCorrect": false
      },
      {
        "text": "Стандартные и латентные",
        "isCorrect": false
      },
      {
        "text": "Резидентные и нерезидентные",
        "isCorrect": true
      },
      {
        "text": "Простые и модульные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 339,
    "question": "Какие вирусы не изменяют файлы?",
    "answers": [
      {
        "text": "Полиморфные",
        "isCorrect": false
      },
      {
        "text": "Резидентные-невредители",
        "isCorrect": true
      },
      {
        "text": "Boot-вирусы",
        "isCorrect": false
      },
      {
        "text": "Макровирусы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 340,
    "question": "Какие вирусы попадают в рабочую станцию из сети, вычисляют адреса рассылки вируса по другим абонентам сети и осуществляют передачу вируса?",
    "answers": [
      {
        "text": "Boot-вирусы",
        "isCorrect": false
      },
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Сетевые черви (worms)",
        "isCorrect": true
      },
      {
        "text": "Резидентные микровирусы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 341,
    "question": "По сложности, степени совершенства и особенностям маскировки алгоритмов вирусы, изменяющие среду обитания, делятся на:",
    "answers": [
      {
        "text": "Лёгкие, средние, тяжёлые",
        "isCorrect": false
      },
      {
        "text": "Простейшие, самообучающиеся, полиморфные",
        "isCorrect": true
      },
      {
        "text": "Открытые и скрытые",
        "isCorrect": false
      },
      {
        "text": "Динамические и статические",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 342,
    "question": "Вирусы, создатели которых имеют низкую квалификацию, называют…",
    "answers": [
      {
        "text": "Профессиональными",
        "isCorrect": false
      },
      {
        "text": "Любительскими",
        "isCorrect": true
      },
      {
        "text": "Многоуровневыми",
        "isCorrect": false
      },
      {
        "text": "Маскированными",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 343,
    "question": "Какие вирусы создаются квалифицированными специалистами, хорошо знающими принцип работы аппаратных средств и ОС, а также владеющими машиноориентированным программированием?",
    "answers": [
      {
        "text": "Любительские",
        "isCorrect": false
      },
      {
        "text": "Простые",
        "isCorrect": false
      },
      {
        "text": "Профессиональные",
        "isCorrect": true
      },
      {
        "text": "Локальные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 344,
    "question": "Какие вирусы не имеют постоянных опознавательных групп-сигнатур?",
    "answers": [
      {
        "text": "Boot-вирусы",
        "isCorrect": false
      },
      {
        "text": "Полиморфные",
        "isCorrect": true
      },
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Простые файловые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 345,
    "question": "Первый макровирус WinWord.Concept, поражающий документы Word, появился летом…",
    "answers": [
      {
        "text": "1991",
        "isCorrect": false
      },
      {
        "text": "1993",
        "isCorrect": false
      },
      {
        "text": "1995",
        "isCorrect": true
      },
      {
        "text": "1999",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 346,
    "question": "Какие вирусы заражают загрузочные (Boot) сектора гибких дисков и Boot-сектора или MBR жестких дисков?",
    "answers": [
      {
        "text": "Файловые",
        "isCorrect": false
      },
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Загрузочные",
        "isCorrect": true
      },
      {
        "text": "Логические",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 347,
    "question": "Назовите один из самых простых методов обнаружения вирусов.",
    "answers": [
      {
        "text": "Машинное обучение",
        "isCorrect": false
      },
      {
        "text": "Проверка сигнатур",
        "isCorrect": true
      },
      {
        "text": "Статистический анализ",
        "isCorrect": false
      },
      {
        "text": "Динамическая эмуляция",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 348,
    "question": "Какой метод обнаружения вирусов базируется на использовании программ-ревизоров?",
    "answers": [
      {
        "text": "Поведенческий",
        "isCorrect": false
      },
      {
        "text": "Сетевой",
        "isCorrect": false
      },
      {
        "text": "Контроль целостности",
        "isCorrect": true
      },
      {
        "text": "Сигнатурный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 349,
    "question": "Какой метод обнаружения вирусов сравнительно недавно начал использоваться для обнаружения вирусов?",
    "answers": [
      {
        "text": "Сигнатурный",
        "isCorrect": false
      },
      {
        "text": "Ревизорный",
        "isCorrect": false
      },
      {
        "text": "Поведенческий (поведенческий анализ)",
        "isCorrect": true
      },
      {
        "text": "Блокчейн-анализ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 350,
    "question": "Какой метод обнаружения вирусов основан на применении программ, которые постоянно находятся в ОЗУ и отслеживают действия остальных программ?",
    "answers": [
      {
        "text": "Ревизорный",
        "isCorrect": false
      },
      {
        "text": "Сетевой",
        "isCorrect": false
      },
      {
        "text": "Мониторный",
        "isCorrect": true
      },
      {
        "text": "Загрузочный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 351,
    "question": "Что понимается под созданием специального модуля для контроля целостности?",
    "answers": [
      {
        "text": "Создание драйвера ввода-вывода",
        "isCorrect": false
      },
      {
        "text": "Создание сетевого фильтра",
        "isCorrect": false
      },
      {
        "text": "Установка программ-ревизоров для фиксации состояния файлов",
        "isCorrect": true
      },
      {
        "text": "Добавление новых библиотек DLL",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 352,
    "question": "Метод обнаружения изменений базируется на использовании…",
    "answers": [
      {
        "text": "Антивирусных сигнатур",
        "isCorrect": false
      },
      {
        "text": "Контрольных сумм и хешей",
        "isCorrect": true
      },
      {
        "text": "Сетевых фильтров",
        "isCorrect": false
      },
      {
        "text": "Резервного копирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 353,
    "question": "По способу заражения среды обитания компьютерные вирусы делятся на:",
    "answers": [
      {
        "text": "Текстовые и графические",
        "isCorrect": false
      },
      {
        "text": "Паразитирующие, резидентные, нерезидентные",
        "isCorrect": true
      },
      {
        "text": "Статические и динамические",
        "isCorrect": false
      },
      {
        "text": "Полиморфные и простые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 354,
    "question": "Под криптографической защитой информации понимается…",
    "answers": [
      {
        "text": "Сжатие данных",
        "isCorrect": false
      },
      {
        "text": "Логирование действий",
        "isCorrect": false
      },
      {
        "text": "Преобразование данных для исключения НСД",
        "isCorrect": true
      },
      {
        "text": "Архивация файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 355,
    "question": "В чем заключается процесс шифрования?",
    "answers": [
      {
        "text": "В перезаписи данных в другой формат",
        "isCorrect": false
      },
      {
        "text": "В размножении информации",
        "isCorrect": false
      },
      {
        "text": "В преобразовании информации по ключу, делая её недоступной",
        "isCorrect": true
      },
      {
        "text": "В удалении конфиденциальных данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 356,
    "question": "Какие функциональные блоки должна содержать система разграничения доступа к информации?",
    "answers": [
      {
        "text": "Фильтрация, логирование, отчётность, контроль памяти",
        "isCorrect": false
      },
      {
        "text": "Идентификация, аутентификация, авторизация, аудит",
        "isCorrect": true
      },
      {
        "text": "Копирование, архивирование, шифрование, очистка",
        "isCorrect": false
      },
      {
        "text": "Мониторинг, фильтрация, антивирус, брандмауэр",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 357,
    "question": "… используют в качестве идентификатора программные системы защиты",
    "answers": [
      {
        "text": "Ретрансляторы",
        "isCorrect": false
      },
      {
        "text": "Ключевые носители",
        "isCorrect": false
      },
      {
        "text": "Пароль",
        "isCorrect": true
      },
      {
        "text": "Сетевой шлюз",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 358,
    "question": "Какими методами блокируется угроза несанкционированного копирования информации?",
    "answers": [
      {
        "text": "Компрессией",
        "isCorrect": false
      },
      {
        "text": "Архивированием",
        "isCorrect": false
      },
      {
        "text": "Контролем доступа и разграничением прав",
        "isCorrect": true
      },
      {
        "text": "Удалением файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 359,
    "question": "Существует несколько методов противодействия дизассемблированию. Что НЕ входит в их число?",
    "answers": [
      {
        "text": "Шифрование участков кода",
        "isCorrect": false
      },
      {
        "text": "Обфускация структуры программы",
        "isCorrect": false
      },
      {
        "text": "Ускорение работы процессора",
        "isCorrect": true
      },
      {
        "text": "Вставка ложных команд",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 360,
    "question": "Какие механизмы вводятся для противодействия трассировке программы?",
    "answers": [
      {
        "text": "Ускорение видеокарты",
        "isCorrect": false
      },
      {
        "text": "Автоматическое архивирование",
        "isCorrect": false
      },
      {
        "text": "Ложные переходы, антимониторинговые проверки, самоконтроль",
        "isCorrect": true
      },
      {
        "text": "Оптимизация компиляции",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 361,
    "question": "За счёт чего выполняются «случайные» переходы?",
    "answers": [
      {
        "text": "Добавления изображений в программу",
        "isCorrect": false
      },
      {
        "text": "Генерации случайных или псевдослучайных адресов",
        "isCorrect": true
      },
      {
        "text": "Фрагментации файлов",
        "isCorrect": false
      },
      {
        "text": "Оптимизации ОС",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 362,
    "question": "Шифрование — это…",
    "answers": [
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Аутентификация",
        "isCorrect": false
      },
      {
        "text": "Преобразование информации по ключу для защиты",
        "isCorrect": true
      },
      {
        "text": "Контроль доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 363,
    "question": "… — это процесс преобразования открытой информации в закрытую",
    "answers": [
      {
        "text": "Кодирование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Инкапсуляция",
        "isCorrect": false
      },
      {
        "text": "Маршрутизация",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 364,
    "question": "Процесс преобразования закрытой информации в открытую называется…",
    "answers": [
      {
        "text": "Архивированием",
        "isCorrect": false
      },
      {
        "text": "Компрессией",
        "isCorrect": false
      },
      {
        "text": "Дешифрованием",
        "isCorrect": true
      },
      {
        "text": "Отправкой",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 365,
    "question": "… — это основной показатель эффективности шифра",
    "answers": [
      {
        "text": "Скорость работы компьютера",
        "isCorrect": false
      },
      {
        "text": "Длина пакета",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость",
        "isCorrect": true
      },
      {
        "text": "Размер памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 366,
    "question": "Основными методами криптографического преобразования информации являются:",
    "answers": [
      {
        "text": "Упаковка и архивирование",
        "isCorrect": false
      },
      {
        "text": "Маршрутизация и ретрансляция",
        "isCorrect": false
      },
      {
        "text": "Симметричное и асимметричное шифрование",
        "isCorrect": true
      },
      {
        "text": "Печать и копирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 367,
    "question": "Коммуникационная подсистема включает в себя…",
    "answers": [
      {
        "text": "Только сетевые кабели",
        "isCorrect": false
      },
      {
        "text": "Каналы связи, сетевые устройства, протоколы",
        "isCorrect": true
      },
      {
        "text": "Программные драйверы мыши",
        "isCorrect": false
      },
      {
        "text": "Архиваторы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 368,
    "question": "Что объединяет элементы сети в единую сеть?",
    "answers": [
      {
        "text": "Антивирус",
        "isCorrect": false
      },
      {
        "text": "Системный журнал",
        "isCorrect": false
      },
      {
        "text": "Сетевые протоколы",
        "isCorrect": true
      },
      {
        "text": "Печать документов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 369,
    "question": "Для чего используют концентраторы?",
    "answers": [
      {
        "text": "Для защиты информации",
        "isCorrect": false
      },
      {
        "text": "Для объединения нескольких устройств в одну сеть",
        "isCorrect": true
      },
      {
        "text": "Для шифрования данных",
        "isCorrect": false
      },
      {
        "text": "Для резервного копирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 370,
    "question": "Для чего используют межсетевые шлюзы?",
    "answers": [
      {
        "text": "Для архивирования",
        "isCorrect": false
      },
      {
        "text": "Для ускорения процессора",
        "isCorrect": false
      },
      {
        "text": "Для соединения сетей с разными протоколами",
        "isCorrect": true
      },
      {
        "text": "Для очистки памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 371,
    "question": "Все потенциальные преднамеренные угрозы безопасности информации делят на две группы. На какие?",
    "answers": [
      {
        "text": "Локальные и глобальные",
        "isCorrect": false
      },
      {
        "text": "Явные и скрытые",
        "isCorrect": false
      },
      {
        "text": "Внутренние и внешние",
        "isCorrect": true
      },
      {
        "text": "Цифровые и аналоговые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 372,
    "question": "Укажите основные функции межсетевого экрана.",
    "answers": [
      {
        "text": "Архивирование файлов",
        "isCorrect": false
      },
      {
        "text": "Фильтрация трафика, контроль доступа, блокировка атак",
        "isCorrect": true
      },
      {
        "text": "Обновление драйверов",
        "isCorrect": false
      },
      {
        "text": "Диагностика оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 373,
    "question": "Обмен идентификаторами применим, если…",
    "answers": [
      {
        "text": "Канал нестабилен",
        "isCorrect": false
      },
      {
        "text": "Идентификаторы одинаковы у всех",
        "isCorrect": false
      },
      {
        "text": "Стороны доверяют друг другу",
        "isCorrect": true
      },
      {
        "text": "Используется Bluetooth",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 374,
    "question": "Если информация искажена умышленно, то её называют…",
    "answers": [
      {
        "text": "Утраченной",
        "isCorrect": false
      },
      {
        "text": "Модифицированной",
        "isCorrect": true
      },
      {
        "text": "Архивированной",
        "isCorrect": false
      },
      {
        "text": "Фрагментированной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 375,
    "question": "Какой подход предложил Шрейдор?",
    "answers": [
      {
        "text": "Подход оптимизации сетей",
        "isCorrect": false
      },
      {
        "text": "Модель изоляции объектов и субъектов (матрица доступа)",
        "isCorrect": true
      },
      {
        "text": "Метод ускоренного шифрования",
        "isCorrect": false
      },
      {
        "text": "Модель антивирусной фильтрации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 376,
    "question": "Компьютерные вирусы делятся на:",
    "answers": [
      {
        "text": "Открытые и закрытые",
        "isCorrect": false
      },
      {
        "text": "Цифровые и аналоговые",
        "isCorrect": false
      },
      {
        "text": "Файловые, загрузочные, сетевые, макровирусы",
        "isCorrect": true
      },
      {
        "text": "Локальные и глобальные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 377,
    "question": "Преобразование исходной информации, в результате которого она становится недоступной для ознакомления и использования лицами, не имеющими полномочий, называется:",
    "answers": [
      {
        "text": "Кодированием",
        "isCorrect": false
      },
      {
        "text": "Архивированием",
        "isCorrect": false
      },
      {
        "text": "Шифрованием",
        "isCorrect": true
      },
      {
        "text": "Компрессией",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 378,
    "question": "Основное понятие криптографической защиты информации — это…",
    "answers": [
      {
        "text": "Хеш-сумма",
        "isCorrect": false
      },
      {
        "text": "Ключ",
        "isCorrect": true
      },
      {
        "text": "Протокол маршрутизации",
        "isCorrect": false
      },
      {
        "text": "Сигнатура",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 379,
    "question": "Процесс шифрования основывается на…",
    "answers": [
      {
        "text": "Компрессии",
        "isCorrect": false
      },
      {
        "text": "Изменении формата",
        "isCorrect": false
      },
      {
        "text": "Использовании ключа и криптографического алгоритма",
        "isCorrect": true
      },
      {
        "text": "Перемещении файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 380,
    "question": "Какие блоки должна содержать система разграничения доступа к информации?",
    "answers": [
      {
        "text": "Логирование, архивирование, индексация",
        "isCorrect": false
      },
      {
        "text": "Кэширование, маршрутизация, анализ",
        "isCorrect": false
      },
      {
        "text": "Идентификация, аутентификация, авторизация, аудит",
        "isCorrect": true
      },
      {
        "text": "Контроль памяти, оптимизация, мониторинг",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 381,
    "question": "Чаще всего системы защиты в качестве идентификации используют…",
    "answers": [
      {
        "text": "QR-коды",
        "isCorrect": false
      },
      {
        "text": "Данные GPS",
        "isCorrect": false
      },
      {
        "text": "Пароли",
        "isCorrect": true
      },
      {
        "text": "MAC-адреса",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 382,
    "question": "Какие методы используются для защиты от несанкционированного копирования информации?",
    "answers": [
      {
        "text": "Ускорение ОС",
        "isCorrect": false
      },
      {
        "text": "Сжатие данных",
        "isCorrect": false
      },
      {
        "text": "Контроль доступа, разграничение прав",
        "isCorrect": true
      },
      {
        "text": "Расширение буфера",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 383,
    "question": "Дизассемблер это:",
    "answers": [
      {
        "text": "Упаковщик файлов",
        "isCorrect": false
      },
      {
        "text": "Антивирус",
        "isCorrect": false
      },
      {
        "text": "Программа, преобразующая машинный код в ассемблер",
        "isCorrect": true
      },
      {
        "text": "Архиватор",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 384,
    "question": "Какой метод НЕ входит в систему противодействий дизассемблированию?",
    "answers": [
      {
        "text": "Ложные команды",
        "isCorrect": false
      },
      {
        "text": "Обфускация",
        "isCorrect": false
      },
      {
        "text": "Изменение температуры процессора",
        "isCorrect": true
      },
      {
        "text": "Шифрование кода",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 385,
    "question": "Методы защиты от трассировки программы?",
    "answers": [
      {
        "text": "Перезагрузка системы",
        "isCorrect": false
      },
      {
        "text": "Ложные переходы, антимониторинговые проверки, самоконтроль",
        "isCorrect": true
      },
      {
        "text": "Сжатие данных",
        "isCorrect": false
      },
      {
        "text": "Изменение интерфейса",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 386,
    "question": "«Случайные» переходы вызываются …",
    "answers": [
      {
        "text": "Ошибками пользователя",
        "isCorrect": false
      },
      {
        "text": "Потерей питания",
        "isCorrect": false
      },
      {
        "text": "Генерацией случайных или псевдослучайных адресов",
        "isCorrect": true
      },
      {
        "text": "Перегревом устройства",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 387,
    "question": "Шифрование — это…",
    "answers": [
      {
        "text": "Запись на диск",
        "isCorrect": false
      },
      {
        "text": "Размножение данных",
        "isCorrect": false
      },
      {
        "text": "Преобразование информации по ключу с целью защиты",
        "isCorrect": true
      },
      {
        "text": "Проверка целостности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 388,
    "question": "Процесс преобразования информации с открытого вида в закрытый, используя определенный алгоритм –",
    "answers": [
      {
        "text": "Хеширование",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": true
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Кодировка символов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 389,
    "question": "Процесс преобразования закрытой информации в открытую, используя определенный алгоритм, это:",
    "answers": [
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Демонтаж",
        "isCorrect": false
      },
      {
        "text": "Дешифрование",
        "isCorrect": true
      },
      {
        "text": "Перенос",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 390,
    "question": "Качественность шифра?",
    "answers": [
      {
        "text": "Скорость работы ОС",
        "isCorrect": false
      },
      {
        "text": "Объём шифрованных файлов",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость",
        "isCorrect": true
      },
      {
        "text": "Количество пользователей",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 391,
    "question": "К основным методам криптографического преобразования информации относят:",
    "answers": [
      {
        "text": "Сжатие и хеширование",
        "isCorrect": false
      },
      {
        "text": "Дублирование данных",
        "isCorrect": false
      },
      {
        "text": "Симметричное и асимметричное шифрование",
        "isCorrect": true
      },
      {
        "text": "Дефрагментацию",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 392,
    "question": "Коммуникационная подсистема состоит из следующих составляющих:",
    "answers": [
      {
        "text": "Файловой системы и BIOS",
        "isCorrect": false
      },
      {
        "text": "Каналов связи, протоколов, сетевых устройств",
        "isCorrect": true
      },
      {
        "text": "Монитора и клавиатуры",
        "isCorrect": false
      },
      {
        "text": "Процессора и ОЗУ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 393,
    "question": "Средство, объединяющее элементы сети в единую сеть, называется:",
    "answers": [
      {
        "text": "Антивирус",
        "isCorrect": false
      },
      {
        "text": "Файловый менеджер",
        "isCorrect": false
      },
      {
        "text": "Сетевой протокол",
        "isCorrect": true
      },
      {
        "text": "Кэш-память",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 394,
    "question": "Концентраторы служат для:",
    "answers": [
      {
        "text": "Шифрования данных",
        "isCorrect": false
      },
      {
        "text": "Оптимизации трафика",
        "isCorrect": false
      },
      {
        "text": "Объединения нескольких устройств в общую сеть",
        "isCorrect": true
      },
      {
        "text": "Хранения резервных копий",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 395,
    "question": "Шлюзы используются для:",
    "answers": [
      {
        "text": "Замены кабелей",
        "isCorrect": false
      },
      {
        "text": "Соединения сетей с разными протоколами",
        "isCorrect": true
      },
      {
        "text": "Обнаружения вирусов",
        "isCorrect": false
      },
      {
        "text": "Ускорения Wi-Fi",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 396,
    "question": "На какие группы делятся преднамеренные угрозы безопасности?",
    "answers": [
      {
        "text": "Системные и несистемные",
        "isCorrect": false
      },
      {
        "text": "Большие и малые",
        "isCorrect": false
      },
      {
        "text": "Внутренние и внешние",
        "isCorrect": true
      },
      {
        "text": "Текстовые и двоичные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 397,
    "question": "Функции брандмауэра —",
    "answers": [
      {
        "text": "Архивирование данных",
        "isCorrect": false
      },
      {
        "text": "Фильтрация трафика, контроль доступа, защита от сетевых атак",
        "isCorrect": true
      },
      {
        "text": "Ускорение ОС",
        "isCorrect": false
      },
      {
        "text": "Установка драйверов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 398,
    "question": "Если … то применим обмен идентификаторами",
    "answers": [
      {
        "text": "Канал нестабилен",
        "isCorrect": false
      },
      {
        "text": "Стороны доверяют друг другу",
        "isCorrect": true
      },
      {
        "text": "Пакеты теряются",
        "isCorrect": false
      },
      {
        "text": "Используется Wi-Fi",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 399,
    "question": "Умышленным искажение информации является…",
    "answers": [
      {
        "text": "Случайная ошибка",
        "isCorrect": false
      },
      {
        "text": "Модификация",
        "isCorrect": true
      },
      {
        "text": "Архивация",
        "isCorrect": false
      },
      {
        "text": "Хеширование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 400,
    "question": "Подход предложенный Шрейдором?",
    "answers": [
      {
        "text": "Модель шифрования каналов",
        "isCorrect": false
      },
      {
        "text": "Метод предсказания трафика",
        "isCorrect": false
      },
      {
        "text": "Матрица разграничения доступа (модель Шрейдера–Шнайдера)",
        "isCorrect": true
      },
      {
        "text": "Алгоритм самовосстановления данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 401,
    "question": "Вирусы размещаемые в исполняемых файлах называются:",
    "answers": [
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Файловые вирусы",
        "isCorrect": true
      },
      {
        "text": "Сетевые вирусы",
        "isCorrect": false
      },
      {
        "text": "Скриптовые вирусы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 402,
    "question": "Вирусы, которые находятся в загрузочных секторах внешних запоминающих устройств (boot-секторах) называются:",
    "answers": [
      {
        "text": "Загрузочные вирусы",
        "isCorrect": true
      },
      {
        "text": "Файловые вирусы",
        "isCorrect": false
      },
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Резидентные вирусы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 403,
    "question": "Вирусы, которые размещаются в нескольких средах обитания:",
    "answers": [
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Файловые",
        "isCorrect": false
      },
      {
        "text": "Полиморфные (комбинированные, мультиобитающие)",
        "isCorrect": true
      },
      {
        "text": "Сетевые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 404,
    "question": "Вирусы-невидимки называются:",
    "answers": [
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Резидентные",
        "isCorrect": false
      },
      {
        "text": "Стелс-вирусы",
        "isCorrect": true
      },
      {
        "text": "Троянские программы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 405,
    "question": "Файловые действия при форматировании жесткого диска используют команду:",
    "answers": [
      {
        "text": "DELETE",
        "isCorrect": false
      },
      {
        "text": "FORMAT",
        "isCorrect": true
      },
      {
        "text": "ERASE",
        "isCorrect": false
      },
      {
        "text": "CLEAR",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 406,
    "question": "Вирусы, написанные с использованием программ из пакета MS Office (Word, Excel):",
    "answers": [
      {
        "text": "Макровирусы",
        "isCorrect": true
      },
      {
        "text": "Файловые",
        "isCorrect": false
      },
      {
        "text": "Полиморфные",
        "isCorrect": false
      },
      {
        "text": "Резидентные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 407,
    "question": "Какие вирусы загружаются первыми:",
    "answers": [
      {
        "text": "Загрузочные",
        "isCorrect": true
      },
      {
        "text": "Файловые",
        "isCorrect": false
      },
      {
        "text": "Макровирусы",
        "isCorrect": false
      },
      {
        "text": "Троянские",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 408,
    "question": "Программы для борьбы с вирусом:",
    "answers": [
      {
        "text": "Редакторы",
        "isCorrect": false
      },
      {
        "text": "Архиваторы",
        "isCorrect": false
      },
      {
        "text": "Антивирусы",
        "isCorrect": true
      },
      {
        "text": "Компрессоры",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 409,
    "question": "Один из самых простых методов обнаружения вируса является:",
    "answers": [
      {
        "text": "Полиморфный анализ",
        "isCorrect": false
      },
      {
        "text": "Эвристический анализ",
        "isCorrect": false
      },
      {
        "text": "Контроль целостности (сравнение контрольных сумм)",
        "isCorrect": true
      },
      {
        "text": "Поведенческий анализ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 410,
    "question": "Информация – это…",
    "answers": [
      {
        "text": "Только данные в цифровой форме",
        "isCorrect": false
      },
      {
        "text": "Сообщения, передаваемые по сети",
        "isCorrect": false
      },
      {
        "text": "Сведения, уменьшающие неопределенность",
        "isCorrect": true
      },
      {
        "text": "Любые текстовые данные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 411,
    "question": "С помощью материальных средств можно защищать только…",
    "answers": [
      {
        "text": "Логическую информацию",
        "isCorrect": false
      },
      {
        "text": "Материальные носители",
        "isCorrect": true
      },
      {
        "text": "Сетевые процессы",
        "isCorrect": false
      },
      {
        "text": "Программное обеспечение",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 412,
    "question": "Если информация искажена умышленно, то её называют…",
    "answers": [
      {
        "text": "Ошибочной",
        "isCorrect": false
      },
      {
        "text": "Потерянной",
        "isCorrect": false
      },
      {
        "text": "Дезинформацией",
        "isCorrect": true
      },
      {
        "text": "Неактуальной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 413,
    "question": "Зависимость ценности информации от времени приближения определения в соответствии с выражением…",
    "answers": [
      {
        "text": "I = p log p",
        "isCorrect": false
      },
      {
        "text": "S = k ln n",
        "isCorrect": false
      },
      {
        "text": "C(t) = C₀ · e^(–kt)",
        "isCorrect": true
      },
      {
        "text": "E = mc²",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 414,
    "question": "Информация может быть получена тремя путями:",
    "answers": [
      {
        "text": "Электронно, логически, кодированием",
        "isCorrect": false
      },
      {
        "text": "Путём наблюдения, измерения, общения",
        "isCorrect": true
      },
      {
        "text": "Копированием, передачей, хранением",
        "isCorrect": false
      },
      {
        "text": "Анализом, сравнением, вычислением",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 415,
    "question": "Какие существуют подходы к измерению количества информации?",
    "answers": [
      {
        "text": "Логический, сетевой",
        "isCorrect": false
      },
      {
        "text": "Шифровальный, криптографический",
        "isCorrect": false
      },
      {
        "text": "Вероятностный и алфавитный",
        "isCorrect": true
      },
      {
        "text": "Иерархический и системный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 416,
    "question": "Формула Шеннона:",
    "answers": [
      {
        "text": "I = kt",
        "isCorrect": false
      },
      {
        "text": "I = – Σ pᵢ log₂ pᵢ",
        "isCorrect": true
      },
      {
        "text": "I = m · n",
        "isCorrect": false
      },
      {
        "text": "I = log₂ N",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 417,
    "question": "В качестве предмета защиты рассматривается информация,…",
    "answers": [
      {
        "text": "Которая хранится на внешних носителях",
        "isCorrect": false
      },
      {
        "text": "Обрабатываемая, хранимая и передаваемая в системе",
        "isCorrect": true
      },
      {
        "text": "Только передаваемая по сети",
        "isCorrect": false
      },
      {
        "text": "Только конфиденциальная",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 418,
    "question": "Объектом защиты информации является…",
    "answers": [
      {
        "text": "Пользователь",
        "isCorrect": false
      },
      {
        "text": "Информационные ресурсы",
        "isCorrect": true
      },
      {
        "text": "Кабельные линии",
        "isCorrect": false
      },
      {
        "text": "Персонал",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 419,
    "question": "Что является компьютерной системой?",
    "answers": [
      {
        "text": "Только компьютер пользователя",
        "isCorrect": false
      },
      {
        "text": "Только программное обеспечение",
        "isCorrect": false
      },
      {
        "text": "Комплекс аппаратных и программных средств",
        "isCorrect": true
      },
      {
        "text": "Только сеть",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 420,
    "question": "Предметом защиты в КС является…",
    "answers": [
      {
        "text": "Аппаратура",
        "isCorrect": false
      },
      {
        "text": "Сеть",
        "isCorrect": false
      },
      {
        "text": "Информация",
        "isCorrect": true
      },
      {
        "text": "Пользователь",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 421,
    "question": "В системе информация хранится…",
    "answers": [
      {
        "text": "Только в оперативной памяти",
        "isCorrect": false
      },
      {
        "text": "На различных носителях и в памяти системы",
        "isCorrect": true
      },
      {
        "text": "Только на сервере",
        "isCorrect": false
      },
      {
        "text": "Только на внешних устройствах",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 422,
    "question": "К какому классу относятся компьютерные системы?",
    "answers": [
      {
        "text": "Биологические",
        "isCorrect": false
      },
      {
        "text": "Электрические",
        "isCorrect": false
      },
      {
        "text": "Технические",
        "isCorrect": true
      },
      {
        "text": "Химические",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 423,
    "question": "Безопасность информации в КС – это…",
    "answers": [
      {
        "text": "Ограничение доступа всем пользователям",
        "isCorrect": false
      },
      {
        "text": "Состояние защищённости информации от угроз",
        "isCorrect": true
      },
      {
        "text": "Наличие антивируса",
        "isCorrect": false
      },
      {
        "text": "Шифрование всех файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 424,
    "question": "Компьютерная система, в которой обеспечивается безопасность информации, называется…",
    "answers": [
      {
        "text": "Надёжная",
        "isCorrect": false
      },
      {
        "text": "Защищённая",
        "isCorrect": true
      },
      {
        "text": "Ускоренная",
        "isCorrect": false
      },
      {
        "text": "Изолированная",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 425,
    "question": "Основным документом, на основе которого проводится политика информационной безопасности, называется…",
    "answers": [
      {
        "text": "Техническое задание",
        "isCorrect": false
      },
      {
        "text": "Руководство пользователя",
        "isCorrect": false
      },
      {
        "text": "Политика безопасности (ПИБ)",
        "isCorrect": true
      },
      {
        "text": "Регламент обслуживания",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 426,
    "question": "Под системой защиты информации в КС понимается…",
    "answers": [
      {
        "text": "Совокупность только программных средств",
        "isCorrect": false
      },
      {
        "text": "Набор сетевых протоколов",
        "isCorrect": false
      },
      {
        "text": "Комплекс организационных, технических и программных мер",
        "isCorrect": true
      },
      {
        "text": "Только антивирусная защита",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 427,
    "question": "Какие особенности имеет информация?",
    "answers": [
      {
        "text": "Неизменяемость и безопасность",
        "isCorrect": false
      },
      {
        "text": "Ценность, актуальность, достоверность",
        "isCorrect": true
      },
      {
        "text": "Физическая масса и объём",
        "isCorrect": false
      },
      {
        "text": "Константность и стабильность",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 428,
    "question": "Информация доступна человеку, если она …?",
    "answers": [
      {
        "text": "Закрыта и зашифрована",
        "isCorrect": false
      },
      {
        "text": "Хранится на сервере",
        "isCorrect": false
      },
      {
        "text": "Представлена в понятной форме",
        "isCorrect": true
      },
      {
        "text": "Имеет цифровой формат",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 429,
    "question": "Зависимость ценности информации от времени приближенно определяется в соответствии с выражением:",
    "answers": [
      {
        "text": "I = log(n)",
        "isCorrect": false
      },
      {
        "text": "C(t) = C₀ · e^(–kt)",
        "isCorrect": true
      },
      {
        "text": "E = mc²",
        "isCorrect": false
      },
      {
        "text": "t = k/I",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 430,
    "question": "Со временем ценность информации…?",
    "answers": [
      {
        "text": "Увеличивается всегда",
        "isCorrect": false
      },
      {
        "text": "Не меняется",
        "isCorrect": false
      },
      {
        "text": "Уменьшается",
        "isCorrect": true
      },
      {
        "text": "Становится бесконечной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 431,
    "question": "Какими путями может быть получена информация?",
    "answers": [
      {
        "text": "Только через интернет",
        "isCorrect": false
      },
      {
        "text": "Через кодирование и декодирование",
        "isCorrect": false
      },
      {
        "text": "Путем наблюдения, измерения, общения",
        "isCorrect": true
      },
      {
        "text": "Через преобразование сигналов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 432,
    "question": "Выберите формулу Шеннона:",
    "answers": [
      {
        "text": "I = k·t",
        "isCorrect": false
      },
      {
        "text": "I = log₂N",
        "isCorrect": false
      },
      {
        "text": "I = – Σ pᵢ log₂ pᵢ",
        "isCorrect": true
      },
      {
        "text": "I = m·n",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 433,
    "question": "Кем предложен тезаурусный подход?",
    "answers": [
      {
        "text": "Тьюрингом",
        "isCorrect": false
      },
      {
        "text": "Мильославским",
        "isCorrect": true
      },
      {
        "text": "Шенноном",
        "isCorrect": false
      },
      {
        "text": "Винером",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 434,
    "question": "Понятие КС очень широкое и охватывает следующие системы:",
    "answers": [
      {
        "text": "Только локальные сети",
        "isCorrect": false
      },
      {
        "text": "Только офисные ПК",
        "isCorrect": false
      },
      {
        "text": "Аппаратные, программные, сетевые и телекоммуникационные системы",
        "isCorrect": true
      },
      {
        "text": "Только вычислительные центры",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 435,
    "question": "Что такое безопасность (защищенность) информации в КС?",
    "answers": [
      {
        "text": "Ограничение использования компьютеров",
        "isCorrect": false
      },
      {
        "text": "Установка антивирусов",
        "isCorrect": false
      },
      {
        "text": "Состояние защищённости информации от угроз",
        "isCorrect": true
      },
      {
        "text": "Шифрование всех файлов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 436,
    "question": "Информация добывается с целью получения прибыли или преимуществ перед конкурентами, противоборствующими сторонами. Для этого информация:",
    "answers": [
      {
        "text": "Лёгкой для изменения",
        "isCorrect": false
      },
      {
        "text": "Сложной и запутанной",
        "isCorrect": false
      },
      {
        "text": "Актуальной, точной и своевременной",
        "isCorrect": true
      },
      {
        "text": "Огромного объёма",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 437,
    "question": "В качестве предмета защиты рассматривается информация, хранящаяся, обрабатываемая и передаваемая в компьютерных системах. Особенностями этой информации являются:",
    "answers": [
      {
        "text": "Имеет физическую форму",
        "isCorrect": false
      },
      {
        "text": "Занимает мало места",
        "isCorrect": false
      },
      {
        "text": "Ценность, уязвимость, необходимость сохранения целостности и доступности",
        "isCorrect": true
      },
      {
        "text": "Не требует обработки",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 438,
    "question": "Компьютерная система — это…?",
    "answers": [
      {
        "text": "Один компьютер",
        "isCorrect": false
      },
      {
        "text": "Совокупность аппаратных и программных средств, обеспечивающих обработку информации",
        "isCorrect": true
      },
      {
        "text": "Набор сетевых кабелей",
        "isCorrect": false
      },
      {
        "text": "Только программная часть",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 439,
    "question": "В КС под системой защиты информации понимается?",
    "answers": [
      {
        "text": "Пароли пользователей",
        "isCorrect": false
      },
      {
        "text": "Антивирусы",
        "isCorrect": false
      },
      {
        "text": "Организационные и технические меры, предотвращающие угрозы",
        "isCorrect": true
      },
      {
        "text": "Только шифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 440,
    "question": "Какие существуют подходы к измерению количества информации?",
    "answers": [
      {
        "text": "Инженерный и биологический",
        "isCorrect": false
      },
      {
        "text": "Кодовый и графический",
        "isCorrect": false
      },
      {
        "text": "Алфавитный и вероятностный",
        "isCorrect": true
      },
      {
        "text": "Математический и логический",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 441,
    "question": "В каком году был принят Закон Республики Казахстан об информатизации?",
    "answers": [
      {
        "text": "1993",
        "isCorrect": false
      },
      {
        "text": "2015",
        "isCorrect": true
      },
      {
        "text": "2008",
        "isCorrect": false
      },
      {
        "text": "2020",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 442,
    "question": "Это качество информации определяется степенью её полезности для владельца?",
    "answers": [
      {
        "text": "Точность",
        "isCorrect": false
      },
      {
        "text": "Ценность",
        "isCorrect": true
      },
      {
        "text": "Доступность",
        "isCorrect": false
      },
      {
        "text": "Целостность",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 443,
    "question": "Какая из перечисленных является формулой Шеннона?",
    "answers": [
      {
        "text": "I = k·n",
        "isCorrect": false
      },
      {
        "text": "I = log₂ N",
        "isCorrect": false
      },
      {
        "text": "I = – Σ pᵢ log₂ pᵢ",
        "isCorrect": true
      },
      {
        "text": "I = N/t",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 444,
    "question": "Какие существуют подходы к измерению количества информации? (повторное формулирование)",
    "answers": [
      {
        "text": "Интервальный, глобальный",
        "isCorrect": false
      },
      {
        "text": "Статический, динамический",
        "isCorrect": false
      },
      {
        "text": "Алфавитный и вероятностный",
        "isCorrect": true
      },
      {
        "text": "Логический и вычислительный",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 445,
    "question": "В выражении , где это-",
    "answers": [
      {
        "text": "Начальная ценность информации",
        "isCorrect": false
      },
      {
        "text": "Ценность информации в момент времени t",
        "isCorrect": true
      },
      {
        "text": "Коэффициент важности",
        "isCorrect": false
      },
      {
        "text": "Скорость её убывания",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 446,
    "question": "Со временем ценность информации…",
    "answers": [
      {
        "text": "Стабилизируется",
        "isCorrect": false
      },
      {
        "text": "Увеличивается экспоненциально",
        "isCorrect": false
      },
      {
        "text": "Уменьшается",
        "isCorrect": true
      },
      {
        "text": "Не меняется",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 447,
    "question": "По какой формуле может быть подсчитано количество информации в сообщении?",
    "answers": [
      {
        "text": "E = mc²",
        "isCorrect": false
      },
      {
        "text": "t = d/v",
        "isCorrect": false
      },
      {
        "text": "I = – Σ pᵢ log₂ pᵢ",
        "isCorrect": true
      },
      {
        "text": "I = N·k",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 448,
    "question": "Тезаурус — это…",
    "answers": [
      {
        "text": "Кодовое слово",
        "isCorrect": false
      },
      {
        "text": "Тип вируса",
        "isCorrect": false
      },
      {
        "text": "Система знаний субъекта",
        "isCorrect": true
      },
      {
        "text": "Сеть терминалов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 449,
    "question": "Какова структура тезауруса?",
    "answers": [
      {
        "text": "Линейная и блочная",
        "isCorrect": false
      },
      {
        "text": "Адресная и индексная",
        "isCorrect": false
      },
      {
        "text": "Ядро знаний, активный словарь, пассивный словарь",
        "isCorrect": true
      },
      {
        "text": "Входы и выходы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 450,
    "question": "Если информация искажена умышленно, то её называют…",
    "answers": [
      {
        "text": "Ошибочной",
        "isCorrect": false
      },
      {
        "text": "Недоступной",
        "isCorrect": false
      },
      {
        "text": "Дезинформацией",
        "isCorrect": true
      },
      {
        "text": "Утраченной",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 451,
    "question": "В формуле Шеннона — это:",
    "answers": [
      {
        "text": "Количество символов",
        "isCorrect": false
      },
      {
        "text": "Длина сообщения",
        "isCorrect": false
      },
      {
        "text": "Вероятность появления i-го символа",
        "isCorrect": true
      },
      {
        "text": "Размер алфавита",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 452,
    "question": "Комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации?",
    "answers": [
      {
        "text": "Сервер",
        "isCorrect": false
      },
      {
        "text": "Сеть",
        "isCorrect": false
      },
      {
        "text": "Компьютерная система",
        "isCorrect": true
      },
      {
        "text": "Модуль безопасности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 453,
    "question": "Защищенность информации в КС — это:",
    "answers": [
      {
        "text": "Шифрование всех файлов",
        "isCorrect": false
      },
      {
        "text": "Ограничение Интернета",
        "isCorrect": false
      },
      {
        "text": "Состояние обеспеченности конфиденциальности, целостности и доступности",
        "isCorrect": true
      },
      {
        "text": "Запрет на копирование данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 454,
    "question": "Какая информация является конфиденциальной?",
    "answers": [
      {
        "text": "Открытые данные",
        "isCorrect": false
      },
      {
        "text": "Архивные документы",
        "isCorrect": false
      },
      {
        "text": "Информация с ограниченным доступом",
        "isCorrect": true
      },
      {
        "text": "Публикации в СМИ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 455,
    "question": "Гриф ... может присваивается в государственных учреждениях менее важной информации.",
    "answers": [
      {
        "text": "«Совершенно секретно»",
        "isCorrect": false
      },
      {
        "text": "«Особой важности»",
        "isCorrect": false
      },
      {
        "text": "«Для служебного пользования»",
        "isCorrect": true
      },
      {
        "text": "«Стратегическая»",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 456,
    "question": "Какую тайну могут содержать сведения, принадлежащие государству (государ¬ственному учреждению)?",
    "answers": [
      {
        "text": "Коммерческую",
        "isCorrect": false
      },
      {
        "text": "Государственную тайну",
        "isCorrect": true
      },
      {
        "text": "Персональную",
        "isCorrect": false
      },
      {
        "text": "Служебную",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 457,
    "question": "Что позволяет определить анализ формулы Шеннона?",
    "answers": [
      {
        "text": "Скорость сети",
        "isCorrect": false
      },
      {
        "text": "Количество информации в сообщении",
        "isCorrect": true
      },
      {
        "text": "Размер файла",
        "isCorrect": false
      },
      {
        "text": "Уровень защиты",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 458,
    "question": "В зависимости от права собственности электронные информационные ресурсы подразделяются на:",
    "answers": [
      {
        "text": "Платные и бесплатные",
        "isCorrect": false
      },
      {
        "text": "Государственные и частные",
        "isCorrect": true
      },
      {
        "text": "Большие и малые",
        "isCorrect": false
      },
      {
        "text": "Важные и второстепенные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 459,
    "question": "В зависимости от категории доступа электронные информационные ресурсы подразделяются на:",
    "answers": [
      {
        "text": "Временные и постоянные",
        "isCorrect": false
      },
      {
        "text": "Платные и бесплатные",
        "isCorrect": false
      },
      {
        "text": "Открытые и ограниченного доступа",
        "isCorrect": true
      },
      {
        "text": "Внешние и внутренние",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 460,
    "question": "Электронные информационные ресурсы, содержащие информацию, которая предоставляется или распространяется ее собственником или владельцем без указания условий ее использования, а также сведения, доступ к которым является свободным и не зависит от формы их представления и способа распространения, являются…",
    "answers": [
      {
        "text": "Ограниченные",
        "isCorrect": false
      },
      {
        "text": "Закрытые",
        "isCorrect": false
      },
      {
        "text": "Открытые электронные ресурсы",
        "isCorrect": true
      },
      {
        "text": "Тайные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 461,
    "question": "Электронные информационные ресурсы, содержащие сведения, доступ к которым ограничен законами Республики Казахстан или их собственником, или владельцем в случаях, установленных законодательством Республики Казахстан, являются…",
    "answers": [
      {
        "text": "Открытые",
        "isCorrect": false
      },
      {
        "text": "Электронные ресурсы ограниченного доступа",
        "isCorrect": true
      },
      {
        "text": "Публичные",
        "isCorrect": false
      },
      {
        "text": "Общие",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 462,
    "question": "Электронные информационные ресурсы, состоящие из государственных электронных информационных ресурсов, имеющих важное стратегическое значение для экономики и безопасности государства, являются…",
    "answers": [
      {
        "text": "Открытые",
        "isCorrect": false
      },
      {
        "text": "Частные",
        "isCorrect": false
      },
      {
        "text": "Специально защищаемые",
        "isCorrect": true
      },
      {
        "text": "Лицензионные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 463,
    "question": "Электронные информационные ресурсы, создаваемые и приобретаемые за счет средств физических и юридических лиц, а также полученные ими путем иных установленных законами Республики Казахстан способов, являются…",
    "answers": [
      {
        "text": "Государственные",
        "isCorrect": false
      },
      {
        "text": "Частные",
        "isCorrect": true
      },
      {
        "text": "Стратегические",
        "isCorrect": false
      },
      {
        "text": "Секретные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 464,
    "question": "Государственные электронные информационные ресурсы Республики Казахстан являются общедоступными, за исключением…",
    "answers": [
      {
        "text": "Информации для СМИ",
        "isCorrect": false
      },
      {
        "text": "Научных данных",
        "isCorrect": false
      },
      {
        "text": "Ресурсов ограниченного доступа",
        "isCorrect": true
      },
      {
        "text": "Образовательных материалов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 465,
    "question": "Электронные информационные ресурсы ограниченного доступа подразделяются на электронные информационные ресурсы, отнесенные к…",
    "answers": [
      {
        "text": "Свободные и архивные",
        "isCorrect": false
      },
      {
        "text": "Содержат государственную тайну и персональные данные",
        "isCorrect": true
      },
      {
        "text": "Важные и неважные",
        "isCorrect": false
      },
      {
        "text": "Основные и вспомогательные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 466,
    "question": "Деятельность государственных органов по формированию государственных электронных информационных ресурсов финансируется за счет…",
    "answers": [
      {
        "text": "Спонсоров",
        "isCorrect": false
      },
      {
        "text": "Государственного бюджета",
        "isCorrect": true
      },
      {
        "text": "Частных лиц",
        "isCorrect": false
      },
      {
        "text": "Международных фондов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 467,
    "question": "Предоставление электронных информационных ресурсов государственными органами, физическими и юридическими лицами является обязательным в случаях, предусмотренных …",
    "answers": [
      {
        "text": "Правилами офиса",
        "isCorrect": false
      },
      {
        "text": "Законодательством РК",
        "isCorrect": true
      },
      {
        "text": "Внутренними инструкциями",
        "isCorrect": false
      },
      {
        "text": "Приказом руководителя",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 468,
    "question": "Для электронных информационных ресурсов, содержащих персональные данные, соблюдение конфиденциальности обязательно с момента,",
    "answers": [
      {
        "text": "Первого редактирования",
        "isCorrect": false
      },
      {
        "text": "Архивирования",
        "isCorrect": false
      },
      {
        "text": "Их получения",
        "isCorrect": true
      },
      {
        "text": "Уничтожения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 469,
    "question": "Электронные информационные ресурсы, содержащие персональные данные о физических лицах, относятся к категории…",
    "answers": [
      {
        "text": "Открытым",
        "isCorrect": false
      },
      {
        "text": "Ресурсам ограниченного доступа",
        "isCorrect": true
      },
      {
        "text": "Временным",
        "isCorrect": false
      },
      {
        "text": "Публичным",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 470,
    "question": "Права на электронные информационные ресурсы, включенные в состав информационных систем, определяются соглашением между…",
    "answers": [
      {
        "text": "Государством и общественностью",
        "isCorrect": false
      },
      {
        "text": "Арендодателем и пользователем",
        "isCorrect": false
      },
      {
        "text": "Собственником и владельцем системы",
        "isCorrect": true
      },
      {
        "text": "Сотрудниками и отделом ИБ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 471,
    "question": "По времени восстановления информации, методы дублиро¬вания могут быть разделены на:",
    "answers": [
      {
        "text": "Горячие и пассивные",
        "isCorrect": false
      },
      {
        "text": "Оперативные и неоперативные",
        "isCorrect": true
      },
      {
        "text": "Дешевые и дорогие",
        "isCorrect": false
      },
      {
        "text": "Локальные и сетевые",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 472,
    "question": "По используемым для целей дублирования средствам методы дублирования можно разделить на методы, использующие:",
    "answers": [
      {
        "text": "Клавиатуру и мышь",
        "isCorrect": false
      },
      {
        "text": "Программные и аппаратные средства",
        "isCorrect": true
      },
      {
        "text": "Вирусные технологии",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 473,
    "question": "По числу копий методы дублирования делятся на:",
    "answers": [
      {
        "text": "Кодовые и многопроходные",
        "isCorrect": false
      },
      {
        "text": "Минимальные и максимальные",
        "isCorrect": false
      },
      {
        "text": "Однократные и многократные",
        "isCorrect": true
      },
      {
        "text": "Временные и вечные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 474,
    "question": "В соответствии с процедурой дублирования различают методы:",
    "answers": [
      {
        "text": "Внешние и внутренние",
        "isCorrect": false
      },
      {
        "text": "Полные и выборочные",
        "isCorrect": true
      },
      {
        "text": "Физические и логические",
        "isCorrect": false
      },
      {
        "text": "Дешевые и дорогие",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 475,
    "question": "Зеркальным называют жесткий магнитный диск…",
    "answers": [
      {
        "text": "Имеет двойную ёмкость",
        "isCorrect": false
      },
      {
        "text": "Работает в автономном режиме",
        "isCorrect": false
      },
      {
        "text": "Содержит точную копию другого диска (RAID 1)",
        "isCorrect": true
      },
      {
        "text": "Поддерживает шифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 476,
    "question": "Под надежностью понимается…",
    "answers": [
      {
        "text": "Способность системы противостоять несанкционированному доступу",
        "isCorrect": false
      },
      {
        "text": "Свойство системы выполнять возложенные на нее задачи в определенных условиях эксплуатации",
        "isCorrect": false
      },
      {
        "text": "Свойство системы сохранять во времени в установленных пределах значения всех параметров, характеризующих ее способность выполнять требуемые функции",
        "isCorrect": true
      },
      {
        "text": "Стоимость системы, необходимая для ее создания и эксплуатации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 477,
    "question": "Надежность КС достигается на этапах:",
    "answers": [
      {
        "text": "Только на этапе проектирования",
        "isCorrect": false
      },
      {
        "text": "Только на этапе производства",
        "isCorrect": false
      },
      {
        "text": "На всех этапах жизненного цикла: проектирования, производства и эксплуатации",
        "isCorrect": true
      },
      {
        "text": "Только на этапе эксплуатации и технического обслуживания",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 478,
    "question": "Свойство системы выполнять возложенные на нее задачи в определенных условиях эксплуатации.",
    "answers": [
      {
        "text": "Отказоустойчивость",
        "isCorrect": false
      },
      {
        "text": "Живучесть",
        "isCorrect": false
      },
      {
        "text": "Надежность",
        "isCorrect": true
      },
      {
        "text": "Безопасность",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 479,
    "question": "Отказоустойчивость – это…",
    "answers": [
      {
        "text": "Свойство системы предотвращать возникновение отказов",
        "isCorrect": false
      },
      {
        "text": "Способность системы к самовосстановлению после отказа",
        "isCorrect": false
      },
      {
        "text": "Свойство системы сохранять работоспособность (полностью или частично) при отказах отдельных ее составных частей",
        "isCorrect": true
      },
      {
        "text": "Совокупность свойств, обеспечивающих защиту информации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 480,
    "question": "Простое резервирование основано на…",
    "answers": [
      {
        "text": "Использовании мажоритарной логики для принятия решения",
        "isCorrect": false
      },
      {
        "text": "Введении избыточности в кодовые комбинации",
        "isCorrect": false
      },
      {
        "text": "Замене отказавшего элемента идентичным ему резервным",
        "isCorrect": true
      },
      {
        "text": "Повышении качества используемых компонентов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 481,
    "question": "Помехоустойчивое кодирование основано на…",
    "answers": [
      {
        "text": "Сжатии данных для уменьшения их объема",
        "isCorrect": false
      },
      {
        "text": "Шифровании данных для обеспечения их конфиденциальности",
        "isCorrect": false
      },
      {
        "text": "Введении в кодовую комбинацию избыточных символов для обнаружения и исправления ошибок",
        "isCorrect": true
      },
      {
        "text": "Увеличении мощности передаваемого сигнала",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 482,
    "question": "Какие совершенные системы являются наиболее устойчивыми к отказам?",
    "answers": [
      {
        "text": "Системы без резервирования",
        "isCorrect": false
      },
      {
        "text": "Системы со скользящим резервом",
        "isCorrect": false
      },
      {
        "text": "Системы с совершенным мажоритарным элементом",
        "isCorrect": true
      },
      {
        "text": "Системы с простым резервированием замещением",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 483,
    "question": "В каких системах реализуется так называемый принцип элегантной деградации?",
    "answers": [
      {
        "text": "В системах с постоянным резервированием",
        "isCorrect": false
      },
      {
        "text": "В системах с мажоритарным резервированием",
        "isCorrect": false
      },
      {
        "text": "В системах со скользящим резервом",
        "isCorrect": true
      },
      {
        "text": "В нерезервированных системах",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 484,
    "question": "На какие методы защиты от электромагнитных излучений и наводок можно разделить?",
    "answers": [
      {
        "text": "На аппаратные и программные",
        "isCorrect": false
      },
      {
        "text": "На превентивные и реактивные",
        "isCorrect": false
      },
      {
        "text": "На пассивные и активные",
        "isCorrect": true
      },
      {
        "text": "На основные и вспомогательные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 485,
    "question": "Эти методы обеспечивают уменьшение уровня опасного сигнала или снижение информативности сигналов.",
    "answers": [
      {
        "text": "Активные методы",
        "isCorrect": false
      },
      {
        "text": "Алгоритмические методы",
        "isCorrect": false
      },
      {
        "text": "Пассивные методы",
        "isCorrect": true
      },
      {
        "text": "Организационные методы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 486,
    "question": "Что является одним из самых эффективных методов защиты от электромагнитных излучений?",
    "answers": [
      {
        "text": "Увеличение тактовой частоты работы устройства",
        "isCorrect": false
      },
      {
        "text": "Использование более длинных соединительных кабелей",
        "isCorrect": false
      },
      {
        "text": "Экранирование",
        "isCorrect": true
      },
      {
        "text": "Регулярное дефрагментирование жесткого диска",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 487,
    "question": "Под ………………… понимается размещение элементов КС, создающих электрические, магнитные и электромагнитные поля, в пространственно замкнутых конструкциях.",
    "answers": [
      {
        "text": "Фильтрацией",
        "isCorrect": false
      },
      {
        "text": "Заземлением",
        "isCorrect": false
      },
      {
        "text": "Экранированием",
        "isCorrect": true
      },
      {
        "text": "Коммутацией",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 488,
    "question": "В зависимости от типа создаваемого электромагнитного поля различают следующие виды экранирования:",
    "answers": [
      {
        "text": "Экранирование электрического поля",
        "isCorrect": false
      },
      {
        "text": "Экранирование электромагнитного поля",
        "isCorrect": true
      },
      {
        "text": "Экранирование замкнутых конструкций",
        "isCorrect": false
      },
      {
        "text": "экранирование полей",
        "isCorrect": false
      },
      {
        "text": "экранирование магнитного поля.",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 489,
    "question": "Эти методы защиты направлены на создание помех в каналах побочных электромагнитных излучений и наводок, затрудняющих прием и выделение полезной информации из перехваченных злоумышленником сигналов.",
    "answers": [
      {
        "text": "Активные методы",
        "isCorrect": true
      },
      {
        "text": "Пассивные методы",
        "isCorrect": false
      },
      {
        "text": "Конструктивные методы",
        "isCorrect": false
      },
      {
        "text": "Программные методы",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 490,
    "question": "Изменения ……………. сводятся к изменению взаимного расположения отдельных узлов, блоков, кабелей, сокращению длины шин.",
    "answers": [
      {
        "text": "Алгоритмов",
        "isCorrect": false
      },
      {
        "text": "Программного обеспечения",
        "isCorrect": false
      },
      {
        "text": "Конструкции (или компоновки)",
        "isCorrect": true
      },
      {
        "text": "Сигналов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 491,
    "question": "Что осуществляется для уменьшения мощности побочных излучений?",
    "answers": [
      {
        "text": "Увеличение мощности сигналов",
        "isCorrect": false
      },
      {
        "text": "Использование неэкранированных кабелей",
        "isCorrect": false
      },
      {
        "text": "Снижение уровня сигналов и уменьшение скоростей их нарастания и спада",
        "isCorrect": true
      },
      {
        "text": "Увеличение длины шин",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 492,
    "question": "Пассивные методы защиты от ПЭМИН подразделяются на:",
    "answers": [
      {
        "text": "снижение мощности излучений и наводок",
        "isCorrect": false
      },
      {
        "text": "экранирование",
        "isCorrect": true
      },
      {
        "text": "снижение информативности сигналов",
        "isCorrect": false
      },
      {
        "text": "изменение конструкций",
        "isCorrect": false
      },
      {
        "text": "изменение блоков.",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 493,
    "question": "Это зашумление осуществляется за счет излучения с помощью антенн электромагнитных сигналов в пространство.",
    "answers": [
      {
        "text": "Линейное зашумление",
        "isCorrect": false
      },
      {
        "text": "Пространственное зашумление",
        "isCorrect": true
      },
      {
        "text": "Временное зашумление",
        "isCorrect": false
      },
      {
        "text": "Программное зашумление",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 494,
    "question": "Локальное пространственное зашумление применяется для ……..",
    "answers": [
      {
        "text": "Защиты от ПЭМИН всего объекта",
        "isCorrect": false
      },
      {
        "text": "Защиты линий электропитания",
        "isCorrect": false
      },
      {
        "text": "Защиты отдельных устройств или небольших групп устройств",
        "isCorrect": true
      },
      {
        "text": "Защиты кабельных каналов всего здания",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 495,
    "question": "Это зашумление используется для защиты от побочных электромагнитных излучений КС всего объекта.",
    "answers": [
      {
        "text": "Локальное линейное зашумление",
        "isCorrect": false
      },
      {
        "text": "Целевое зашумление",
        "isCorrect": false
      },
      {
        "text": "Общее пространственное зашумление",
        "isCorrect": true
      },
      {
        "text": "Индивидуальное экранирование",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 496,
    "question": "При использовании ……………… генераторы прицельных помех подключаются к токопроводящим линиям для создания в них электрических помех, которые не позволяют злоумышленникам выделять наведенные сигналы.",
    "answers": [
      {
        "text": "Пространственного зашумления",
        "isCorrect": false
      },
      {
        "text": "Линейного зашумления",
        "isCorrect": true
      },
      {
        "text": "Локального экранирования",
        "isCorrect": false
      },
      {
        "text": "Временного маскирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 497,
    "question": "Это зашумление должно обеспечивать невозможность выделения побочных излучений на фоне создаваемых помех во всех диапазонах излучения и, вместе с тем, уровень создаваемых помех не должен превышать санитарных норм и норм по электромагнитной совместимости радиоэлектронной аппаратуры.",
    "answers": [
      {
        "text": "Активное зашумление",
        "isCorrect": true
      },
      {
        "text": "Пассивное экранирование",
        "isCorrect": false
      },
      {
        "text": "Конструктивная защита",
        "isCorrect": false
      },
      {
        "text": "Программная маскировка",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 498,
    "question": "Это зашумление осуществляется, как правило, несколькими генераторами со своими антеннами, что позволяет создавать помехи во всех диапазонах побочных электромагнитных излучений всех излучающих устройств объекта.",
    "answers": [
      {
        "text": "Локальное линейное зашумление",
        "isCorrect": false
      },
      {
        "text": "Индивидуальное экранирование",
        "isCorrect": false
      },
      {
        "text": "Общее пространственное зашумление",
        "isCorrect": true
      },
      {
        "text": "Целевое подавление",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 499,
    "question": "Экранирование осуществляется на пяти уровнях:",
    "answers": [
      {
        "text": "уровень элементов схем",
        "isCorrect": true
      },
      {
        "text": "уровень тестирования",
        "isCorrect": false
      },
      {
        "text": "уровень блоков",
        "isCorrect": true
      },
      {
        "text": "уровень помещений",
        "isCorrect": true
      },
      {
        "text": "уровень кабельных линий",
        "isCorrect": true
      },
      {
        "text": "уровень устройств",
        "isCorrect": true
      },
      {
        "text": "уровень устойчивости",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 500,
    "question": "Полностью исключается попадание побочных наведенных сигналов во внешнюю цепь электропитания при наличии генераторов питания, которые обеспечивают …………………… между первичной и вторичной цепями.",
    "answers": [
      {
        "text": "Электромагнитную связь",
        "isCorrect": false
      },
      {
        "text": "Прямое соединение",
        "isCorrect": false
      },
      {
        "text": "Гальваническую развязку",
        "isCorrect": true
      },
      {
        "text": "Общую шину заземления",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 501,
    "question": "Выбор числа уровней и материалов экранирования осуществляется с учетом:",
    "answers": [
      {
        "text": "минимизации затрат на экранирование",
        "isCorrect": false
      },
      {
        "text": "наличия или отсутствия других методов защиты от ПЭМИН",
        "isCorrect": false
      },
      {
        "text": "требований к уровню излучения за пределами контролируемой зоны и размеров зоны",
        "isCorrect": true
      },
      {
        "text": "характеристик излучения (тип, частота и мощность)",
        "isCorrect": true
      },
      {
        "text": "использование фильтров.",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 502,
    "question": "Какой из основных принципов является общим при разработке алгоритмов, программ и аппаратных средств?",
    "answers": [
      {
        "text": "Принцип максимальной сложности",
        "isCorrect": false
      },
      {
        "text": "Принцип независимости разработки и тестирования",
        "isCorrect": true
      },
      {
        "text": "Принцип использования только закрытых стандартов",
        "isCorrect": false
      },
      {
        "text": "Принцип минимизации затрат любой ценой",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 503,
    "question": "Этот принцип предполагает поэтапное выявление ошибок и закладок определенного класса.",
    "answers": [
      {
        "text": "Принцип открытого кода",
        "isCorrect": false
      },
      {
        "text": "Принцип многослойной «фильтрации»",
        "isCorrect": true
      },
      {
        "text": "Принцип «безопасность через неясность»",
        "isCorrect": false
      },
      {
        "text": "Принцип тотальной автоматизации",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 504,
    "question": "Под ………………. разработки алгоритма программы или устройства понимается независимая (возможно разными организациями) разработка одного и того же блока.",
    "answers": [
      {
        "text": "Агильной разработкой",
        "isCorrect": false
      },
      {
        "text": "Модульным программированием",
        "isCorrect": false
      },
      {
        "text": "Двойным программированием",
        "isCorrect": true
      },
      {
        "text": "Объектно-ориентированным программированием",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 505,
    "question": "Это средство является универсальным для проверки, как адекватности, так и работоспособности блоков.",
    "answers": [
      {
        "text": "Отладчик",
        "isCorrect": false
      },
      {
        "text": "Автоматизированный контрольно-испытательный стенд",
        "isCorrect": true
      },
      {
        "text": "Система управления версиями",
        "isCorrect": false
      },
      {
        "text": "Текстовый редактор",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 506,
    "question": "Для разработки программных средств, свободных от ошибок и закладок, необходимо выполнение одного из условий:",
    "answers": [
      {
        "text": "наличие автоматизированной системы разработки",
        "isCorrect": true
      },
      {
        "text": "использование современных технологий программирования",
        "isCorrect": false
      },
      {
        "text": "использование фильтров",
        "isCorrect": false
      },
      {
        "text": "наличие автоматизированных контрольно-испытательных стендов",
        "isCorrect": false
      },
      {
        "text": "принцип многослойной «фильтрации»",
        "isCorrect": false
      },
      {
        "text": "представление готовых программ на языках высокого уровня",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 507,
    "question": "Что является одним из центральных понятий ООП?",
    "answers": [
      {
        "text": "Процедурное программирование",
        "isCorrect": false
      },
      {
        "text": "Инкапсуляция",
        "isCorrect": true
      },
      {
        "text": "Использование оператора безусловного перехода (goto)",
        "isCorrect": false
      },
      {
        "text": "Глобальные переменные",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 508,
    "question": "Данная система создается на базе локальной вычислительной сети.",
    "answers": [
      {
        "text": "Автономная ЭВМ",
        "isCorrect": false
      },
      {
        "text": "Распределенная система",
        "isCorrect": true
      },
      {
        "text": "Встраиваемая система",
        "isCorrect": false
      },
      {
        "text": "Большая ЭВМ (мейнфрейм)",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 509,
    "question": "Какие рабочие станции входят в состав ЛВС?",
    "answers": [
      {
        "text": "Только большие ЭВМ (мейнфреймы)",
        "isCorrect": false
      },
      {
        "text": "Только сетевые принтеры",
        "isCorrect": false
      },
      {
        "text": "Серверы и автоматизированные рабочие места (АРМ)",
        "isCorrect": true
      },
      {
        "text": "Только мобильные устройства",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 510,
    "question": "Что является одним из наиболее эффективных путей обнаружения закладок и ошибок в разрабатываемых программных средствах?",
    "answers": [
      {
        "text": "Самостоятельное тестирование разработчиком",
        "isCorrect": false
      },
      {
        "text": "Комплексное тестирование на специализированных стендах независимыми группами",
        "isCorrect": true
      },
      {
        "text": "Полное доверие к компилятору",
        "isCorrect": false
      },
      {
        "text": "Использование только простых алгоритмов",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 511,
    "question": "Данный модуль учитывает возможные угрозы, ограничения на входную информацию и результаты тестирования на предыдущем шаге.",
    "answers": [
      {
        "text": "Модуль ввода данных",
        "isCorrect": false
      },
      {
        "text": "Контроллер (или модуль управления)",
        "isCorrect": true
      },
      {
        "text": "Модуль генерации отчетов",
        "isCorrect": false
      },
      {
        "text": "База данных",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 512,
    "question": "Под доступом к оборудованию понимается",
    "answers": [
      {
        "text": "Визуальный осмотр оборудования",
        "isCorrect": false
      },
      {
        "text": "Ознакомление с технической документацией",
        "isCorrect": false
      },
      {
        "text": "Процесс взаимодействия субъекта (пользователя) с оборудованием",
        "isCorrect": true
      },
      {
        "text": "Знание стоимости оборудования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 513,
    "question": "При организации доступа к оборудованию пользователей, операторов, администраторов выполняются следующие действия:",
    "answers": [
      {
        "text": "идентификация и аутентификация субъекта доступа",
        "isCorrect": true
      },
      {
        "text": "разграничение доступа",
        "isCorrect": true
      },
      {
        "text": "разблокирование устройства",
        "isCorrect": false
      },
      {
        "text": "охрана помещений",
        "isCorrect": false
      },
      {
        "text": "ведение журнала учета действий субъекта доступа.",
        "isCorrect": true
      }
    ]
  },
  {
    "id": 514,
    "question": "Для идентификации субъекта доступа в КС чаще всего используются атрибутивные идентификаторы. Выберите правильный ответ:",
    "answers": [
      {
        "text": "пароли",
        "isCorrect": true
      },
      {
        "text": "ключи",
        "isCorrect": false
      },
      {
        "text": "механические ключи",
        "isCorrect": false
      },
      {
        "text": "сетчатка глаз",
        "isCorrect": false
      },
      {
        "text": "электронные жетоны",
        "isCorrect": false
      },
      {
        "text": "отпечатки рук.",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 515,
    "question": "Этот прибор вырабатывает псевдослучайную буквенно-цифровую последовательность (слово).",
    "answers": [
      {
        "text": "Сканер штрих-кодов",
        "isCorrect": false
      },
      {
        "text": "Генератор паролей",
        "isCorrect": true
      },
      {
        "text": "Калькулятор хэш-функций",
        "isCorrect": false
      },
      {
        "text": "Устройство для считывания биометрии",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 516,
    "question": "Под ……………….. понимается процедура получения контрольной характеристики двоичной последовательности, основанная на контрольном суммировании и криптографических преобразованиях.",
    "answers": [
      {
        "text": "Шифрованием",
        "isCorrect": false
      },
      {
        "text": "Архивацией",
        "isCorrect": false
      },
      {
        "text": "Хэшированием",
        "isCorrect": true
      },
      {
        "text": "Помехоустойчивым кодированием",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 517,
    "question": "Итерационный процесс вычисления хэш-функции Н предусматривает:",
    "answers": [
      {
        "text": "дублирование информации",
        "isCorrect": false
      },
      {
        "text": "генерацию четырех ключей (слов длиной 256 бит)",
        "isCorrect": false
      },
      {
        "text": "перемешивание результатов",
        "isCorrect": true
      },
      {
        "text": "отладку информации",
        "isCorrect": false
      },
      {
        "text": "поразрядное суммирование по mod2 слов длиной 256 бит исходной последовательности",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 518,
    "question": "Стартовый вектор кэширования представляет собой двоичную последовательность длиной",
    "answers": [
      {
        "text": "8 бит (1 байт)",
        "isCorrect": false
      },
      {
        "text": "Равной размеру блока используемого алгоритма (например, 128 бит)",
        "isCorrect": true
      },
      {
        "text": "Переменной длины",
        "isCorrect": false
      },
      {
        "text": "Равной длине всего сообщения",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 519,
    "question": "Одним из возможных путей несанкционированного изменения технической структуры КС является подключение незарегистрированных устройств или замена ими штатных средств КС. Для парирования такой угрозы используются следующие методы:",
    "answers": [
      {
        "text": "проверка особенностей устройства",
        "isCorrect": false
      },
      {
        "text": "разграничение доступа к оборудованию",
        "isCorrect": true
      },
      {
        "text": "охрана помещений, в которых находятся аппаратные средства КС",
        "isCorrect": true
      },
      {
        "text": "использование идентификаторов устройств",
        "isCorrect": true
      },
      {
        "text": "идентификация и аутентификация субъекта доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 520,
    "question": "Злоумышленник осуществляет несанкционированный доступ к информации, используя:",
    "answers": [
      {
        "text": "сведения о системе защиты информации",
        "isCorrect": true
      },
      {
        "text": "знания о КС и умение работать с ней",
        "isCorrect": true
      },
      {
        "text": "сбои, отказы технических и программных средств",
        "isCorrect": false
      },
      {
        "text": "ошибки, небрежность обслуживающего персонала и пользователей",
        "isCorrect": true
      },
      {
        "text": "сведения общедоступной информации о предприятии.",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 521,
    "question": "Для защиты информации от несанкционированного доступа создается:",
    "answers": [
      {
        "text": "Система управления базами данных",
        "isCorrect": false
      },
      {
        "text": "Система защиты от несанкционированного доступа (СЗ НСД)",
        "isCorrect": true
      },
      {
        "text": "Локальная вычислительная сеть",
        "isCorrect": false
      },
      {
        "text": "Офисный пакет программ",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 522,
    "question": "Система защиты информации от несанкционированного доступа включает в себя подсистемы:",
    "answers": [
      {
        "text": "Только межсетевой экран",
        "isCorrect": false
      },
      {
        "text": "Только антивирусный монитор",
        "isCorrect": false
      },
      {
        "text": "Подсистемы идентификации и аутентификации, разграничения доступа, регистрации и учета",
        "isCorrect": true
      },
      {
        "text": "Только систему резервного копирования",
        "isCorrect": false
      }
    ]
  },
  {
    "id": 523,
    "question": "Правило разграничения доступа заключается в следующем: лицо допускается к работе с документом только в том случае, если…….?",
    "answers": [
      {
        "text": "Пользователь является другом автора документа",
        "isCorrect": false
      },
      {
        "text": "Документ хранится на локальном диске компьютера",
        "isCorrect": false
      },
      {
        "text": "Уровень допуска лица не ниже уровня грифа секретности документа",
        "isCorrect": true
      },
      {
        "text": "Пользователь выразил желание работать с документом",
        "isCorrect": false
      }
    ]
  }
];
