// Инновационные технологии (новые вопросы)
// Сгенерировано автоматически: 29.12.2025, 19:17:56
// Всего вопросов: 486

const innovationQuestionsNew = [
  {
    "question": "Ценность информации оп­ределяется…",
    "answers": [
      {
        "text": "её весом",
        "isCorrect": false
      },
      {
        "text": "её адекватностью",
        "isCorrect": false
      },
      {
        "text": "её объемом",
        "isCorrect": false
      },
      {
        "text": "ее полнотой",
        "isCorrect": false
      },
      {
        "text": "степенью ее полезности для владельца",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Информация, хранящаяся, обрабатываемая в компьютерных системах рассматривается как…",
    "answers": [
      {
        "text": "предмет",
        "isCorrect": false
      },
      {
        "text": "объект",
        "isCorrect": false
      },
      {
        "text": "база защиты",
        "isCorrect": false
      },
      {
        "text": "предмет защиты",
        "isCorrect": true
      },
      {
        "text": "объект защиты",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Организация защиты информации -",
    "answers": [
      {
        "text": "степень соответствия результатов защиты информации поставленной цели.",
        "isCorrect": false
      },
      {
        "text": "желаемый результат защиты информации.",
        "isCorrect": false
      },
      {
        "text": "совокупность правил доступа к информации",
        "isCorrect": false
      },
      {
        "text": "мера или характеристика для оценки эффективности защиты информации.",
        "isCorrect": false
      },
      {
        "text": "содержание и порядок действий по обеспечению защиты информации.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Для обозначения ценности конфиденциальной коммерческой информации используются три категории:",
    "answers": [
      {
        "text": "«Коммерческая тайна - не конфиденциально»; «коммерческая тайна  -  строго конфиденциально»;  «коммерческая тайна»;",
        "isCorrect": false
      },
      {
        "text": "«Коммерческая тайна - строго конфиденциально»; «коммерческая тайна - конфиденциально»; «коммерческая тайна»;",
        "isCorrect": true
      },
      {
        "text": "«Коммерческая тайна - секретно»; «коммерческая тайна - конфиденциально»; «коммерческая тайна»;",
        "isCorrect": false
      },
      {
        "text": "«Коммерческая тайна – конфиденциально»; «государственная тайна – строго секретно»;",
        "isCorrect": false
      },
      {
        "text": "«Коммерческая тайна»; «коммерческая тайна - конфиденциально»; «коммерческая тайна»;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерная сис­тема или автоматизированная система обработки данных (АСОД)- является…",
    "answers": [
      {
        "text": "субъектом защиты информации",
        "isCorrect": false
      },
      {
        "text": "средством защиты информации",
        "isCorrect": false
      },
      {
        "text": "технологией защиты информации",
        "isCorrect": false
      },
      {
        "text": "предметом защиты информации",
        "isCorrect": false
      },
      {
        "text": "объектом защиты информации",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации – это…",
    "answers": [
      {
        "text": "система защиты информации",
        "isCorrect": false
      },
      {
        "text": "база данных",
        "isCorrect": false
      },
      {
        "text": "база информации",
        "isCorrect": false
      },
      {
        "text": "компьютерная система",
        "isCorrect": true
      },
      {
        "text": "коммерческая система",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Зависимость ценности информации от времени приближенно оп­ределяется в соответствии с выражением:",
    "answers": [
      {
        "text": "C(t) = U0e-2.3t",
        "isCorrect": false
      },
      {
        "text": "C(t) = C0e2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(z) = Z0e-2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(t) = C0e-2.3t/",
        "isCorrect": true
      },
      {
        "text": "C(l) = C0e-2.3t/",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие  подходы существуют к измерению количества ин­формации?",
    "answers": [
      {
        "text": "практический подход, энтропийный подход, логический подход",
        "isCorrect": false
      },
      {
        "text": "энтропийный подход, логический подход",
        "isCorrect": false
      },
      {
        "text": "логический подход, тезаурусный подход",
        "isCorrect": false
      },
      {
        "text": "энтропийный подход, тезаурусный подход, практический подход",
        "isCorrect": true
      },
      {
        "text": "логический, тезаурусный, практический",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация, которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках, называется…",
    "answers": [
      {
        "text": "корректной",
        "isCorrect": false
      },
      {
        "text": "достоверной",
        "isCorrect": true
      },
      {
        "text": "сфабрикованной",
        "isCorrect": false
      },
      {
        "text": "нужной",
        "isCorrect": false
      },
      {
        "text": "правильной",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация  называется достоверной  …",
    "answers": [
      {
        "text": "которая может быть полезна только в реальном времени",
        "isCorrect": false
      },
      {
        "text": "которую невозможно проверить",
        "isCorrect": false
      },
      {
        "text": "которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках",
        "isCorrect": true
      },
      {
        "text": "которая с недостаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках",
        "isCorrect": false
      },
      {
        "text": "которую легко можно проверить",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как называется информация если она искажена умышленно?",
    "answers": [
      {
        "text": "неправильной",
        "isCorrect": false
      },
      {
        "text": "дезинформацией",
        "isCorrect": true
      },
      {
        "text": "некорректной",
        "isCorrect": false
      },
      {
        "text": "сфабрикованной",
        "isCorrect": false
      },
      {
        "text": "неполной",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какая из этих формул является формулой Шеннона?",
    "answers": [
      {
        "text": "I = N Pi log2Pi",
        "isCorrect": true
      },
      {
        "text": "I = M Pi log2Pi",
        "isCorrect": false
      },
      {
        "text": "I = N PJ log3PJ",
        "isCorrect": false
      },
      {
        "text": "J= N PJ log2PJ",
        "isCorrect": false
      },
      {
        "text": "I = N Pi lnPi",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Предметом защиты в КС является…",
    "answers": [
      {
        "text": "компьютерные сети",
        "isCorrect": false
      },
      {
        "text": "сигналы",
        "isCorrect": false
      },
      {
        "text": "средства связи",
        "isCorrect": false
      },
      {
        "text": "информация",
        "isCorrect": true
      },
      {
        "text": "данные",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "С помощью какого выражения определяется зависимость ценности информации от времени?",
    "answers": [
      {
        "text": "C(z) = Z0e-2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(t) = U0e-2.3t",
        "isCorrect": false
      },
      {
        "text": "C(t) = C0e-2.3t/",
        "isCorrect": true
      },
      {
        "text": "C(t) = C0e2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(l) = C0e-2.3t/",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерные системы относятся к классу…",
    "answers": [
      {
        "text": "автоматических систем",
        "isCorrect": false
      },
      {
        "text": "человеко-машинных систем.",
        "isCorrect": true
      },
      {
        "text": "глобальных вычислительных систем",
        "isCorrect": false
      },
      {
        "text": "автоматизированных систем",
        "isCorrect": false
      },
      {
        "text": "комплексных систем",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Целью создания любой КС является…",
    "answers": [
      {
        "text": "удовлетворение потреб­ностей администратора в своевременном получении достоверной информации и сохранении ее конфиденциальности (при необхо­димости)",
        "isCorrect": false
      },
      {
        "text": "удовлетворение потреб­ностей пользователей в своевременном изменении недостоверной информации и сохранении ее конфиденциальности (при необхо­димости)",
        "isCorrect": false
      },
      {
        "text": "удовлетворение потреб­ностей пользователей в несвоевременном получении недостоверной информации и сохранении ее конфиденциальности (при необхо­димости)",
        "isCorrect": false
      },
      {
        "text": "удовлетворение потреб­ностей пользователей в своевременном получении достоверной информации и сохранении ее конфиденциальности (при необхо­димости)",
        "isCorrect": true
      },
      {
        "text": "удовлетворение потреб­ностей пользователей в своевременном получении достоверной информации и сохранении ее платежеспособности (при необхо­димости)",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой подход предложил Шрейдер  к измерению количества ин­формации?",
    "answers": [
      {
        "text": "энтропийный",
        "isCorrect": false
      },
      {
        "text": "резидентный",
        "isCorrect": false
      },
      {
        "text": "тезаурусный",
        "isCorrect": true
      },
      {
        "text": "пассивный",
        "isCorrect": false
      },
      {
        "text": "криптостойкий",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерные системы, в которых обеспечивается безопасность информации, называются…",
    "answers": [
      {
        "text": "защищенными",
        "isCorrect": true
      },
      {
        "text": "традиционными",
        "isCorrect": false
      },
      {
        "text": "открытыми",
        "isCorrect": false
      },
      {
        "text": "закрытыми",
        "isCorrect": false
      },
      {
        "text": "незащищенными",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерная система это…",
    "answers": [
      {
        "text": "база информации",
        "isCorrect": false
      },
      {
        "text": "предмет информации",
        "isCorrect": false
      },
      {
        "text": "объект информации",
        "isCorrect": false
      },
      {
        "text": "предмет защиты информации",
        "isCorrect": false
      },
      {
        "text": "объект защиты информации",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Зависимость ценности информации от времени приближенно оп­ределяется в соответствии с выражением:",
    "answers": [
      {
        "text": "А(t) = C-2.3t/",
        "isCorrect": false
      },
      {
        "text": "А(t) = C0e-2.3t/t",
        "isCorrect": false
      },
      {
        "text": "TД = C0e-2.3t/t",
        "isCorrect": false
      },
      {
        "text": "А(t) = C0e-2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(t) = C0e-2.3t/",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Перечислите несколько подходов к измерению количества ин­формации?",
    "answers": [
      {
        "text": "Логический подход, тезаурусный подход, практический подход.",
        "isCorrect": false
      },
      {
        "text": "Энтропийный подход, логический подход, практический подход.",
        "isCorrect": false
      },
      {
        "text": "Логический подход, тезаурусный подход, энтропийный подход.",
        "isCorrect": false
      },
      {
        "text": "Практический, энтропийный подход, теоретический подход.",
        "isCorrect": false
      },
      {
        "text": "Энтропийный подход, тезаурусный подход, практический подход.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Объектом защиты информации является компьютерная…",
    "answers": [
      {
        "text": "доступность.",
        "isCorrect": false
      },
      {
        "text": "надежность.",
        "isCorrect": false
      },
      {
        "text": "система.",
        "isCorrect": true
      },
      {
        "text": "безопасность.",
        "isCorrect": false
      },
      {
        "text": "защита.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "… – это комплекс аппаратных и про­емных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации.",
    "answers": [
      {
        "text": "Компьютерная безопасность",
        "isCorrect": false
      },
      {
        "text": "Компьютерная надежность",
        "isCorrect": false
      },
      {
        "text": "Компьютерная доступность",
        "isCorrect": false
      },
      {
        "text": "Компьютерная система",
        "isCorrect": true
      },
      {
        "text": "Компьютерная защита",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "...  рассматривается как информация, хранящаяся, обрабатываемая в компьютерных системах",
    "answers": [
      {
        "text": "База защиты",
        "isCorrect": false
      },
      {
        "text": "Объект",
        "isCorrect": false
      },
      {
        "text": "Предмет",
        "isCorrect": false
      },
      {
        "text": "Предмет защиты",
        "isCorrect": true
      },
      {
        "text": "Объект защиты",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Дайте понятие организации защиты информации",
    "answers": [
      {
        "text": "мера или характеристика для оценки эффективности защиты информации.",
        "isCorrect": false
      },
      {
        "text": "степень соответствия результатов защиты информации поставленной цели.",
        "isCorrect": false
      },
      {
        "text": "совокупность правил доступа к информации",
        "isCorrect": false
      },
      {
        "text": "желаемый результат защиты информации.",
        "isCorrect": false
      },
      {
        "text": "содержание и порядок действий по обеспечению защиты информации.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Компьютерная сис­тема или автоматизированная система обработки данных является…",
    "answers": [
      {
        "text": "предметом защиты информации",
        "isCorrect": false
      },
      {
        "text": "объектом защиты информации",
        "isCorrect": true
      },
      {
        "text": "технологией защиты информации",
        "isCorrect": false
      },
      {
        "text": "средством защиты информации",
        "isCorrect": false
      },
      {
        "text": "субъектом защиты информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "… - это комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации.",
    "answers": [
      {
        "text": "Коммерческая система",
        "isCorrect": false
      },
      {
        "text": "База информации",
        "isCorrect": false
      },
      {
        "text": "Система защиты информации",
        "isCorrect": false
      },
      {
        "text": "База данных",
        "isCorrect": false
      },
      {
        "text": "Компьютерная система",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Единый комплекс правовых норм, организационных мер, технических, программных и криптографических средств, обеспечивающих, защищенность  информации называется …",
    "answers": [
      {
        "text": "доступом защиты информации",
        "isCorrect": false
      },
      {
        "text": "системой защиты информации",
        "isCorrect": true
      },
      {
        "text": "объектом защиты информации",
        "isCorrect": false
      },
      {
        "text": "база данных",
        "isCorrect": false
      },
      {
        "text": "предметом защиты информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Техническое, программное средство, вещество и/или материал, предназначенные или используемые для защиты информации это …",
    "answers": [
      {
        "text": "субъект защиты информации",
        "isCorrect": false
      },
      {
        "text": "организация  защиты информации",
        "isCorrect": false
      },
      {
        "text": "средство защиты информации",
        "isCorrect": true
      },
      {
        "text": "объект защиты информации",
        "isCorrect": false
      },
      {
        "text": "нет верных ответов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация хранится и передается на:",
    "answers": [
      {
        "text": "материальных носите­лях.",
        "isCorrect": true
      },
      {
        "text": "только на дисках",
        "isCorrect": false
      },
      {
        "text": "только на дискетах",
        "isCorrect": false
      },
      {
        "text": "только на магнитных дисках",
        "isCorrect": false
      },
      {
        "text": "только на бумаге",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Если доступ к информации ограничивается, то такая информация является…",
    "answers": [
      {
        "text": "общедоступной",
        "isCorrect": false
      },
      {
        "text": "групповой",
        "isCorrect": false
      },
      {
        "text": "конфиденциальной.",
        "isCorrect": true
      },
      {
        "text": "личной",
        "isCorrect": false
      },
      {
        "text": "общественной",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информации не присущи следующие свойства:",
    "answers": [
      {
        "text": "Информация покупается и продается.",
        "isCorrect": false
      },
      {
        "text": "Информация имеет ценность.",
        "isCorrect": false
      },
      {
        "text": "Ценность информации изменяется во времени.",
        "isCorrect": false
      },
      {
        "text": "Информация доступна человеку, если она содержится на материальном носителе.",
        "isCorrect": false
      },
      {
        "text": "Параметры информации можно измерить физическими методами и приборами",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Комплекс аппаратных и про­граммных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации - это:",
    "answers": [
      {
        "text": "принтер",
        "isCorrect": false
      },
      {
        "text": "компьютерная система",
        "isCorrect": true
      },
      {
        "text": "сеть Интернет",
        "isCorrect": false
      },
      {
        "text": "компьютер",
        "isCorrect": false
      },
      {
        "text": "сканер",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под еди­ным комплексом правовых норм, организационных мер, техниче­ских, программных и криптографических средств, обеспечиваю­щий защищенность информации в КС в соответствии с принятой политикой безопасности понимается:",
    "answers": [
      {
        "text": "предмет защиты",
        "isCorrect": false
      },
      {
        "text": "компьютерная система",
        "isCorrect": false
      },
      {
        "text": "система защиты информации",
        "isCorrect": true
      },
      {
        "text": "объект защиты",
        "isCorrect": false
      },
      {
        "text": "защита информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Существующие  подходы к измерению количества ин­формации?",
    "answers": [
      {
        "text": "Логический подход, тезаурусный подход, практический подход.",
        "isCorrect": false
      },
      {
        "text": "Логический подход, тезаурусный подход, энтропийный подход.",
        "isCorrect": false
      },
      {
        "text": "Энтропийный подход, логический подход, практический подход.",
        "isCorrect": false
      },
      {
        "text": "Практический, энтропийный подход, теоретический подход.",
        "isCorrect": false
      },
      {
        "text": "Энтропийный подход, тезаурусный подход, практический подход.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Достоверной называется такая информация…",
    "answers": [
      {
        "text": "которая с недостаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках",
        "isCorrect": false
      },
      {
        "text": "которую легко можно проверить",
        "isCorrect": false
      },
      {
        "text": "которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках",
        "isCorrect": true
      },
      {
        "text": "которую невозможно проверить",
        "isCorrect": false
      },
      {
        "text": "которая может быть полезна только в реальном времени",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Искаженную информацию называют…",
    "answers": [
      {
        "text": "некорректной",
        "isCorrect": false
      },
      {
        "text": "дезинформацией",
        "isCorrect": true
      },
      {
        "text": "неправильной",
        "isCorrect": false
      },
      {
        "text": "сфабрикованной",
        "isCorrect": false
      },
      {
        "text": "неполной",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация, которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках, называется…",
    "answers": [
      {
        "text": "достоверной",
        "isCorrect": true
      },
      {
        "text": "актуальной",
        "isCorrect": false
      },
      {
        "text": "неправильной",
        "isCorrect": false
      },
      {
        "text": "некорректной",
        "isCorrect": false
      },
      {
        "text": "дезориентирующей",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какая  информация называется достоверной?",
    "answers": [
      {
        "text": "которая с достаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках",
        "isCorrect": true
      },
      {
        "text": "которую легко можно проверить",
        "isCorrect": false
      },
      {
        "text": "которая может быть полезна только в реальном времени",
        "isCorrect": false
      },
      {
        "text": "которую невозможно проверить",
        "isCorrect": false
      },
      {
        "text": "которая с недостаточной для владельца точностью отражает объекты и процессы окружающего фактора в определенных временных и пространственных рамках",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Степенью полезности информации для владельца определяется ее ...",
    "answers": [
      {
        "text": "достоверность",
        "isCorrect": false
      },
      {
        "text": "ценность",
        "isCorrect": true
      },
      {
        "text": "количество",
        "isCorrect": false
      },
      {
        "text": "актуальность",
        "isCorrect": false
      },
      {
        "text": "надежность",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "… - называется информация которая  искажена умышленно.",
    "answers": [
      {
        "text": "дезинформацией",
        "isCorrect": true
      },
      {
        "text": "сфабрикованной",
        "isCorrect": false
      },
      {
        "text": "неправильной",
        "isCorrect": false
      },
      {
        "text": "неполной",
        "isCorrect": false
      },
      {
        "text": "некорректной",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Дезинформацией называется …",
    "answers": [
      {
        "text": "неискаженная информация",
        "isCorrect": false
      },
      {
        "text": "неумышленно искаженная информация",
        "isCorrect": false
      },
      {
        "text": "избранная информация",
        "isCorrect": false
      },
      {
        "text": "умышленно искаженная информация",
        "isCorrect": true
      },
      {
        "text": "выборочная информация",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под угрозой безопасности информации понимается…",
    "answers": [
      {
        "text": "потен­циально возможное событие, процесс или явление, которые могут привести к уничтожению, утрате целостности, конфиденциально­сти или доступности информации.",
        "isCorrect": true
      },
      {
        "text": "комплекс аппаратных и про­емных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации",
        "isCorrect": false
      },
      {
        "text": "высокая степень автоматизации обработки и передачи ин­формации",
        "isCorrect": false
      },
      {
        "text": "представление информации внутри системы, не­ зависимо от физической сущности носителей исходной информации:",
        "isCorrect": false
      },
      {
        "text": "представление информации внутри системы, обработки и передачи ин­формации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют…",
    "answers": [
      {
        "text": "преднамеренными",
        "isCorrect": false
      },
      {
        "text": "системными",
        "isCorrect": false
      },
      {
        "text": "конфиденциальными",
        "isCorrect": false
      },
      {
        "text": "случайными",
        "isCorrect": true
      },
      {
        "text": "временными",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угрозы безопасности информации в КС делятся на:",
    "answers": [
      {
        "text": "временные угрозы и предметные угрозы",
        "isCorrect": false
      },
      {
        "text": "случайные угрозы и временные угрозы",
        "isCorrect": false
      },
      {
        "text": "случайные угрозы и предметные угрозы",
        "isCorrect": true
      },
      {
        "text": "предметные угрозы и  случайные угрозы",
        "isCorrect": false
      },
      {
        "text": "случайные угрозы, предметные угрозы, временные угрозы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В результате сбо­ев и отказов нарушается…",
    "answers": [
      {
        "text": "доступ к информации, связанный с действиями злоумышленников",
        "isCorrect": false
      },
      {
        "text": "алгоритм, связанный с действиями злоумышленников",
        "isCorrect": false
      },
      {
        "text": "данные, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени",
        "isCorrect": false
      },
      {
        "text": "работоспособность технических средств, уничтожаются и искажаются данные и программы, нарушается алгоритм работы устройств",
        "isCorrect": true
      },
      {
        "text": "информация, которая не связаны с преднамеренными действиями злоумышленников.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "«Логические бомбы» - это…",
    "answers": [
      {
        "text": "программы, полученные путем явного изменения или добавления команд в пользовательские програм­мы. При последующем выполнении пользовательских программ наряду с заданными функциями выполняются несанкционирован­ные, измененные или какие-то новые функции.",
        "isCorrect": false
      },
      {
        "text": "программы, которые выполняются ка­ждый раз при загрузке системы, обладают способностью переме­щаться в ВС или сети и самовоспроизводить копии. Лавинообраз­ное размножение программ приводит к перегрузке каналов связи, памяти и, в конечном итоге, к блокировке системы.",
        "isCorrect": false
      },
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем создания своих копий, а при выполнении определенных условий оказывают негативное воздействие на КС",
        "isCorrect": false
      },
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем изменения или добавления команд в пользовательские программы.",
        "isCorrect": false
      },
      {
        "text": "программы или их части, постоянно находящиеся в ЭВМ или вычислительных системах и выполняемые только при соблюдении определенных условий.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "«Червями» называются…",
    "answers": [
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем создания своих копий, а при выполнении определенных условий оказывают негативное воздействие на КС",
        "isCorrect": false
      },
      {
        "text": "программы, полученные путем явного изменения или добавления команд в пользовательские програм­мы. При последующем выполнении пользовательских программ наряду с заданными функциями выполняются несанкционирован­ные, измененные или какие-то новые функции.",
        "isCorrect": false
      },
      {
        "text": "программы, которые выполняются ка­ждый раз при загрузке системы, обладают способностью переме­щаться в ВС или сети и самовоспроизводить копии. Лавинообраз­ное размножение программ приводит к перегрузке каналов связи, памяти и, в конечном итоге, к блокировке системы.",
        "isCorrect": true
      },
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем изменения или добавления команд в пользовательские программы",
        "isCorrect": false
      },
      {
        "text": "программы или их части, постоянно находящиеся в ЭВМ или вычислительных системах и выполняемые только при соблюдении определенных условий",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "«Троянские кони» - это…",
    "answers": [
      {
        "text": "программы или их части, постоянно находящиеся в ЭВМ или вычислительных системах и выполняемые только при соблюдении определенных условий",
        "isCorrect": false
      },
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем изменения или добавления команд в пользовательские программы",
        "isCorrect": false
      },
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем создания своих копий, а при выполнении определенных условий оказывают негативное воздействие на КС",
        "isCorrect": false
      },
      {
        "text": "программы, которые выполняются ка­ждый раз при загрузке системы, обладают способностью переме­щаться в ВС или сети и самовоспроизводить копии. Лавинообраз­ное размножение программ приводит к перегрузке каналов связи, памяти и, в конечном итоге, к блокировке системы.",
        "isCorrect": false
      },
      {
        "text": "программы, полученные путем явного изменения или добавления команд в пользовательские програм­мы. При последующем выполнении пользовательских программ наряду с заданными функциями выполняются несанкционирован­ные, измененные или какие-то новые функции.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "«Компьютерные вирусы» - это…",
    "answers": [
      {
        "text": "небольшие программы, которые после внедрения в ЭВМ самостоятельно распространяются путем изменения или добавления команд в пользовательские программы",
        "isCorrect": false
      },
      {
        "text": "программы, которые выполняются ка­ждый раз при загрузке системы, обладают способностью переме­щаться в ВС или сети и самовоспроизводить копии. Лавинообразное размножение программ приводит к перегрузке каналов связи, памяти и, в конечном итоге, к блокировке системы.",
        "isCorrect": false
      },
      {
        "text": "программы или их части, постоянно находящиеся в ЭВМ или вычислительных системах и выполняемые только при соблюдении определенных условий",
        "isCorrect": false
      },
      {
        "text": "программы, полученные путем явного изменения или добавления команд в пользовательские програм­мы. При последующем выполнении пользовательских программ наряду с заданными функциями выполняются несанкционирован­ные, измененные или какие-то новые функции.",
        "isCorrect": false
      },
      {
        "text": "небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем создания своих копий, а при выполнении определенных условий оказывают негативное воздействие на КС",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Злоумышленником может быть…a) разработчик КС; b) сотрудник из числа обслуживающего персонала; c) пользователь; d) постороннее лицо e) уборщица.",
    "answers": [
      {
        "text": "b, c, d, e",
        "isCorrect": false
      },
      {
        "text": "c, d, e",
        "isCorrect": false
      },
      {
        "text": "a, c, d, e",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d, e",
        "isCorrect": true
      },
      {
        "text": "a, c, d",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Несанкционированный доступ к информации возможен только с использованием штатных аппаратных и программных средств в следующем случае... a) отсутствует система разграничения доступа; b) сбой или отказ в КС, ошибки в СРД; c) ошибочные действия пользователей или обслуживающего персонала компьютерных систем; d) фальсификация полномочий",
    "answers": [
      {
        "text": "a, b, c, d,",
        "isCorrect": true
      },
      {
        "text": "c, d",
        "isCorrect": false
      },
      {
        "text": "a, c, d,",
        "isCorrect": false
      },
      {
        "text": "a, c,",
        "isCorrect": false
      },
      {
        "text": "b, c, d,",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Термин «несанкционированный доступ к информации» (НСДИ) определен как…",
    "answers": [
      {
        "text": "доступ к информации, нарушающий пра­вила разграничения доступа с использованием штатных средств вычислительной техники или автоматизированных систем",
        "isCorrect": true
      },
      {
        "text": "доступ к представлению информации внутри системы, обработки и передачи информации",
        "isCorrect": false
      },
      {
        "text": "доступ к данным, предназначенных для автоматизированного хранения, обработки, передачи и получения информации",
        "isCorrect": false
      },
      {
        "text": "доступ к данным, нарушающий правила разграничения доступа с использованием штатных средств вычислительной техники или автоматизированных систем",
        "isCorrect": false
      },
      {
        "text": "представление информации внутри системы, не­ зависимо от физической сущности носителей исходной информации:",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под правилами разграничения доступа понимается…",
    "answers": [
      {
        "text": "доступ к информации, нарушающий пра­вила разграничения доступа с использованием штатных средств вычислительной техники или автоматизированных систем",
        "isCorrect": false
      },
      {
        "text": "совокупность положений, предназначенных для автоматизированного хранения, обработки, передачи и получения информации",
        "isCorrect": false
      },
      {
        "text": "доступ к данным, нарушающий пра­вила разграничения доступа с использованием штатных средств вычислительной техники или автоматизированных систем",
        "isCorrect": false
      },
      {
        "text": "совокупность положений, регламентирующих права доступа лиц или про­цессов (субъектов доступа) к единицам информации (объектам доступа).",
        "isCorrect": true
      },
      {
        "text": "доступ к данным, предназначенных для автоматизированного хранения, обработки, передачи и получения информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электромагнитные излучения используются злоумышленни­ками не только для получения информации, но и для ее…",
    "answers": [
      {
        "text": "пользования",
        "isCorrect": false
      },
      {
        "text": "уничтожения",
        "isCorrect": true
      },
      {
        "text": "системы",
        "isCorrect": false
      },
      {
        "text": "обслуживающего персонала",
        "isCorrect": false
      },
      {
        "text": "разработки",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электромагнитные импульсы способны уничтожить ин­формацию на…",
    "answers": [
      {
        "text": "магнитных лентах",
        "isCorrect": false
      },
      {
        "text": "принтере",
        "isCorrect": false
      },
      {
        "text": "DVD-дисках",
        "isCorrect": false
      },
      {
        "text": "CD-дисках",
        "isCorrect": false
      },
      {
        "text": "магнитных носителях",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Стетоскопные микрофоны  позволяют прослушивать разговоры при толщине стен до…",
    "answers": [
      {
        "text": "100-150 см",
        "isCorrect": false
      },
      {
        "text": "250-300 см",
        "isCorrect": false
      },
      {
        "text": "200-250 см",
        "isCorrect": false
      },
      {
        "text": "150-200 см",
        "isCorrect": false
      },
      {
        "text": "50-100 см",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Реальное расстояние подслушивания с помощью направленных микрофонов составляет…",
    "answers": [
      {
        "text": "100-150 метров",
        "isCorrect": false
      },
      {
        "text": "250-300 метров",
        "isCorrect": false
      },
      {
        "text": "150-200 метров",
        "isCorrect": false
      },
      {
        "text": "200-250 метров",
        "isCorrect": false
      },
      {
        "text": "50-100 метров",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Обеспечение безопасности инфор­мации в КС должно предусматривать…",
    "answers": [
      {
        "text": "защиту данных",
        "isCorrect": false
      },
      {
        "text": "обеспечение безопасности  машинных носителей информации",
        "isCorrect": false
      },
      {
        "text": "защиту всех компонент от внешних и внутренних воздействий (угроз)",
        "isCorrect": true
      },
      {
        "text": "защиту безопасности информации",
        "isCorrect": false
      },
      {
        "text": "защиту документов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Радиозакладки, рассчитаны на работу в диапазоне расстояния…",
    "answers": [
      {
        "text": "25-800 метров",
        "isCorrect": false
      },
      {
        "text": "50-800 метров",
        "isCorrect": true
      },
      {
        "text": "20-800 метров",
        "isCorrect": false
      },
      {
        "text": "15-800 метров",
        "isCorrect": false
      },
      {
        "text": "10-800 метров",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Радиозакладки, могут использовать в качестве источника…",
    "answers": [
      {
        "text": "акустического источника",
        "isCorrect": false
      },
      {
        "text": "сигнала радио",
        "isCorrect": false
      },
      {
        "text": "источника радио",
        "isCorrect": false
      },
      {
        "text": "электрические сигналы",
        "isCorrect": true
      },
      {
        "text": "тока",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют",
    "answers": [
      {
        "text": "нормальными",
        "isCorrect": false
      },
      {
        "text": "вредными",
        "isCorrect": false
      },
      {
        "text": "случайными",
        "isCorrect": true
      },
      {
        "text": "средними",
        "isCorrect": false
      },
      {
        "text": "специальными",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Этот термин  определен как доступ к информации, нарушающий пра­вила разграничения доступа с использованием штатных средств вычислительной техники или автоматизированных систем:",
    "answers": [
      {
        "text": "прямой доступ",
        "isCorrect": false
      },
      {
        "text": "коллективный доступ",
        "isCorrect": false
      },
      {
        "text": "несанкционированный доступ к информации",
        "isCorrect": true
      },
      {
        "text": "разрешенный доступ",
        "isCorrect": false
      },
      {
        "text": "косвенный доступ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Кто определяет право доступа к ресурсам КС?",
    "answers": [
      {
        "text": "Определяется партнером по работе",
        "isCorrect": false
      },
      {
        "text": "Руководство для каждого сотрудника в соответствии с его функциональными обя­занностями.",
        "isCorrect": true
      },
      {
        "text": "Никем не определяется",
        "isCorrect": false
      },
      {
        "text": "Администрация фирмы",
        "isCorrect": false
      },
      {
        "text": "Определяется самим пользователем",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Не представляет большую угрозу безопасности информации в КС:",
    "answers": [
      {
        "text": "смена температуры воздуха",
        "isCorrect": true
      },
      {
        "text": "косвенная модификация",
        "isCorrect": false
      },
      {
        "text": "прямая модификация системы",
        "isCorrect": false
      },
      {
        "text": "несанкционированная модификация алгоритмической, про­граммной и технической структур системы",
        "isCorrect": false
      },
      {
        "text": "групповой доступ к информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Одним из основных источников угроз безопасности информации в КС является использование специальных программ, получивших общее название:",
    "answers": [
      {
        "text": "кодировщики",
        "isCorrect": false
      },
      {
        "text": "архиваторы",
        "isCorrect": false
      },
      {
        "text": "спецификаторы",
        "isCorrect": false
      },
      {
        "text": "вредные программы",
        "isCorrect": false
      },
      {
        "text": "вредительские программы",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Не относится к вредительским про­граммам-",
    "answers": [
      {
        "text": "«компьютерные вирусы»",
        "isCorrect": false
      },
      {
        "text": "«троянские кони»",
        "isCorrect": false
      },
      {
        "text": "«логические бомбы»",
        "isCorrect": false
      },
      {
        "text": "«черви»",
        "isCorrect": false
      },
      {
        "text": "«архиватор»",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Программы или их части, постоянно находящиеся в ЭВМ или вычислительных системах и выполняемые только при соблюдении определенных условий - это:",
    "answers": [
      {
        "text": "«Червями»",
        "isCorrect": false
      },
      {
        "text": "«Компьютерные вирусы»",
        "isCorrect": false
      },
      {
        "text": "«Логические бомбы»",
        "isCorrect": true
      },
      {
        "text": "«Троянские кони»",
        "isCorrect": false
      },
      {
        "text": "«Архиваторы»",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Программы, которые выполняются ка­ждый раз при загрузке системы, обладают способностью переме­щаться в ВС или сети и самовоспроизводить копии, называются:",
    "answers": [
      {
        "text": "«Компьютерными вирусами»",
        "isCorrect": false
      },
      {
        "text": "«Червями»",
        "isCorrect": true
      },
      {
        "text": "«Спецификаторами»",
        "isCorrect": false
      },
      {
        "text": "«Троянскими конями»",
        "isCorrect": false
      },
      {
        "text": "«Логическими бомбами»",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Программы, полученные путем явного изменения или добавления команд в пользовательские програм­мы – это:",
    "answers": [
      {
        "text": "«Компьютерные вирусы»",
        "isCorrect": false
      },
      {
        "text": "«Черви»",
        "isCorrect": false
      },
      {
        "text": "«Спецификаторы»",
        "isCorrect": false
      },
      {
        "text": "«Логические бомбы»",
        "isCorrect": false
      },
      {
        "text": "«Троянские кони»",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Небольшие программы, кото­рые после внедрения в ЭВМ самостоятельно распространяются путем создания своих копий, а при выполнении определенных условий оказывают негативное воздействие на КС-это:",
    "answers": [
      {
        "text": "программы кодирования информации",
        "isCorrect": false
      },
      {
        "text": "компьютерные вирусы",
        "isCorrect": true
      },
      {
        "text": "программы сжатия информации",
        "isCorrect": false
      },
      {
        "text": "программы шифрования информации",
        "isCorrect": false
      },
      {
        "text": "антивирусные программы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Стихийные бедствия относятся к …",
    "answers": [
      {
        "text": "вероятным угрозам",
        "isCorrect": false
      },
      {
        "text": "возможным угрозам",
        "isCorrect": false
      },
      {
        "text": "неслучайным угрозам",
        "isCorrect": false
      },
      {
        "text": "случайным угрозам",
        "isCorrect": true
      },
      {
        "text": "преднамеренным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электромагнитные излучения и наводки относятся к …",
    "answers": [
      {
        "text": "случайным угрозам",
        "isCorrect": false
      },
      {
        "text": "возможным угрозам",
        "isCorrect": false
      },
      {
        "text": "неслучайным угрозам",
        "isCorrect": false
      },
      {
        "text": "технологическим угрозам",
        "isCorrect": false
      },
      {
        "text": "преднамеренным угрозам",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Несанкционированный доступ к информации относится к …",
    "answers": [
      {
        "text": "случайным угрозам",
        "isCorrect": false
      },
      {
        "text": "технологическим угрозам",
        "isCorrect": false
      },
      {
        "text": "возможным угрозам",
        "isCorrect": false
      },
      {
        "text": "преднамеренным угрозам",
        "isCorrect": true
      },
      {
        "text": "неслучайным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Сбои и отказы технических средств относятся к …",
    "answers": [
      {
        "text": "преднамеренным угрозам",
        "isCorrect": false
      },
      {
        "text": "случайным угрозам",
        "isCorrect": true
      },
      {
        "text": "техническим угрозам",
        "isCorrect": false
      },
      {
        "text": "неслучайным угрозам",
        "isCorrect": false
      },
      {
        "text": "непреднамеренным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Алгоритмические и программ­ные ошибки относятся к  …",
    "answers": [
      {
        "text": "случайным угрозам",
        "isCorrect": true
      },
      {
        "text": "техническим угрозам",
        "isCorrect": false
      },
      {
        "text": "неслучайным угрозам",
        "isCorrect": false
      },
      {
        "text": "непреднамеренным угрозам",
        "isCorrect": false
      },
      {
        "text": "преднамеренным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Стихийные бедствия  относятся…",
    "answers": [
      {
        "text": "к преднамеренным угрозам",
        "isCorrect": false
      },
      {
        "text": "к случайным угрозам",
        "isCorrect": true
      },
      {
        "text": "к вероятным угрозам",
        "isCorrect": false
      },
      {
        "text": "к непреднамеренным угрозам",
        "isCorrect": false
      },
      {
        "text": "к неслучайным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В зависимости от механизма действия вредительские про­граммы делятся на… a) «черви»; b)«троянские кони»; c)«компьютерные вирусы»; d) «логические бомбы»; e) «вредоносные события»",
    "answers": [
      {
        "text": "d, e, b, c",
        "isCorrect": false
      },
      {
        "text": "e, d, a, b",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d",
        "isCorrect": true
      },
      {
        "text": "e, d, c, а",
        "isCorrect": false
      },
      {
        "text": "a, c, e, d",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Комплексная система защиты информации создается на объектах для … всех возможных или, по крайней мере, наиболее вероятных угроз безопасности информации.",
    "answers": [
      {
        "text": "блокирования",
        "isCorrect": true
      },
      {
        "text": "копирования",
        "isCorrect": false
      },
      {
        "text": "создания",
        "isCorrect": false
      },
      {
        "text": "перемещения",
        "isCorrect": false
      },
      {
        "text": "удаления",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие методы защиты информации используются для блокирования (парирования) нескольких угроз?",
    "answers": [
      {
        "text": "Практические методы",
        "isCorrect": false
      },
      {
        "text": "Организационные методы",
        "isCorrect": true
      },
      {
        "text": "Правовые методы",
        "isCorrect": false
      },
      {
        "text": "Социальные методы",
        "isCorrect": false
      },
      {
        "text": "Общие методы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Правовой статус информации устанавливается с учетом ее … и степени достоверности, которую способ­на обеспечить компьютерная система.",
    "answers": [
      {
        "text": "единства",
        "isCorrect": false
      },
      {
        "text": "правильности",
        "isCorrect": false
      },
      {
        "text": "наглядности",
        "isCorrect": false
      },
      {
        "text": "общности",
        "isCorrect": false
      },
      {
        "text": "стоимости",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Важной составляющей правового регулирования в области информационных технологий является:",
    "answers": [
      {
        "text": "обеспечение ответственности граждан в образовательной системе государства",
        "isCorrect": false
      },
      {
        "text": "повышение уровня образования в образовательной системе государства",
        "isCorrect": false
      },
      {
        "text": "наказания за неправомерный доступ к компьютерной информации",
        "isCorrect": false
      },
      {
        "text": "установление ответственности граждан за противоправные действия при работе с КС",
        "isCorrect": true
      },
      {
        "text": "установление безответственности граждан за противоправные действия при работе с КС",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Преступления, совершенные с использованием КС или причинившие ущерб владельцам компьютерных систем, получили название … .",
    "answers": [
      {
        "text": "организационных преступлений",
        "isCorrect": false
      },
      {
        "text": "компьютерных преступлений",
        "isCorrect": true
      },
      {
        "text": "системных преступлений",
        "isCorrect": false
      },
      {
        "text": "программных преступлений",
        "isCorrect": false
      },
      {
        "text": "правовых преступлений",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По времени восстановления информации методы дублиро­вания могут быть разделены на…",
    "answers": [
      {
        "text": "сосредоточенные, рассредоточенные.",
        "isCorrect": false
      },
      {
        "text": "оперативные, неоперативные.",
        "isCorrect": true
      },
      {
        "text": "случайные, не случайные.",
        "isCorrect": false
      },
      {
        "text": "зеркальные, не зеркальные.",
        "isCorrect": false
      },
      {
        "text": "частичные, общие.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методы дублирования ин­формации, которые позволяют использовать дублирующую ин­формацию в реальном масштабе времени относятся к…",
    "answers": [
      {
        "text": "не оперативным методам.",
        "isCorrect": false
      },
      {
        "text": "организационным методам.",
        "isCorrect": false
      },
      {
        "text": "практическим методам.",
        "isCorrect": false
      },
      {
        "text": "случайным методам",
        "isCorrect": false
      },
      {
        "text": "оперативным методам.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Помехоустойчивое кодирование – это  …",
    "answers": [
      {
        "text": "использование устройств, блоков в качестве резервных.",
        "isCorrect": false
      },
      {
        "text": "свойство системы выполнять возложенные на нее задачи.",
        "isCorrect": false
      },
      {
        "text": "использование информационной избыточности.",
        "isCorrect": true
      },
      {
        "text": "надежность технических средств.",
        "isCorrect": false
      },
      {
        "text": "использование КС при отказах устройств.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В соответствии с процедурой дублирования различают ме­тоды:",
    "answers": [
      {
        "text": "простого, сложного, полного копирования.",
        "isCorrect": false
      },
      {
        "text": "Полного, зеркального, частичного, комбинированного копирования.",
        "isCorrect": true
      },
      {
        "text": "простого, сложного копирования.",
        "isCorrect": false
      },
      {
        "text": "частичного, комбинированного, не полного копирования.",
        "isCorrect": false
      },
      {
        "text": "сложного, зеркального, комбинированного копирования.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "При зеркальном копировании…",
    "answers": [
      {
        "text": "любые изменения основной информации сопровождаются  изменениями дублирующей информации.",
        "isCorrect": true
      },
      {
        "text": "допускаются комбинации полного и частичного копирования с перио­дичностью их проведения.",
        "isCorrect": false
      },
      {
        "text": "дублируются часть   файлов.",
        "isCorrect": false
      },
      {
        "text": "создаются дубли опре­деленных файлов.",
        "isCorrect": false
      },
      {
        "text": "создаются дубли только одного файла.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По виду дублирующей информации методы дубли­рования разделяются на…",
    "answers": [
      {
        "text": "частичного, не частичного копирования информации.",
        "isCorrect": false
      },
      {
        "text": "полного, не полного копирования информации.",
        "isCorrect": false
      },
      {
        "text": "методы со сжатием информации, методы без сжатия информации.",
        "isCorrect": true
      },
      {
        "text": "зеркального, не зеркального копирования информации.",
        "isCorrect": false
      },
      {
        "text": "комбинированного, не комбинированного копирования информации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Частичное копирование предполагает…",
    "answers": [
      {
        "text": "допущение комбинации",
        "isCorrect": false
      },
      {
        "text": "изменения основной информации с изменениями дублирую­щей информации.",
        "isCorrect": false
      },
      {
        "text": "создание дублей определенных файлов.",
        "isCorrect": true
      },
      {
        "text": "изменение дублируемой информации.",
        "isCorrect": false
      },
      {
        "text": "дублируются все файлы.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как называется жесткий магнитный диск отдельного накопителя, на котором хранится информация, полностью идентичная информации на рабочем диске?",
    "answers": [
      {
        "text": "магнитный.",
        "isCorrect": false
      },
      {
        "text": "Зеркальный.",
        "isCorrect": true
      },
      {
        "text": "съемный.",
        "isCorrect": false
      },
      {
        "text": "резервный.",
        "isCorrect": false
      },
      {
        "text": "не зеркальный.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Съемные машинные носители могут использоваться для дублирования информации…",
    "answers": [
      {
        "text": "с использованием специальных программных средств.",
        "isCorrect": false
      },
      {
        "text": "с использованием автоматического смены кассет.",
        "isCorrect": false
      },
      {
        "text": "с использованием специальных аппаратных средств.",
        "isCorrect": false
      },
      {
        "text": "без использования специальных аппаратных средств.",
        "isCorrect": true
      },
      {
        "text": "без использования автоматической смены кассет.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Любая отказоустойчивая система обладает:",
    "answers": [
      {
        "text": "кодированием.",
        "isCorrect": false
      },
      {
        "text": "избыточностью.",
        "isCorrect": true
      },
      {
        "text": "устойчивостью.",
        "isCorrect": false
      },
      {
        "text": "копированием.",
        "isCorrect": false
      },
      {
        "text": "резервированием.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для блокировки ошибочных действий используются…",
    "answers": [
      {
        "text": "технические, технологические, логические средства.",
        "isCorrect": false
      },
      {
        "text": "технологические и программные средства.",
        "isCorrect": false
      },
      {
        "text": "аппаратные, системные, логические средства.",
        "isCorrect": false
      },
      {
        "text": "технические и аппаратно – программные.",
        "isCorrect": true
      },
      {
        "text": "информационные, математические, арифметические средства.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Одним из наиболее простых и действенных путей создания отка­зоустойчивых систем является…",
    "answers": [
      {
        "text": "устойчивое кодирование.",
        "isCorrect": false
      },
      {
        "text": "устойчивое резервирование.",
        "isCorrect": false
      },
      {
        "text": "помехоустойчивое кодирование.",
        "isCorrect": false
      },
      {
        "text": "простое резервирование.",
        "isCorrect": true
      },
      {
        "text": "сложное резервирование.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какое кодирование основано на использовании информационной избыточности?",
    "answers": [
      {
        "text": "адаптивное кодирование.",
        "isCorrect": false
      },
      {
        "text": "устойчивое кодирование.",
        "isCorrect": false
      },
      {
        "text": "простое кодирование.",
        "isCorrect": false
      },
      {
        "text": "сложное кодирование.",
        "isCorrect": false
      },
      {
        "text": "Помехоустойчивое кодирование.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Какое резервирование основано на использовании устройств, блоков, узлов, схем только в качестве резервных?",
    "answers": [
      {
        "text": "устойчивое.",
        "isCorrect": false
      },
      {
        "text": "отказоустойчивое.",
        "isCorrect": false
      },
      {
        "text": "неустойчивое.",
        "isCorrect": false
      },
      {
        "text": "Простое.",
        "isCorrect": true
      },
      {
        "text": "сложное.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Помехоустойчивое кодирование наиболее эффективно при па­рировании самоустраняющихся отказов, называемых",
    "answers": [
      {
        "text": "адаптивными системами.",
        "isCorrect": false
      },
      {
        "text": "программами.",
        "isCorrect": false
      },
      {
        "text": "системами.",
        "isCorrect": false
      },
      {
        "text": "серверами.",
        "isCorrect": false
      },
      {
        "text": "сбоями.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Наиболее совершенными системами, устойчивыми к отказам, являются:",
    "answers": [
      {
        "text": "тактические системы.",
        "isCorrect": false
      },
      {
        "text": "адаптивные системы.",
        "isCorrect": true
      },
      {
        "text": "информационные системы.",
        "isCorrect": false
      },
      {
        "text": "комплексные системы.",
        "isCorrect": false
      },
      {
        "text": "компьютерные системы.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие средства позволяют бло­кировать вычислительный процесс?",
    "answers": [
      {
        "text": "аппаратно-программные средства.",
        "isCorrect": true
      },
      {
        "text": "компьютерные средства.",
        "isCorrect": false
      },
      {
        "text": "вычислительные средства.",
        "isCorrect": false
      },
      {
        "text": "объектно –ориентированные средства.",
        "isCorrect": false
      },
      {
        "text": "прикладные средства.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "На каком уровне могут устанавливаться атрибуты файлов?",
    "answers": [
      {
        "text": "на системном уровне.",
        "isCorrect": false
      },
      {
        "text": "на объектно – ориентированном уровне.",
        "isCorrect": false
      },
      {
        "text": "на комплексном уровне.",
        "isCorrect": false
      },
      {
        "text": "на аппаратном уровне.",
        "isCorrect": false
      },
      {
        "text": "На программном уровне.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Одним из основных направлений защиты информации в КС от непреднамеренных угроз являются…",
    "answers": [
      {
        "text": "увеличение числа ошибок пользователей",
        "isCorrect": false
      },
      {
        "text": "максимизация ошибок.",
        "isCorrect": false
      },
      {
        "text": "сокращение числа ошибок пользователей",
        "isCorrect": true
      },
      {
        "text": "контроль числа ошибок пользователей",
        "isCorrect": false
      },
      {
        "text": "несанкционированный доступ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Атрибуты файлов устанавливаются на…",
    "answers": [
      {
        "text": "на комплексном уровне.",
        "isCorrect": false
      },
      {
        "text": "программном уровне.",
        "isCorrect": true
      },
      {
        "text": "на аппаратном уровне.",
        "isCorrect": false
      },
      {
        "text": "системном уровне.",
        "isCorrect": false
      },
      {
        "text": "на объектно – ориентированном уровне.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие коды обладают различными возможностями по обнаружению и исправлению ошибок?",
    "answers": [
      {
        "text": "резервные коды.",
        "isCorrect": false
      },
      {
        "text": "отказоустойчивые коды.",
        "isCorrect": false
      },
      {
        "text": "сосредоточенные коды.",
        "isCorrect": false
      },
      {
        "text": "Помехоустойчивые коды.",
        "isCorrect": true
      },
      {
        "text": "рассредоточенные коды.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие средства позволяют блокировать вычислительный процесс при нарушениях адресных пространств оперативной памяти?",
    "answers": [
      {
        "text": "механические средства.",
        "isCorrect": false
      },
      {
        "text": "аппаратно – программные средства.",
        "isCorrect": true
      },
      {
        "text": "информационные средства.",
        "isCorrect": false
      },
      {
        "text": "технические средства.",
        "isCorrect": false
      },
      {
        "text": "программные средства.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени называются…",
    "answers": [
      {
        "text": "программ­ными.",
        "isCorrect": false
      },
      {
        "text": "преднамеренными.",
        "isCorrect": false
      },
      {
        "text": "не случайными.",
        "isCorrect": false
      },
      {
        "text": "стихийными.",
        "isCorrect": false
      },
      {
        "text": "случайными.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Несанкционированный доступ к информации – это…",
    "answers": [
      {
        "text": "доступ к информации, нарушающий правила разграничения доступа.",
        "isCorrect": true
      },
      {
        "text": "угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени.",
        "isCorrect": false
      },
      {
        "text": "возможное событие, процесс или явление, которые могут привести к уничтожению, утрате целостности информации.",
        "isCorrect": false
      },
      {
        "text": "процесс обработки и передачи информации техническими средствами КС.",
        "isCorrect": false
      },
      {
        "text": "совокупность положений, регламентирующих права доступа лиц или про­цессов к единицам информации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По времени восстановления информации методы дублиро­вания могут быть разделены на:",
    "answers": [
      {
        "text": "индивидуальные",
        "isCorrect": false
      },
      {
        "text": "коллективные",
        "isCorrect": false
      },
      {
        "text": "оперативные",
        "isCorrect": true
      },
      {
        "text": "программные",
        "isCorrect": false
      },
      {
        "text": "системные",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По числу копий методы дублирования делятся на:",
    "answers": [
      {
        "text": "сетевые",
        "isCorrect": false
      },
      {
        "text": "системные",
        "isCorrect": false
      },
      {
        "text": "одноуровневые",
        "isCorrect": true
      },
      {
        "text": "простые",
        "isCorrect": false
      },
      {
        "text": "сложные",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Свойство системы выполнять возложенные на нее задачи в определенных условиях эксплуата­ции:",
    "answers": [
      {
        "text": "прочность",
        "isCorrect": false
      },
      {
        "text": "надежность",
        "isCorrect": true
      },
      {
        "text": "сложность",
        "isCorrect": false
      },
      {
        "text": "простота",
        "isCorrect": false
      },
      {
        "text": "отказоустойчивость",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как правило, ценность информации со временем…",
    "answers": [
      {
        "text": "не изменяется",
        "isCorrect": false
      },
      {
        "text": "не увеличивается",
        "isCorrect": false
      },
      {
        "text": "уменьшается",
        "isCorrect": true
      },
      {
        "text": "увеличивается",
        "isCorrect": false
      },
      {
        "text": "не уменьшается",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как правило ценность информации уменьшается",
    "answers": [
      {
        "text": "из-за ее недоступности",
        "isCorrect": false
      },
      {
        "text": "из- за ее конфиденциальности",
        "isCorrect": false
      },
      {
        "text": "с течением времени",
        "isCorrect": true
      },
      {
        "text": "в пик ее актуальности",
        "isCorrect": false
      },
      {
        "text": "с уменьшением количества информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Назовите один из путей получения информации.",
    "answers": [
      {
        "text": "изъятие",
        "isCorrect": false
      },
      {
        "text": "покупкой информации",
        "isCorrect": true
      },
      {
        "text": "предположение",
        "isCorrect": false
      },
      {
        "text": "возникновение",
        "isCorrect": false
      },
      {
        "text": "появление",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Назовите один из путей получения информации.",
    "answers": [
      {
        "text": "предположение",
        "isCorrect": false
      },
      {
        "text": "появление",
        "isCorrect": false
      },
      {
        "text": "изъятие",
        "isCorrect": false
      },
      {
        "text": "противоправное добывание информации",
        "isCorrect": true
      },
      {
        "text": "возникновение",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Назовите пути получения информации",
    "answers": [
      {
        "text": "возникновение, предположение, изъятие",
        "isCorrect": false
      },
      {
        "text": "изъятие, появление, покупка информации",
        "isCorrect": false
      },
      {
        "text": "возникновение, появление, изъятие",
        "isCorrect": false
      },
      {
        "text": "противоправное добывание информации, возникновение, предположение",
        "isCorrect": false
      },
      {
        "text": "проведение научных исследований, покупка информации, противоправное добывание информации",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Приобретение информации на рынке – пример",
    "answers": [
      {
        "text": "предположения",
        "isCorrect": false
      },
      {
        "text": "шпионажа",
        "isCorrect": false
      },
      {
        "text": "противоправного добывания информации",
        "isCorrect": false
      },
      {
        "text": "покупки информации",
        "isCorrect": true
      },
      {
        "text": "изъятия",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Назовите подходы к изменению количества информации",
    "answers": [
      {
        "text": "только Энтропийный подход",
        "isCorrect": false
      },
      {
        "text": "только Тезаурусный подход",
        "isCorrect": false
      },
      {
        "text": "Энтропийный подход, Тезаурусный подход, Практический подход",
        "isCorrect": true
      },
      {
        "text": "только Практический подход",
        "isCorrect": false
      },
      {
        "text": "только Тезаурусный подход и Практический подход",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По числу копий методы дублирования делятся на:",
    "answers": [
      {
        "text": "только многоуровневые",
        "isCorrect": false
      },
      {
        "text": "только одноуровневые",
        "isCorrect": false
      },
      {
        "text": "многофункциональные",
        "isCorrect": false
      },
      {
        "text": "разноуровневые",
        "isCorrect": false
      },
      {
        "text": "одноуровневые и многоуровневые",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Процесс преобразования открытой информации в зашиф­рованную информацию это…",
    "answers": [
      {
        "text": "кодирования",
        "isCorrect": false
      },
      {
        "text": "сжатие",
        "isCorrect": false
      },
      {
        "text": "шифрование",
        "isCorrect": true
      },
      {
        "text": "стеганография",
        "isCorrect": false
      },
      {
        "text": "дешифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие существуют подходы к созданию отказоустойчи­вых систем?",
    "answers": [
      {
        "text": "сложное резервирование, отказоустойчивое кодирование информации",
        "isCorrect": false
      },
      {
        "text": "резервирование, помехоустойчивое шифрование информации, создание адаптивных систем",
        "isCorrect": false
      },
      {
        "text": "простое резервирование, сложное резервирование, создание адаптивных систем",
        "isCorrect": false
      },
      {
        "text": "простое резервирование, помехоустойчивое кодирование информации, создание адаптивных систем",
        "isCorrect": true
      },
      {
        "text": "сложное резервирование, помехоустойчивое сжатие информации, создание адаптивных систем",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Эта система представляет собой множество сосредоточенных компьютерных систем, свя­занных в единую систему с помощью коммуникационной подсистемы:",
    "answers": [
      {
        "text": "нераспределенная компьютерная система",
        "isCorrect": false
      },
      {
        "text": "распределенная компьютерная система",
        "isCorrect": true
      },
      {
        "text": "сосредоточенная компьютерная система",
        "isCorrect": false
      },
      {
        "text": "коммуникационная компьютерная система",
        "isCorrect": false
      },
      {
        "text": "телекоммуникационная компьютерная система",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Коммуникаци­онная подсистема не включает в себя:",
    "answers": [
      {
        "text": "межсетевые шлюзы",
        "isCorrect": false
      },
      {
        "text": "концентраторы",
        "isCorrect": false
      },
      {
        "text": "коммуникационные модули",
        "isCorrect": false
      },
      {
        "text": "сосредоточенные компьютерные системы",
        "isCorrect": true
      },
      {
        "text": "каналы связи",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Они объединяют элементы сети в единую сеть:",
    "answers": [
      {
        "text": "межсетевые шлюзы",
        "isCorrect": false
      },
      {
        "text": "концентраторы",
        "isCorrect": false
      },
      {
        "text": "каналы связи",
        "isCorrect": true
      },
      {
        "text": "коммуникационные модули",
        "isCorrect": false
      },
      {
        "text": "сосредоточенные компьютерные системы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Используются для уплотнения информации перед передачей ее по высокоскоростным каналам:",
    "answers": [
      {
        "text": "концентраторы",
        "isCorrect": true
      },
      {
        "text": "компьютерные системы",
        "isCorrect": false
      },
      {
        "text": "архиваторы",
        "isCorrect": false
      },
      {
        "text": "кабель",
        "isCorrect": false
      },
      {
        "text": "шлюзы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для защиты объектов КС от традиционного шпионажа и диверсий должны быть решены следующие задачи:",
    "answers": [
      {
        "text": "a, b, c, f, g.",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d, e.",
        "isCorrect": true
      },
      {
        "text": "a, b, c, d, f.",
        "isCorrect": false
      },
      {
        "text": "b, c, d, e, g.",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d, g.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Назовите рубеж защиты объекта, на котором производятся работы с ценной конфиденциальной информацией.",
    "answers": [
      {
        "text": "Контролируемая территория.",
        "isCorrect": true
      },
      {
        "text": "Энергетическое поле.",
        "isCorrect": false
      },
      {
        "text": "Инженерные конструкции.",
        "isCorrect": false
      },
      {
        "text": "Электромагнитное поле.",
        "isCorrect": false
      },
      {
        "text": "Охранная сигнализация.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Перед вами рубежи защиты объекта, на котором производятся работы с ценной конфиденциальной информацией. a) контролируемая территория, здание;  b) помещение;  c) устройство, носитель информации; d) программа;   e) информационные ресурсы.",
    "answers": [
      {
        "text": "a, b, c, d.",
        "isCorrect": true
      },
      {
        "text": "a, c, d, e.",
        "isCorrect": false
      },
      {
        "text": "a, b, d, e.",
        "isCorrect": false
      },
      {
        "text": "a, b, c, e.",
        "isCorrect": false
      },
      {
        "text": "b, c, d, e.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Система охраны объекта (СОО) КС создается с целью …",
    "answers": [
      {
        "text": "предотвращения  несанкционированного доступа к файлам компании",
        "isCorrect": false
      },
      {
        "text": "предотвращения несанкционированного проникновения на территорию и в помещения объекта посторонних лиц, обслуживающею персонала и пользователей.",
        "isCorrect": true
      },
      {
        "text": "предотвращения  любого проникновения на территорию и в помещения объекта посторонних лиц, обслуживающею персонала и пользователей.",
        "isCorrect": false
      },
      {
        "text": "предотвращения  несанкционированного проникновения на территорию и в помещения объекта служебных лиц, обслуживающею персонала и пользователей.",
        "isCorrect": false
      },
      {
        "text": "предотвращения  несанкционированного проникновения на территорию и в помещения объекта обслуживающего персонала и пользователей.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для предотвращения  несанкционированного проникновения на территорию и в помещения объекта посторонних лиц, обслуживающею персо­нала и пользователей создается …",
    "answers": [
      {
        "text": "система внутренней охраны объекта (СВОО)",
        "isCorrect": false
      },
      {
        "text": "министерство внутренних дел (МВД)",
        "isCorrect": false
      },
      {
        "text": "система охраны объекта (СОО)",
        "isCorrect": true
      },
      {
        "text": "внешняя охрана объекта (ВОО)",
        "isCorrect": false
      },
      {
        "text": "внутренняя охрана объекта (ВОО)",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что означает Идентификация?",
    "answers": [
      {
        "text": "Полный доступ ко всем рубежам защиты объекта.",
        "isCorrect": false
      },
      {
        "text": "Присвоение субъектам доступа идентификаторов и (или) сравнение предъявляемых идентификаторов с перечнем присвоенных идентификаторов, владельцы (носители) которых допущены на объект.",
        "isCorrect": true
      },
      {
        "text": "Проверку принадлежности субъекту доступа предъявленного им идентификатора, подтверждение подлинности.",
        "isCorrect": false
      },
      {
        "text": "Разрешение субъектам доступа на объект.",
        "isCorrect": false
      },
      {
        "text": "Присвоение право доступа к секретной информации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что означает Аутентификация?",
    "answers": [
      {
        "text": "Присвоение субъектам дос­тупа идентификаторов и (или) сравнение предъявляемых идентификаторов с перечнем присвоенных идентификаторов, владельцы (носители) которых допущены на объект.",
        "isCorrect": false
      },
      {
        "text": "Разрешение субъектам доступа на объект.",
        "isCorrect": false
      },
      {
        "text": "Проверку принадлежности субъекту доступа предъявленного им идентификатора, подтверждение подлинности.",
        "isCorrect": true
      },
      {
        "text": "Полный доступ ко всем рубежам защиты объекта.",
        "isCorrect": false
      },
      {
        "text": "Присвоение право доступа к секретной информации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Доступны для восприятия только при специальном облу­чении лучами света?",
    "answers": [
      {
        "text": "Карты оптической памяти",
        "isCorrect": false
      },
      {
        "text": "Полупроводниковые карты",
        "isCorrect": false
      },
      {
        "text": "Магнитные карты",
        "isCorrect": false
      },
      {
        "text": "Проводниковые карты",
        "isCorrect": false
      },
      {
        "text": "Штриховые карты",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Для биометрической идентификации человека используются: a) папиллярные узоры пальцев;  b) узоры сетчатки глаз; c) форма кисти руки; d) особенности речи; e)  форма и размеры лица; f)  динамика подписи; j) ритм работы на клавиатуре; z) запах тела; k) термические характеристики тела; p) фигура.",
    "answers": [
      {
        "text": "а, b, c, p, j, z, k.",
        "isCorrect": false
      },
      {
        "text": "b, c, d, z, k, p",
        "isCorrect": false
      },
      {
        "text": "z, k, p, e.",
        "isCorrect": false
      },
      {
        "text": "a, b, в, d, e, f, z, k.",
        "isCorrect": true
      },
      {
        "text": "a, b, c, d, e, z, k, p.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Применяются несколько способов частотного преобразова­ния сигнала: a) особенности речи;",
    "answers": [
      {
        "text": "a, b, c.",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d.",
        "isCorrect": false
      },
      {
        "text": "c, d.",
        "isCorrect": false
      },
      {
        "text": "b, c, d.",
        "isCorrect": true
      },
      {
        "text": "a, b, d.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Все методы защиты от электромагнитных излучений и наводок можно разделить на …",
    "answers": [
      {
        "text": "побочные и активные",
        "isCorrect": false
      },
      {
        "text": "активные",
        "isCorrect": false
      },
      {
        "text": "побочные и пассивные",
        "isCorrect": false
      },
      {
        "text": "пассивные",
        "isCorrect": false
      },
      {
        "text": "пассивные и активные",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Пассивные методы обеспечивают …",
    "answers": [
      {
        "text": "увеличение уровня опасного сигнала",
        "isCorrect": false
      },
      {
        "text": "увеличение информативности сигналов",
        "isCorrect": false
      },
      {
        "text": "уменьшение информативности сигналов и увеличение уровня опасного сигнала",
        "isCorrect": false
      },
      {
        "text": "уменьшение уровня опасного сигнала или снижение информативности сигналов",
        "isCorrect": true
      },
      {
        "text": "увеличение уровня опасного сигнала или снижение информативности сигналов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Активные методы защиты направлены на…",
    "answers": [
      {
        "text": "экранирование магнитного поля",
        "isCorrect": false
      },
      {
        "text": "создание помех при опасном уровне сигналов",
        "isCorrect": false
      },
      {
        "text": "создание помех в каналах побочных электромагнитных излучений",
        "isCorrect": true
      },
      {
        "text": "экранирование электрического поля",
        "isCorrect": false
      },
      {
        "text": "экранирование электромагнитного поля",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как называется поле в котором при малых токах и высоких напряжениях в создаваемом поле преобладает электрическая составляющая?",
    "answers": [
      {
        "text": "статическое",
        "isCorrect": false
      },
      {
        "text": "электромагнитное",
        "isCorrect": false
      },
      {
        "text": "индукционное",
        "isCorrect": false
      },
      {
        "text": "электрическое",
        "isCorrect": true
      },
      {
        "text": "магнитное",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как называется поле если в проводнике протекает ток большой величины при малых значениях напряжения, то в поле преобладает магнитная составляющая?",
    "answers": [
      {
        "text": "статическим",
        "isCorrect": false
      },
      {
        "text": "Магнитным",
        "isCorrect": true
      },
      {
        "text": "электростатическим",
        "isCorrect": false
      },
      {
        "text": "электрическим",
        "isCorrect": false
      },
      {
        "text": "электромагнитным",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Поля, у которых электрическая и магнитная составляющие соизмеримы, называются …",
    "answers": [
      {
        "text": "электромагнитными",
        "isCorrect": true
      },
      {
        "text": "магнитными",
        "isCorrect": false
      },
      {
        "text": "статическими",
        "isCorrect": false
      },
      {
        "text": "электростатическими",
        "isCorrect": false
      },
      {
        "text": "электрическими",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В зависимости от типа создаваемого электромагнитного поля различают следующие виды экранирования:",
    "answers": [
      {
        "text": "экранирование индукционного  поля, электромагнитного поля, магнитного поля",
        "isCorrect": false
      },
      {
        "text": "экранирование электрического поля и электромагнитного поля",
        "isCorrect": false
      },
      {
        "text": "экранирование электрического поля, магнитного поля, электромагнитного поля.",
        "isCorrect": true
      },
      {
        "text": "экранирование статического поля, электромагнитного поля, магнитного поля",
        "isCorrect": false
      },
      {
        "text": "экранирование электрического поля и магнитного поля",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Экранирование электрического поля заземленным металлическим экраном обеспечивает?",
    "answers": [
      {
        "text": "экранирование индукционного  поля, электромагнитного поля, магнитного поля",
        "isCorrect": false
      },
      {
        "text": "экранирование статического поля, электромагнитного поля, магнитного поля",
        "isCorrect": false
      },
      {
        "text": "экранирование электрического поля и электромагнитного поля",
        "isCorrect": false
      },
      {
        "text": "экранирование электрического поля и магнитного поля",
        "isCorrect": false
      },
      {
        "text": "нейтрализацию электрических зарядов, которые стекают по заземляющему контуру.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Низкочастотные магнитные поля шунтируются экраном за счет направленности силовых линий…",
    "answers": [
      {
        "text": "в пространстве",
        "isCorrect": false
      },
      {
        "text": "вдоль экрана.",
        "isCorrect": false
      },
      {
        "text": "нет правильного ответа",
        "isCorrect": false
      },
      {
        "text": "вдоль стенок",
        "isCorrect": false
      },
      {
        "text": "вдоль стенок экрана.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Экранирование осуществляется следующими уровнями:",
    "answers": [
      {
        "text": "уровень элементов схем, цепей, помещений",
        "isCorrect": false
      },
      {
        "text": "уровень блоков, цепей, кабельных линий",
        "isCorrect": false
      },
      {
        "text": "уровень элементов схем, блоков, устройств, кабельных линий, помещений.",
        "isCorrect": true
      },
      {
        "text": "уровень схем, блоков, интегральных узлов",
        "isCorrect": false
      },
      {
        "text": "уровень элементов схем, блоков, цепей",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Помехоустойчивое кодирование наиболее эффективно при парировании самоустраняющихся отказов, называемых…",
    "answers": [
      {
        "text": "простой избыточностью",
        "isCorrect": false
      },
      {
        "text": "адаптивными сбоями",
        "isCorrect": false
      },
      {
        "text": "простым резервированием",
        "isCorrect": false
      },
      {
        "text": "сбоями",
        "isCorrect": true
      },
      {
        "text": "адаптивными системами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Изменения электрических схем осуществляются для…",
    "answers": [
      {
        "text": "увеличения  мощности побочных излучений",
        "isCorrect": false
      },
      {
        "text": "уменьшения мощности побочных наводок",
        "isCorrect": false
      },
      {
        "text": "уменьшения мощности активных  излучений",
        "isCorrect": false
      },
      {
        "text": "увеличения  мощности активных  излучений",
        "isCorrect": false
      },
      {
        "text": "уменьшения мощности побочных излучений.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Перспективным направлением борьбы с ПЭМИН является использование…",
    "answers": [
      {
        "text": "стальных каналов связи",
        "isCorrect": false
      },
      {
        "text": "оптических каналов связи.",
        "isCorrect": true
      },
      {
        "text": "медных  каналов связи.",
        "isCorrect": false
      },
      {
        "text": "свинцовых  каналов связи.",
        "isCorrect": false
      },
      {
        "text": "пластиковых  каналов связи.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Использование фильтров является одним из основных способов защиты от…",
    "answers": [
      {
        "text": "ПЭМИН",
        "isCorrect": true
      },
      {
        "text": "ГИБДД",
        "isCorrect": false
      },
      {
        "text": "КС",
        "isCorrect": false
      },
      {
        "text": "СУБД",
        "isCorrect": false
      },
      {
        "text": "ПЭМЭН",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электромагнитные излучения и наводки относятся",
    "answers": [
      {
        "text": "к возможным угрозам",
        "isCorrect": false
      },
      {
        "text": "к неслучайным угрозам",
        "isCorrect": false
      },
      {
        "text": "к преднамеренным угрозам",
        "isCorrect": true
      },
      {
        "text": "к вероятным угрозам",
        "isCorrect": false
      },
      {
        "text": "к случайным угрозам",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Снижение информативности сигналов ПЭМИН, затрудняющее их использование при перехвате, осуществляется следующими путями:",
    "answers": [
      {
        "text": "простые схемы схемные решения, кодирование информации.",
        "isCorrect": false
      },
      {
        "text": "разные  схемные решения, кодирование информации.",
        "isCorrect": false
      },
      {
        "text": "специальные схемные решения,  декодирование информации.",
        "isCorrect": false
      },
      {
        "text": "сложные   схемные решения, кодирование информации.",
        "isCorrect": false
      },
      {
        "text": "специальные схемные решения, кодирование информации.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Для предотвращения утечки информации  используется …",
    "answers": [
      {
        "text": "шифрование по методу Шеннона",
        "isCorrect": false
      },
      {
        "text": "криптографиче­ское преобразование.",
        "isCorrect": true
      },
      {
        "text": "сложное  преобразование.",
        "isCorrect": false
      },
      {
        "text": "простое  преобразование.",
        "isCorrect": false
      },
      {
        "text": "декодирование информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Активные методы защиты от ПЭМИН предполагают применение…",
    "answers": [
      {
        "text": "электра  генератор",
        "isCorrect": false
      },
      {
        "text": "генератор света.",
        "isCorrect": false
      },
      {
        "text": "генератор помех",
        "isCorrect": false
      },
      {
        "text": "генератор звуков.",
        "isCorrect": false
      },
      {
        "text": "генераторов шумов.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Пространственное зашумление осуществляется за счет…",
    "answers": [
      {
        "text": "излучения с помощью металлических  электромагнитных сигналов в пространство.",
        "isCorrect": false
      },
      {
        "text": "излучения с помощью антенн электромагнитных сигналов в пространство.",
        "isCorrect": true
      },
      {
        "text": "излучения с помощью лупы электромагнитных сигналов в пространство.",
        "isCorrect": false
      },
      {
        "text": "излучения с помощью схем электромагнитных сигналов в пространство.",
        "isCorrect": false
      },
      {
        "text": "излучения с помощью медных  электромагнитных сигналов в пространство.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие структуры КС могут быть подвергнуты несанкционированному изменению…",
    "answers": [
      {
        "text": "системная  и алгоритмическая  структуры",
        "isCorrect": false
      },
      {
        "text": "алгоритмическая и техническая",
        "isCorrect": false
      },
      {
        "text": "алгоритмическая, программная и техническая структуры",
        "isCorrect": true
      },
      {
        "text": "программная и техническая",
        "isCorrect": false
      },
      {
        "text": "алгоритмическая и  программная",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Повышенную опасность для безопасности информации на этапе эксплуатации представляют работы по …",
    "answers": [
      {
        "text": "по блокированию сбоев и отказов аппаратных и программных средств",
        "isCorrect": false
      },
      {
        "text": "по многослойной фильтрации КС",
        "isCorrect": false
      },
      {
        "text": "по модернизации КС",
        "isCorrect": true
      },
      {
        "text": "по разработке алгоритмов КС",
        "isCorrect": false
      },
      {
        "text": "по исключению ошибок в  КС",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "На этапе разработки и при модернизации КС основной задачей является …",
    "answers": [
      {
        "text": "обеспечение целостности, неизменности структур",
        "isCorrect": false
      },
      {
        "text": "многослойная фильтрация",
        "isCorrect": false
      },
      {
        "text": "исключение ошибок и возможности внедрения закладок",
        "isCorrect": true
      },
      {
        "text": "разработка алгоритмов",
        "isCorrect": false
      },
      {
        "text": "создание закладок",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Разработке программных и аппаратных средств  предшествует….",
    "answers": [
      {
        "text": "создание закладок",
        "isCorrect": false
      },
      {
        "text": "разработка алгоритмов",
        "isCorrect": true
      },
      {
        "text": "блокирование непреднамеренных ошибок разработчиков и обслуживающего персонала",
        "isCorrect": false
      },
      {
        "text": "многослойная фильтрация",
        "isCorrect": false
      },
      {
        "text": "ис­ключение ошибок",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "К основным принципам  разработки алгоритмов, программ и аппаратных средств не относится…",
    "answers": [
      {
        "text": "применение стандартных блоков, дублирование разработки",
        "isCorrect": false
      },
      {
        "text": "привлечение к   разработке   высококвалифицированных специалистов",
        "isCorrect": false
      },
      {
        "text": "использование линейных структур",
        "isCorrect": true
      },
      {
        "text": "контроль адекватности, многослойная фильтрация",
        "isCorrect": false
      },
      {
        "text": "автоматизация разработки, контроль процесса разработки, сертификация готового продукта",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под дублированием разработки алгоритма программы понимается…",
    "answers": [
      {
        "text": "независимая  разработка одного и того же блока",
        "isCorrect": true
      },
      {
        "text": "разработка двух одинаковых блоков",
        "isCorrect": false
      },
      {
        "text": "разработка нескольких параллельных блоков",
        "isCorrect": false
      },
      {
        "text": "разработка трех одинаковых блоков",
        "isCorrect": false
      },
      {
        "text": "разработка четырех одинаковых блоков",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Тестирование является универсальным средством проверки…",
    "answers": [
      {
        "text": "адекватности  и работоспособности блоков",
        "isCorrect": true
      },
      {
        "text": "блока, за приемлемое для практики время",
        "isCorrect": false
      },
      {
        "text": "модернизации блоков",
        "isCorrect": false
      },
      {
        "text": "аппаратных средств готового продукта",
        "isCorrect": false
      },
      {
        "text": "сертификации готового продукта",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "К атрибутивным идентификаторам  не относится…",
    "answers": [
      {
        "text": "электронный жетон",
        "isCorrect": false
      },
      {
        "text": "пароль и съемный носитель информации",
        "isCorrect": false
      },
      {
        "text": "ритм работы на клавиатуре",
        "isCorrect": true
      },
      {
        "text": "механический ключ",
        "isCorrect": false
      },
      {
        "text": "пластиковая карта",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Разработка защищенных КС и элементов для них завершается…",
    "answers": [
      {
        "text": "сертификацией готового продукта",
        "isCorrect": true
      },
      {
        "text": "транспортирования готового продукта",
        "isCorrect": false
      },
      {
        "text": "серийного производ­ства готового продукта",
        "isCorrect": false
      },
      {
        "text": "модернизацией готового продукта",
        "isCorrect": false
      },
      {
        "text": "хранения аппаратных средств готового продукта",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие действия не выполняют при организации доступа к оборудованию пользователей, операторов, администраторов?",
    "answers": [
      {
        "text": "Всестороннюю проверку  комплектующих изделий",
        "isCorrect": true
      },
      {
        "text": "Идентификацию  субъекта доступа",
        "isCorrect": false
      },
      {
        "text": "Разблокирование устройства",
        "isCorrect": false
      },
      {
        "text": "Аутентификацию субъекта доступа",
        "isCorrect": false
      },
      {
        "text": "Ведение журнала учета действий субъекта доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Паролем называют…",
    "answers": [
      {
        "text": "комбинацию символов (букв; цифр, специ­альных знаков), которая известна только пользователям",
        "isCorrect": false
      },
      {
        "text": "комбинацию символов (букв; цифр, специ­альных знаков), которая должна быть известна  владельцу пароля, администратору системы безопасности и пользователям",
        "isCorrect": false
      },
      {
        "text": "комбинацию символов (букв; цифр, специ­альных знаков), которая должна быть известна только  администратору системы безопасности.",
        "isCorrect": false
      },
      {
        "text": "комбинацию символов (букв; цифр, специ­альных знаков), которая должна быть известна только владельцу пароля",
        "isCorrect": false
      },
      {
        "text": "комбинацию символов (букв; цифр, специ­альных знаков), которая должна быть известна только владельцу пароля и, возможно, администратору системы безопасности",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "С какой периодичностью меняется псевдослу­чайная буквенно-цифровая последовательность (слово) в жетоне?",
    "answers": [
      {
        "text": "раз в минуту синхронно со сменой тако­го же слова в КС",
        "isCorrect": true
      },
      {
        "text": "раз в 30 минут, синхронно со сменой тако­го же слова в КС",
        "isCorrect": false
      },
      {
        "text": "два раза в минуту синхронно со сменой тако­го же слова в КС",
        "isCorrect": false
      },
      {
        "text": "три раза в минуту синхронно со сменой тако­го же слова в КС",
        "isCorrect": false
      },
      {
        "text": "псевдослучайная буквенно-цифровая последовательность не изменяется",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Первый жетон SecurlD появился в…",
    "answers": [
      {
        "text": "1988 году",
        "isCorrect": false
      },
      {
        "text": "1990 году",
        "isCorrect": false
      },
      {
        "text": "1991 году",
        "isCorrect": false
      },
      {
        "text": "1987 году",
        "isCorrect": true
      },
      {
        "text": "1989 году",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для идентификации субъекта доступа в КС чаще всего ис­пользуются…",
    "answers": [
      {
        "text": "атрибутивные идентификаторы.",
        "isCorrect": true
      },
      {
        "text": "биометрические идентификаторы",
        "isCorrect": false
      },
      {
        "text": "активные датчики",
        "isCorrect": false
      },
      {
        "text": "вибрационные датчики",
        "isCorrect": false
      },
      {
        "text": "контактные датчики",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Биометрическая идентификация проще всего осуществляется…",
    "answers": [
      {
        "text": "по звуку голоса",
        "isCorrect": false
      },
      {
        "text": "по ритму работы на клавиатуре",
        "isCorrect": true
      },
      {
        "text": "по динамике подписи",
        "isCorrect": false
      },
      {
        "text": "по папиллярным узорам пальцев",
        "isCorrect": false
      },
      {
        "text": "по сетчатке глаз",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какое из перечисленных  выражений, не отвечает требованиям предъявляемым к  контрольно-испытательному стенду?",
    "answers": [
      {
        "text": "необходимо поддерживать взаимозаменяемость программ­ных модулей модели и реальной системы",
        "isCorrect": false
      },
      {
        "text": "стенд должен обеспечивать адекватность структуры и информационных потоков структуре и информационным потокам реальной системы",
        "isCorrect": false
      },
      {
        "text": "стенд строится как открытая система, допускающая модер­низацию",
        "isCorrect": false
      },
      {
        "text": "стенд должен позволять проводить как автономные испы­тания модулей, так и всего программного средства в целом",
        "isCorrect": false
      },
      {
        "text": "стенд строится как закрытая система, которая не допускает изменения и  модернизацию",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Какие модули не может содержать контрольно-испытательный стенд?",
    "answers": [
      {
        "text": "модуль системы и модуль конфигурации модели системы",
        "isCorrect": false
      },
      {
        "text": "модуль формирования входных воздействий и модель внешних воздействий",
        "isCorrect": false
      },
      {
        "text": "программные модули  из соответст­вующих баз данных и базу данных моделей угроз",
        "isCorrect": false
      },
      {
        "text": "модуль анализа результатов тестирования",
        "isCorrect": false
      },
      {
        "text": "модуль конфигурации",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Выполняемые модули программных средств проверяются в процессе…",
    "answers": [
      {
        "text": "транспортирования",
        "isCorrect": false
      },
      {
        "text": "разработки и модернизации",
        "isCorrect": false
      },
      {
        "text": "серийного производ­ства",
        "isCorrect": false
      },
      {
        "text": "сертификации на специальных аппаратно-программных стендах",
        "isCorrect": true
      },
      {
        "text": "хранения аппаратных средств",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Операция, об­ратная транслированию - …",
    "answers": [
      {
        "text": "детранслирование",
        "isCorrect": false
      },
      {
        "text": "кодирование",
        "isCorrect": false
      },
      {
        "text": "аутентификация",
        "isCorrect": false
      },
      {
        "text": "дизассемблирование",
        "isCorrect": true
      },
      {
        "text": "ассемблирование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Аппаратные закладки не могут внедряться в процессе…",
    "answers": [
      {
        "text": "эксплуатации",
        "isCorrect": true
      },
      {
        "text": "транспортирования",
        "isCorrect": false
      },
      {
        "text": "серийного производ­ства",
        "isCorrect": false
      },
      {
        "text": "разработки и модернизации",
        "isCorrect": false
      },
      {
        "text": "хранения аппаратных средств",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Этапы разработки, производства и модернизации аппаратных средств КС завершаются…",
    "answers": [
      {
        "text": "контролем на наличие производственного брака и закладок",
        "isCorrect": false
      },
      {
        "text": "контролем на наличие конструктивных ошибок, производственного брака и закладок",
        "isCorrect": true
      },
      {
        "text": "контролем на наличие ошибок обслуживающего  персонала и производственного брака",
        "isCorrect": false
      },
      {
        "text": "контролем на наличие конструктивных ошибок и закладок",
        "isCorrect": false
      },
      {
        "text": "контролем на наличие конструктивных ошибок и  производственного брака",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для упрощения анализа выполняемых модулей применяются программы- трассировщики, которые позволяют…",
    "answers": [
      {
        "text": "противодействовать внедрению вредительских программ",
        "isCorrect": false
      },
      {
        "text": "исследовать неразборные конструкции (микросхем, кон­денсаторов и т.д)",
        "isCorrect": false
      },
      {
        "text": "обнаружить ошибки и закладки",
        "isCorrect": false
      },
      {
        "text": "идентифицировать субъект",
        "isCorrect": false
      },
      {
        "text": "проконтролиро­вать последовательность событий, порядок выполнения команд.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Одним из наиболее эффективных путей обнаружения закладок и ошибок в разрабатываемых программных средствах является…",
    "answers": [
      {
        "text": "применение трансляторов",
        "isCorrect": false
      },
      {
        "text": "применение рентгеновских установок",
        "isCorrect": false
      },
      {
        "text": "применение программ - трассировщиков",
        "isCorrect": false
      },
      {
        "text": "применение рабочих станций",
        "isCorrect": false
      },
      {
        "text": "создание комплексного контрольно-испытательного стенда",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Для исследования неразборных конструкций (микросхем, кон­денсаторов, резисторов, печатных плат и др.) используются…",
    "answers": [
      {
        "text": "рабочие станции программистов",
        "isCorrect": false
      },
      {
        "text": "рентгеновские установки",
        "isCorrect": true
      },
      {
        "text": "трансляторы",
        "isCorrect": false
      },
      {
        "text": "программы - трассировщики",
        "isCorrect": false
      },
      {
        "text": "контрольно-испытательные стенды",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методы противодействия дизассемб­лированию:",
    "answers": [
      {
        "text": "использование самогенерирующих кодов, «обман» дизассемблера",
        "isCorrect": false
      },
      {
        "text": "шифрование, архивация, использование самогенерирующих кодов,«обман» дизассемблера",
        "isCorrect": true
      },
      {
        "text": "«обман» дизассемблера, шифрование",
        "isCorrect": false
      },
      {
        "text": "шифрование, архивация",
        "isCorrect": false
      },
      {
        "text": "использование самогенерирующих кодов, архивация",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для противодействия трассировке программы в ее состав вво­дятся следующие механизмы:",
    "answers": [
      {
        "text": "использование самогенерирующих кодов, архивация",
        "isCorrect": false
      },
      {
        "text": "изменение среды функционирования, модификация кодов программы, «случайные» переходы.",
        "isCorrect": true
      },
      {
        "text": "чтение; выполнение программ",
        "isCorrect": false
      },
      {
        "text": "модификация кодов программы, использование самогенерирующих кодов",
        "isCorrect": false
      },
      {
        "text": "«случайные» переходы, использование самогенерирующих кодов, архивация",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Злоумышленник осуществляет НСДИ, используя…",
    "answers": [
      {
        "text": "«обман» дисассемблирование системе защиты информации, сбои, отказы технических и программных средств, ошибки, небрежность обслуживающего персонала и пользователей",
        "isCorrect": false
      },
      {
        "text": "незнания о КС и неумения работать с ней, сбои, отказы технических и программных средств, ошибки, небрежность обслуживающего персонала и пользователей",
        "isCorrect": false
      },
      {
        "text": "незнания о КС и неумения работать с ней, сведения о системе защиты информации, сбои, отказы технических и программных средств, ошибки",
        "isCorrect": false
      },
      {
        "text": "«обман» дисассемблирование системе защиты информации",
        "isCorrect": false
      },
      {
        "text": "знания о КС и умения работать с ней, сведения о системе защиты информации, сбои, отказы технических и программных средств, ошибки, небрежность обслуживающего персонала и пользователей",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Одним из путей добывания информации о недостатках системы защиты является…",
    "answers": [
      {
        "text": "изучение механизмов защиты",
        "isCorrect": true
      },
      {
        "text": "изучение механизмов управления",
        "isCorrect": false
      },
      {
        "text": "изучение работы машин",
        "isCorrect": false
      },
      {
        "text": "изучение системы управления",
        "isCorrect": false
      },
      {
        "text": "изучение работы сотрудников",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что может сделать злоумышленник с системой защиты?",
    "answers": [
      {
        "text": "Протестировать не контактируя с ней",
        "isCorrect": false
      },
      {
        "text": "Уничтожить путем непосредственного контакта с ней",
        "isCorrect": false
      },
      {
        "text": "Утопить",
        "isCorrect": false
      },
      {
        "text": "Протестировать путем непосредственного контакта с ней",
        "isCorrect": true
      },
      {
        "text": "Забрать с собой",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под криптографической защитой информации понимается такое преобразование исходной информации:",
    "answers": [
      {
        "text": "В результате кото­рого она становится не доступной для всех.",
        "isCorrect": false
      },
      {
        "text": "В результате кото­рого она становится доступной для всех.",
        "isCorrect": false
      },
      {
        "text": "В результате кото­рого она становится доступной для ознакомления и использования лицами, не имеющими на это полномочий.",
        "isCorrect": false
      },
      {
        "text": "В результате кото­рого она становится недоступной для ознакомления и использования лицами,  имеющими на это полномочий.",
        "isCorrect": false
      },
      {
        "text": "В результате кото­рого она становится недоступной для ознакомления и использования лицами, не имеющими на это полномочий.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Проведением обратимых математических, логических, комбинаторных и других преобразо­ваний исходной информации называется…",
    "answers": [
      {
        "text": "Преобразованием.",
        "isCorrect": false
      },
      {
        "text": "Шифрованием.",
        "isCorrect": true
      },
      {
        "text": "Рисованием.",
        "isCorrect": false
      },
      {
        "text": "Переработкой.",
        "isCorrect": false
      },
      {
        "text": "Обработкой.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для шифрования информации используются?",
    "answers": [
      {
        "text": "Алгоритм и ключ.",
        "isCorrect": true
      },
      {
        "text": "Криптоключ.",
        "isCorrect": false
      },
      {
        "text": "Оптимизация.",
        "isCorrect": false
      },
      {
        "text": "Ключ.",
        "isCorrect": false
      },
      {
        "text": "Алгоритм.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как правило, алгоритм для определенного ме­тода шифрования является…",
    "answers": [
      {
        "text": "Изменяемым.",
        "isCorrect": false
      },
      {
        "text": "Основным.",
        "isCorrect": false
      },
      {
        "text": "Неизменным.",
        "isCorrect": true
      },
      {
        "text": "Не нужным.",
        "isCorrect": false
      },
      {
        "text": "Не главным.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Исходными данными для алгоритма шифрования служат информация…",
    "answers": [
      {
        "text": "Криптошифрования.",
        "isCorrect": false
      },
      {
        "text": "Подлежащая зашифрованию, и ключ шифрования.",
        "isCorrect": true
      },
      {
        "text": "Ключ шифрования.",
        "isCorrect": false
      },
      {
        "text": "Подлежащая зашифрованию.",
        "isCorrect": false
      },
      {
        "text": "Нет правильного ответа.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методы стеганографии  позволяет скрыть…",
    "answers": [
      {
        "text": "Сам факт хранения или передачи закрытой информации.",
        "isCorrect": true
      },
      {
        "text": "Нет правильного ответа.",
        "isCorrect": false
      },
      {
        "text": "Хранение информации.",
        "isCorrect": false
      },
      {
        "text": "Всю информацию.",
        "isCorrect": false
      },
      {
        "text": "Передачи информации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Система разграничения доступа к информации должна содер­жать четыре функциональных блока:",
    "answers": [
      {
        "text": "блок идентификации и аутентификации субъектов доступа, система криптографического преобразования информации при ее уничтожений и передаче",
        "isCorrect": false
      },
      {
        "text": "система идентификации и аутентификации субъектов доступа, система очистки памяти",
        "isCorrect": false
      },
      {
        "text": "блок идентификации и аутентификации субъектов доступа, диспетчер доступа, блок криптографического   преобразования   информации при ее хранении и передаче, блок очистки памяти",
        "isCorrect": true
      },
      {
        "text": "система криптографического преобразования информации при ее уничтожений и передаче, пропуск доступа, система очистки памяти",
        "isCorrect": false
      },
      {
        "text": "система идентификации и аутентификации субъектов доступа, пропуск доступа, система очистки памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Идентификация и аутентификация субъектов осуществляется в момент…",
    "answers": [
      {
        "text": "их запрета к устройствам",
        "isCorrect": false
      },
      {
        "text": "блок очистки памяти",
        "isCorrect": false
      },
      {
        "text": "системы идентификации и аутентификации субъектов доступа",
        "isCorrect": false
      },
      {
        "text": "их доступа к устройствам",
        "isCorrect": true
      },
      {
        "text": "системы очистки памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для аппаратной поддержки защиты и изоляции ядра в архи­тектуре ЭВМ должны быть предусмотрены:",
    "answers": [
      {
        "text": "многоуровневый режим выполнения команд, использование ключей защиты и сегментирование памяти, реализация механизма виртуальной памяти с разделением адресных пространств, аппаратная реализация части функций ОС, хранение  программ  ядра в  постоянном  запоминающем устройстве (ПЗУ), использование новых архитектур ЭВМ.",
        "isCorrect": true
      },
      {
        "text": "блоки идентификации и аутентификации субъектов доступа, диспетчер доступа, блоки   криптографического   преобразования   информации при ее хранении и передаче, блок очистки памяти",
        "isCorrect": false
      },
      {
        "text": "сведения о системе защиты информации, блоки   криптографического   преобразования   информации при ее хранении и передаче",
        "isCorrect": false
      },
      {
        "text": "знания о КС и умения работать с ней, сведения о системе защиты информации, сбои, отказы технических и программных средств, ошибки, небрежность обслуживающего персонала",
        "isCorrect": false
      },
      {
        "text": "одноуровневый режим выполнения команд, знания о КС и умения работать с ней, блоки идентификации и аутентификации субъектов доступа, блок очистки памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для применения ядра безопасности требуется провести…",
    "answers": [
      {
        "text": "замену системного блока и монитора",
        "isCorrect": false
      },
      {
        "text": "изменение конфигураций и архитектуры ЭВМ",
        "isCorrect": false
      },
      {
        "text": "замену периферийных устройств",
        "isCorrect": false
      },
      {
        "text": "изменения ОС и архитектуры ЭВМ",
        "isCorrect": true
      },
      {
        "text": "изменения ОС и периферийных устройств",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что используется для шифрования информации?",
    "answers": [
      {
        "text": "Алгоритм.",
        "isCorrect": false
      },
      {
        "text": "Ключ.",
        "isCorrect": false
      },
      {
        "text": "Криптоключ.",
        "isCorrect": false
      },
      {
        "text": "Алгоритм и ключ.",
        "isCorrect": true
      },
      {
        "text": "Оптимизация.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Диспетчер доступа реализуется в виде…",
    "answers": [
      {
        "text": "программных механизмов",
        "isCorrect": false
      },
      {
        "text": "аппаратно-программных механизмов",
        "isCorrect": true
      },
      {
        "text": "техники",
        "isCorrect": false
      },
      {
        "text": "программ",
        "isCorrect": false
      },
      {
        "text": "интерфейса",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Локализованную, минимизиро­ванную, четко ограниченную и надежно изолированную совокупность программно-аппаратных механизмов, доказательно правильно реализующих функции диспетчера доступа называют…",
    "answers": [
      {
        "text": "программных механизмом",
        "isCorrect": false
      },
      {
        "text": "программой",
        "isCorrect": false
      },
      {
        "text": "интерфейсом",
        "isCorrect": false
      },
      {
        "text": "ядром безопасности",
        "isCorrect": true
      },
      {
        "text": "средой безопасности",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс загрузки ОС должен исключать…",
    "answers": [
      {
        "text": "возможность вмешательства до полного завершения операции",
        "isCorrect": false
      },
      {
        "text": "возможность блокировки до полного завершения загрузки",
        "isCorrect": false
      },
      {
        "text": "возможность вмешательства до неполного завершения загрузки",
        "isCorrect": false
      },
      {
        "text": "возможность вмешательства до полного отключения",
        "isCorrect": false
      },
      {
        "text": "возможность вмешательства до полного завершения загрузки",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Создание копий программных средств для изучения или не­санкционированного использования осуществляется с помощью устройств...",
    "answers": [
      {
        "text": "вывода или ввода",
        "isCorrect": false
      },
      {
        "text": "ввода или каналов связи",
        "isCorrect": false
      },
      {
        "text": "вывода или печати",
        "isCorrect": false
      },
      {
        "text": "вывода или каналов аудио-видео",
        "isCorrect": false
      },
      {
        "text": "вывода или каналов связи",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Архивацию можно рассматривать как…",
    "answers": [
      {
        "text": "вывод или ввод данных",
        "isCorrect": false
      },
      {
        "text": "простейшее шифрование данных",
        "isCorrect": true
      },
      {
        "text": "простейшее дешифрование данных",
        "isCorrect": false
      },
      {
        "text": "вывод или печать данных",
        "isCorrect": false
      },
      {
        "text": "сжатие данных",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является главным условием создания ядра безопасности?",
    "answers": [
      {
        "text": "Обеспечение очистки памяти",
        "isCorrect": false
      },
      {
        "text": "Обеспечение уменьшения загрузки процессора",
        "isCorrect": false
      },
      {
        "text": "Обеспечение одноуровневого режима выполнения команд",
        "isCorrect": false
      },
      {
        "text": "Обеспечение  многоуровневого режима выполнения  команд",
        "isCorrect": true
      },
      {
        "text": "Уменьшения размеров ядра",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под «обманом» дизассемблера понимают…",
    "answers": [
      {
        "text": "такой стиль программирования, который вызывает нарушение правильной работы стандартного ассемблера",
        "isCorrect": false
      },
      {
        "text": "такой стиль программирования, который не вызывает нарушение правильной работы стандартного дизассемблера",
        "isCorrect": false
      },
      {
        "text": "такой стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера",
        "isCorrect": false
      },
      {
        "text": "такой стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера",
        "isCorrect": true
      },
      {
        "text": "простейшее дешифрование данных",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Целью сжатия информации является...",
    "answers": [
      {
        "text": "редактирование данных",
        "isCorrect": false
      },
      {
        "text": "вывод или печать данных",
        "isCorrect": false
      },
      {
        "text": "простейшее дешифрование данных",
        "isCorrect": false
      },
      {
        "text": "сокращение объема информации",
        "isCorrect": true
      },
      {
        "text": "вывод или ввод данных",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для противодействия трассировке программы в ее состав вво­дятся следующий механизм…",
    "answers": [
      {
        "text": "«случайный» переход",
        "isCorrect": true
      },
      {
        "text": "редактирование данных",
        "isCorrect": false
      },
      {
        "text": "вывод или печать данных",
        "isCorrect": false
      },
      {
        "text": "вывод или ввод данных",
        "isCorrect": false
      },
      {
        "text": "простейшее дешифрование данных",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "«Случайные» переходы выполняются за счет…",
    "answers": [
      {
        "text": "вычисления адресов переходов",
        "isCorrect": true
      },
      {
        "text": "нахождения адресов переходов",
        "isCorrect": false
      },
      {
        "text": "вычитания адресов переходов",
        "isCorrect": false
      },
      {
        "text": "редактирования адресов переходов",
        "isCorrect": false
      },
      {
        "text": "сложения адресов переходов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют…",
    "answers": [
      {
        "text": "Случайными или непреднамеренными.",
        "isCorrect": true
      },
      {
        "text": "Не опасными.",
        "isCorrect": false
      },
      {
        "text": "Вредоносными",
        "isCorrect": false
      },
      {
        "text": "Безвредными.",
        "isCorrect": false
      },
      {
        "text": "Не серьезными.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Маскировка скрытых действий часто осуществляется с приме­нением…",
    "answers": [
      {
        "text": "адресов",
        "isCorrect": false
      },
      {
        "text": "криптографии",
        "isCorrect": false
      },
      {
        "text": "регистров",
        "isCorrect": false
      },
      {
        "text": "стеков и регистров",
        "isCorrect": false
      },
      {
        "text": "стеков",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Обеспечение  многоуровневого режима выполнения  команд является главным условием…",
    "answers": [
      {
        "text": "создание периферийных устройств",
        "isCorrect": false
      },
      {
        "text": "создание операционной системы",
        "isCorrect": false
      },
      {
        "text": "создание программ",
        "isCorrect": false
      },
      {
        "text": "создание новых технологий",
        "isCorrect": false
      },
      {
        "text": "создания ядра безопасности",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Обеспечение  многоуровневого режима выполнения  команд  является главным условием создания ядра безопасности. Сколько должно быть многоуровневых режимов выполнения  команд?",
    "answers": [
      {
        "text": "Не менее пяти",
        "isCorrect": false
      },
      {
        "text": "Не менее трех",
        "isCorrect": false
      },
      {
        "text": "Не менее двух",
        "isCorrect": true
      },
      {
        "text": "Не менее десяти",
        "isCorrect": false
      },
      {
        "text": "Не менее шести",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Имеется два пути получения защищенных от НСД КС. Какие?",
    "answers": [
      {
        "text": "Создание простых КС, оснащение обычных КС с простыми средствами защиты",
        "isCorrect": false
      },
      {
        "text": "Создание специализированных КС, оснащение обычных КС с простыми средствами защиты",
        "isCorrect": false
      },
      {
        "text": "Создание специализированных КС, оснащение универсальных КС с дополнительными средствами защиты",
        "isCorrect": true
      },
      {
        "text": "Создание системы очистки памяти",
        "isCorrect": false
      },
      {
        "text": "Создание простых КС, оснащение универсальных КС с дополнительными средствами защиты",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угроза несанкционированного копирования информации блокируется методами, которые могут быть распределены по двум группам:",
    "answers": [
      {
        "text": "a, b",
        "isCorrect": true
      },
      {
        "text": "d, c",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d",
        "isCorrect": false
      },
      {
        "text": "a, b, c",
        "isCorrect": false
      },
      {
        "text": "a, e, c",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Программные системы защиты в качестве идентификатора ис­пользуют, как правило, только…",
    "answers": [
      {
        "text": "пароль",
        "isCorrect": true
      },
      {
        "text": "карту",
        "isCorrect": false
      },
      {
        "text": "ключ",
        "isCorrect": false
      },
      {
        "text": "шифр",
        "isCorrect": false
      },
      {
        "text": "замок",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Основной задачей противодействия трассировке является увели­чение…",
    "answers": [
      {
        "text": "числа и сложности ручных атак, которые необходимо выполнить программисту-аналитику",
        "isCorrect": false
      },
      {
        "text": "числа и сложности автоматических операций, которые необходимо выполнить программисту-аналитику",
        "isCorrect": false
      },
      {
        "text": "числа и сложности умственных операций, которые необходимо выполнить программисту-аналитику",
        "isCorrect": false
      },
      {
        "text": "прочности ручных операций, которые необходимо выполнить программисту-аналитику",
        "isCorrect": false
      },
      {
        "text": "числа и сложности ручных операций, которые необходимо выполнить программисту-аналитику",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Одним из наиболее эффективных методов разграничения дос­тупа является:",
    "answers": [
      {
        "text": "лингвистическое  преобразование информации",
        "isCorrect": false
      },
      {
        "text": "орфографическое  преобразование информации",
        "isCorrect": false
      },
      {
        "text": "открытое преобразование информации",
        "isCorrect": false
      },
      {
        "text": "криптографическое преобразование информации",
        "isCorrect": true
      },
      {
        "text": "косвенное  преобразование информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс, заключается в проведении обратимых математических, логических, комбинаторных и других преобразо­ваний исходной информации, в результате которых зашифрованная информация  представляет собой хаотический  набор букв, цифр, других символов и двоичных кодов называется:",
    "answers": [
      {
        "text": "архивированием",
        "isCorrect": false
      },
      {
        "text": "шифрованием",
        "isCorrect": true
      },
      {
        "text": "лингвистическое  преобразование информации",
        "isCorrect": false
      },
      {
        "text": "косвенное  преобразование информации",
        "isCorrect": false
      },
      {
        "text": "дешифрованием",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Содержанием какого процесса информации является замена смысловых конструкций исходной информации (слов, предложений) кодами?",
    "answers": [
      {
        "text": "сжатием",
        "isCorrect": false
      },
      {
        "text": "шифрованием",
        "isCorrect": false
      },
      {
        "text": "архивированием",
        "isCorrect": false
      },
      {
        "text": "кодирования",
        "isCorrect": true
      },
      {
        "text": "деархивированием",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрова­ния называется:",
    "answers": [
      {
        "text": "методом редактирования",
        "isCorrect": false
      },
      {
        "text": "методом дешифрования",
        "isCorrect": false
      },
      {
        "text": "методом архивирования",
        "isCorrect": false
      },
      {
        "text": "методом сжатия",
        "isCorrect": false
      },
      {
        "text": "методом шифрования",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Какой алгоритм предусматривает сложение по mod 2 исходной последовательности бит с последовательностью бит гаммы?",
    "answers": [
      {
        "text": "методом архивирования",
        "isCorrect": false
      },
      {
        "text": "методом дешифрования",
        "isCorrect": false
      },
      {
        "text": "методом сжатия",
        "isCorrect": false
      },
      {
        "text": "метод  гаммирование",
        "isCorrect": true
      },
      {
        "text": "методом редактирования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В какой стране применяли шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "Россия.",
        "isCorrect": false
      },
      {
        "text": "Великобритания.",
        "isCorrect": false
      },
      {
        "text": "Япония.",
        "isCorrect": false
      },
      {
        "text": "США.",
        "isCorrect": true
      },
      {
        "text": "Франция.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В каком году применяли шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "1968.",
        "isCorrect": false
      },
      {
        "text": "1980.",
        "isCorrect": false
      },
      {
        "text": "1990.",
        "isCorrect": false
      },
      {
        "text": "1978.",
        "isCorrect": true
      },
      {
        "text": "1999.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования закрытой ин­формации в открытую?",
    "answers": [
      {
        "text": "Зашифрования.",
        "isCorrect": false
      },
      {
        "text": "Криптование.",
        "isCorrect": false
      },
      {
        "text": "Расшифрование.",
        "isCorrect": true
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Шифрование.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Криптосистема Мак-Элиса использует коды…",
    "answers": [
      {
        "text": "не исправляющие ошибки",
        "isCorrect": false
      },
      {
        "text": "исправляющие ошибки",
        "isCorrect": true
      },
      {
        "text": "преобразующие команды",
        "isCorrect": false
      },
      {
        "text": "создающие ошибки",
        "isCorrect": false
      },
      {
        "text": "исправляющие команды",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Система, основана на сложности вычисления дис­кретных логарифмов в конечных полях…",
    "answers": [
      {
        "text": "Иванова",
        "isCorrect": false
      },
      {
        "text": "Скотта",
        "isCorrect": false
      },
      {
        "text": "Соколова",
        "isCorrect": false
      },
      {
        "text": "Мак-Элиса",
        "isCorrect": false
      },
      {
        "text": "Эль-Гамаля",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Процесс преобразования открытой информации в закрытую получил на­звание…",
    "answers": [
      {
        "text": "Криптование.",
        "isCorrect": false
      },
      {
        "text": "Архивирование",
        "isCorrect": false
      },
      {
        "text": "Зашифрование.",
        "isCorrect": true
      },
      {
        "text": "Расшифрование.",
        "isCorrect": false
      },
      {
        "text": "Шифрование.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Откуда предпочтительней загружать информацию?",
    "answers": [
      {
        "text": "Карта памяти",
        "isCorrect": false
      },
      {
        "text": "С несъемного носителя",
        "isCorrect": true
      },
      {
        "text": "Магнитного диска",
        "isCorrect": false
      },
      {
        "text": "Жетон пользователя",
        "isCorrect": false
      },
      {
        "text": "С флешки",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования открытой информации в закрытую получил на­звание?",
    "answers": [
      {
        "text": "Зашифрование.",
        "isCorrect": true
      },
      {
        "text": "Криптование.",
        "isCorrect": false
      },
      {
        "text": "Расшифрование.",
        "isCorrect": false
      },
      {
        "text": "Шифрование.",
        "isCorrect": false
      },
      {
        "text": "Перешифрование.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В каком году в первые применили шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "1999.",
        "isCorrect": false
      },
      {
        "text": "1980.",
        "isCorrect": false
      },
      {
        "text": "1978.",
        "isCorrect": true
      },
      {
        "text": "1968.",
        "isCorrect": false
      },
      {
        "text": "1990.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В какой стране в первые применили шифр DES (Data Encryption Standard)?",
    "answers": [
      {
        "text": "США.",
        "isCorrect": true
      },
      {
        "text": "Великобритания.",
        "isCorrect": false
      },
      {
        "text": "Россия.",
        "isCorrect": false
      },
      {
        "text": "Япония.",
        "isCorrect": false
      },
      {
        "text": "Франция.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Криптостойкость рассмотренных методов шифрования опре­деляется длиной ключа, которая для современных систем должна быть, по крайней мере…",
    "answers": [
      {
        "text": "Меньше  64 бит.",
        "isCorrect": false
      },
      {
        "text": "Больше 64 бит.",
        "isCorrect": false
      },
      {
        "text": "Меньше 90  бит.",
        "isCorrect": false
      },
      {
        "text": "32 бита.",
        "isCorrect": false
      },
      {
        "text": "Больше 90 бит.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Угрозы, которые не связаны с преднамеренными действиями злоумышленников и реализуются в случайные моменты времени, называют?",
    "answers": [
      {
        "text": "Не опасными и не значительными",
        "isCorrect": false
      },
      {
        "text": "Безвредными и опасными",
        "isCorrect": false
      },
      {
        "text": "Случайными или непреднамеренными.",
        "isCorrect": true
      },
      {
        "text": "Не серьезными и не опасными",
        "isCorrect": false
      },
      {
        "text": "Вредоносными и опасными",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Согласно данным Национального Института Стандартов и Технологий США (NIST) 65% случаев нарушения безопасности информации происходит в результате….",
    "answers": [
      {
        "text": "ошибок пользователей.",
        "isCorrect": false
      },
      {
        "text": "обслуживающего персонала.",
        "isCorrect": false
      },
      {
        "text": "вирусы.",
        "isCorrect": false
      },
      {
        "text": "ошибок пользователей и обслуживающего персонала.",
        "isCorrect": true
      },
      {
        "text": "администраторов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что означает проверку принадлежности субъектов доступа предъявленного им идентификатора, подтверждения подлинности?",
    "answers": [
      {
        "text": "верификация",
        "isCorrect": false
      },
      {
        "text": "спецификация",
        "isCorrect": false
      },
      {
        "text": "аутентификация",
        "isCorrect": true
      },
      {
        "text": "выдача пропуска",
        "isCorrect": false
      },
      {
        "text": "идентификация",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Различают способы идентификации людей:",
    "answers": [
      {
        "text": "идентификационный и метрический",
        "isCorrect": false
      },
      {
        "text": "атрибутивный и идентификационный",
        "isCorrect": false
      },
      {
        "text": "атрибутивный и биометрический",
        "isCorrect": true
      },
      {
        "text": "атрибутивный и метрический",
        "isCorrect": false
      },
      {
        "text": "идентификационный и биометрический",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой способ предполагает выдачу субъекту доступа либо уникального предмета, либо пароля, либо предмета содержащего код?",
    "answers": [
      {
        "text": "биометрический",
        "isCorrect": false
      },
      {
        "text": "идентификационный",
        "isCorrect": false
      },
      {
        "text": "паспортный",
        "isCorrect": false
      },
      {
        "text": "атрибутивный способ",
        "isCorrect": true
      },
      {
        "text": "метрический",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для биометрической идентификации человека используются…",
    "answers": [
      {
        "text": "магнитная карта, узоры сетчатки глаз, форма кисти руки, динамика подписи",
        "isCorrect": false
      },
      {
        "text": "папиллярные узоры пальцев, узоры сетчатки глаз, форма кисти руки, магнитная карта",
        "isCorrect": false
      },
      {
        "text": "папиллярные узоры пальцев, узоры сетчатки глаз, форма кисти руки, динамика подписи",
        "isCorrect": true
      },
      {
        "text": "папиллярные узоры пальцев, узоры сетчатки глаз, магнитная карта, динамика подписи",
        "isCorrect": false
      },
      {
        "text": "папиллярные узоры пальцев, магнитная карта, форма кисти руки, динамика подписи",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под чем понимается изменение характеристик речевого сигнала таким образом, что полученный модулированный сигнал, обладая свойствами неразборчивости и неузнаваемости, занимает такую полосу частот спектра, как исходный открытый?",
    "answers": [
      {
        "text": "скремблирование",
        "isCorrect": true
      },
      {
        "text": "имплантация",
        "isCorrect": false
      },
      {
        "text": "внедрение",
        "isCorrect": false
      },
      {
        "text": "импортирование",
        "isCorrect": false
      },
      {
        "text": "экспортирование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как называются устройства метод защиты, в которых используются частотная инверсия спектра сигнала?",
    "answers": [
      {
        "text": "локатор",
        "isCorrect": false
      },
      {
        "text": "дозатор",
        "isCorrect": false
      },
      {
        "text": "коммутатор",
        "isCorrect": false
      },
      {
        "text": "маскиратор",
        "isCorrect": true
      },
      {
        "text": "генератор",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что обеспечивает локализацию источника звука в замкнутом пространстве?",
    "answers": [
      {
        "text": "Теплоизоляция",
        "isCorrect": false
      },
      {
        "text": "Теплопоглощение",
        "isCorrect": false
      },
      {
        "text": "Звукоизоляция",
        "isCorrect": true
      },
      {
        "text": "Звукопоглощение",
        "isCorrect": false
      },
      {
        "text": "Локализация",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "При помощи чего осуществляется преобразование кинетической энергии звуковой волны в тепловую энергию?",
    "answers": [
      {
        "text": "Теплопоглощение",
        "isCorrect": false
      },
      {
        "text": "Звукоизоляция",
        "isCorrect": false
      },
      {
        "text": "Звукопоглощение",
        "isCorrect": true
      },
      {
        "text": "Теплоизоляция",
        "isCorrect": false
      },
      {
        "text": "Локализация",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Средство борьбы с закладными подслушивающими устройствами делятся на:",
    "answers": [
      {
        "text": "средства на радиоконтроля помещения, средства поиска излучающих закладок, средство подавления закладных устройств",
        "isCorrect": false
      },
      {
        "text": "средства на радиоконтроля помещения, средства поиска неизлучающих закладок, средство подавления внутренних устройств",
        "isCorrect": false
      },
      {
        "text": "средства на радиоконтроля помещения, средства поиска неизлучающих закладок, средство подавления закладных устройств",
        "isCorrect": true
      },
      {
        "text": "средства на аудиоконтроля помещения, средства поиска неизлучающих закладок, средство подавления закладных устройств",
        "isCorrect": false
      },
      {
        "text": "средства на аудиоконтроля помещения, средства поиска излучающих закладок, средство подавления закладных устройств",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для подавления закладок используется:",
    "answers": [
      {
        "text": "порождение новых объектов-потомков от существующих объектов-родителей",
        "isCorrect": false
      },
      {
        "text": "генераторы помех, средства нарушения функционирования закладок, средства разрушения закладок",
        "isCorrect": true
      },
      {
        "text": "объединение данных и обрабатывающих их методов внутри класса",
        "isCorrect": false
      },
      {
        "text": "особый тип записи, имеющий в своем составе такие элементы, как поля, свойства и методы",
        "isCorrect": false
      },
      {
        "text": "данные, содержащиеся в классе",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Исходными данными для вычисления кэш-функции являются исходная двоичная последовательность и ….",
    "answers": [
      {
        "text": "стартовый вектор кэши­рования",
        "isCorrect": true
      },
      {
        "text": "последовательный вектор кэши­рования",
        "isCorrect": false
      },
      {
        "text": "главный вектор кэши­рования",
        "isCorrect": false
      },
      {
        "text": "второстепенный вектор кэши­рования",
        "isCorrect": false
      },
      {
        "text": "основной вектор кэши­рования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Стартовый вектор кэширования представляет собой дво­ичную последовательность длиной …",
    "answers": [
      {
        "text": "256 бит",
        "isCorrect": true
      },
      {
        "text": "64 бита",
        "isCorrect": false
      },
      {
        "text": "128 бит",
        "isCorrect": false
      },
      {
        "text": "512 бит",
        "isCorrect": false
      },
      {
        "text": "1024 бит",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под криптографической защитой информации понимается…",
    "answers": [
      {
        "text": "такое преобразование исходной информации, в результате кото­рого она становится недоступной для ознакомления и использо­вания лицами, имеющими на это полномочия.",
        "isCorrect": false
      },
      {
        "text": "такое преобразование исходной информации, в результате кото­рого она становится недоступной для ознакомления и использо­вания лицами, не имеющими на это полномочий.",
        "isCorrect": true
      },
      {
        "text": "защита дискет, flash – дисков и т.п.",
        "isCorrect": false
      },
      {
        "text": "такое преобразование исходной информации, в результате кото­рого она становится доступной для ознакомления и использо­вания лицами, не имеющими на это полномочий.",
        "isCorrect": false
      },
      {
        "text": "такое преобразование исходной информации, в результате кото­рого она уничтожается.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс шифрования заключается в проведении обратимых математических, логических, комбинаторных и других преобразо­ваний исходной информации, в результате которых зашифрованная информация  представляет собой:",
    "answers": [
      {
        "text": "хаотический  набор букв, цифр, других символов и двоичных кодов",
        "isCorrect": true
      },
      {
        "text": "такое преобразование исходной информации, в результате кото­рого она уничтожается.",
        "isCorrect": false
      },
      {
        "text": "формулы, графики и т.п.",
        "isCorrect": false
      },
      {
        "text": "упорядоченный набор букв, цифр, других символов и двоичных кодов",
        "isCorrect": false
      },
      {
        "text": "картинку, аудиозапись, видеозапись и т.п.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой метод позволяют скрыть не только смысл хранящейся или передаваемой информации, но и сам факт хранения или передачи закрытой информации?",
    "answers": [
      {
        "text": "криптография",
        "isCorrect": false
      },
      {
        "text": "стреганография",
        "isCorrect": false
      },
      {
        "text": "стенгазета",
        "isCorrect": false
      },
      {
        "text": "пиктограмма",
        "isCorrect": false
      },
      {
        "text": "стеганография",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Сжатие информации может быть отнесено к методам:",
    "answers": [
      {
        "text": "пиктографического преобразования информации",
        "isCorrect": false
      },
      {
        "text": "дуалографического преобразования информации",
        "isCorrect": false
      },
      {
        "text": "монографического преобразования информации",
        "isCorrect": false
      },
      {
        "text": "крипто­графического преобразования информации",
        "isCorrect": true
      },
      {
        "text": "стеганографического преобразования информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования закрытой ин­формации в открытую - …",
    "answers": [
      {
        "text": "кодировка",
        "isCorrect": false
      },
      {
        "text": "зашифровка",
        "isCorrect": false
      },
      {
        "text": "расшифрование",
        "isCorrect": true
      },
      {
        "text": "криптоанализ",
        "isCorrect": false
      },
      {
        "text": "моноанализ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования открытой информации в зашиф­рованную информацию - …",
    "answers": [
      {
        "text": "шифрование",
        "isCorrect": true
      },
      {
        "text": "кодировка",
        "isCorrect": false
      },
      {
        "text": "зашифровка",
        "isCorrect": false
      },
      {
        "text": "расшифрование",
        "isCorrect": false
      },
      {
        "text": "криптоанализ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "… - совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрова­ния",
    "answers": [
      {
        "text": "Метод шифрования",
        "isCorrect": true
      },
      {
        "text": "Метод  расшифрования",
        "isCorrect": false
      },
      {
        "text": "Метод  криптоанализа",
        "isCorrect": false
      },
      {
        "text": "Метод  кодировки",
        "isCorrect": false
      },
      {
        "text": "Метод  зашифровки",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Стойкость шифра противостоять криптоанализу…",
    "answers": [
      {
        "text": "криптостойкость",
        "isCorrect": true
      },
      {
        "text": "криптографичность",
        "isCorrect": false
      },
      {
        "text": "криптострогость",
        "isCorrect": false
      },
      {
        "text": "криптопрочность",
        "isCorrect": false
      },
      {
        "text": "криптоломкость",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Аддитивные методы шифрования называют…",
    "answers": [
      {
        "text": "программированием",
        "isCorrect": false
      },
      {
        "text": "гаммированием",
        "isCorrect": true
      },
      {
        "text": "пломбированием",
        "isCorrect": false
      },
      {
        "text": "криптостроением",
        "isCorrect": false
      },
      {
        "text": "заменой",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Система Эль-Гамаля…",
    "answers": [
      {
        "text": "использует коды, не исправляющие ошибки",
        "isCorrect": false
      },
      {
        "text": "использует ключ большой длины и получаемый шифртекст в два раза превышает длину исходного текста.",
        "isCorrect": false
      },
      {
        "text": "основана на сложности вычисления дис­кретных логарифмов в бесконечных полях",
        "isCorrect": false
      },
      {
        "text": "основана на сложности вычисления дис­кретных логарифмов в конечных полях",
        "isCorrect": true
      },
      {
        "text": "использует коды, исправляющие ошибки",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Криптосистема Мак-Элиса…",
    "answers": [
      {
        "text": "использует коды, исправляющие ошибки",
        "isCorrect": true
      },
      {
        "text": "использует ключ большой длины и получаемый шифртекст в два раза превышает длину исходного текста.",
        "isCorrect": false
      },
      {
        "text": "использует коды, не исправляющие ошибки",
        "isCorrect": false
      },
      {
        "text": "основана на сложности вычисления дис­кретных логарифмов в бесконечных полях",
        "isCorrect": false
      },
      {
        "text": "основана на сложности вычисления дис­кретных логарифмов в конечных полях",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Стандарт США на шифрование информации…",
    "answers": [
      {
        "text": "DES",
        "isCorrect": true
      },
      {
        "text": "DESC",
        "isCorrect": false
      },
      {
        "text": "DEF",
        "isCorrect": false
      },
      {
        "text": "DEP",
        "isCorrect": false
      },
      {
        "text": "DEFC",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "DES – это…",
    "answers": [
      {
        "text": "Стандарт СНГ на шифрование информации",
        "isCorrect": false
      },
      {
        "text": "Стандарт Германии на шифрование информации",
        "isCorrect": false
      },
      {
        "text": "Стандарт США на шифрование информации",
        "isCorrect": true
      },
      {
        "text": "Стандарт ООН на шифрование информации",
        "isCorrect": false
      },
      {
        "text": "Российский стандарт на шифрование информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какая система использует коды, исправляющие ошибки?",
    "answers": [
      {
        "text": "Ронина",
        "isCorrect": false
      },
      {
        "text": "Мак-Элиса",
        "isCorrect": true
      },
      {
        "text": "Мак-Элвиса",
        "isCorrect": false
      },
      {
        "text": "Эль-Гамаля",
        "isCorrect": false
      },
      {
        "text": "Перова",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какая система основана на сложности вычисления дис­кретных логарифмов в конечных полях?",
    "answers": [
      {
        "text": "Мак-Элиса",
        "isCorrect": false
      },
      {
        "text": "Перова",
        "isCorrect": false
      },
      {
        "text": "Эль-Гамаля",
        "isCorrect": true
      },
      {
        "text": "Мак-Элвиса",
        "isCorrect": false
      },
      {
        "text": "Ронина",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "К какому методу относится гаммирование?",
    "answers": [
      {
        "text": "аддитивному",
        "isCorrect": true
      },
      {
        "text": "адьютивного",
        "isCorrect": false
      },
      {
        "text": "абвиатурного",
        "isCorrect": false
      },
      {
        "text": "криптозащитному",
        "isCorrect": false
      },
      {
        "text": "криптоактивному",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Криптостойкость это…",
    "answers": [
      {
        "text": "Стойкость шифра подвергаться криптоанализу",
        "isCorrect": false
      },
      {
        "text": "Стойкость шифра противостоять криптоанализу",
        "isCorrect": true
      },
      {
        "text": "Стойкость шифра к расшифровке",
        "isCorrect": false
      },
      {
        "text": "Стойкость шифра к шифрованию",
        "isCorrect": false
      },
      {
        "text": "Стойкость шифра не  противостоять криптоанализу",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методом шифрования называют…",
    "answers": [
      {
        "text": "Совокупность необратимых преобразований закрытой информации в закрытую информацию в соответствии с алгоритмом шифрова­ния",
        "isCorrect": false
      },
      {
        "text": "Совокупность необратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрова­ния",
        "isCorrect": false
      },
      {
        "text": "Совокупность обратимых преобразований закрытой информации в закрытую информацию в соответствии с алгоритмом шифрова­ния",
        "isCorrect": false
      },
      {
        "text": "Совокупность обратимых преобразований открытой информации в открытую информацию в соответствии с алгоритмом шифрова­ния",
        "isCorrect": false
      },
      {
        "text": "Совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрова­ния",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Стеганография – это…",
    "answers": [
      {
        "text": "метод позволяет скрыть не только смысл хранящейся или передаваемой информации, но и сам факт хранения или передачи закрытой информации",
        "isCorrect": true
      },
      {
        "text": "метод гаммирования",
        "isCorrect": false
      },
      {
        "text": "метод позволяет скрыть не только смысл хранящейся или передаваемой информации, но и сам факт хранения или передачи открытой информации",
        "isCorrect": false
      },
      {
        "text": "аддетивный метод",
        "isCorrect": false
      },
      {
        "text": "метод позволяет открыть не только смысл хранящейся или передаваемой информации, но и сам факт хранения или передачи закрытой информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Преобразование исходной информации, в результате кото­рого она становится недоступной для ознакомления и использо­вания лицами, не имеющими на это полномочий это…",
    "answers": [
      {
        "text": "гистографическая защита информации",
        "isCorrect": false
      },
      {
        "text": "мегаграфическая защита информации",
        "isCorrect": false
      },
      {
        "text": "криптографическая защита информации",
        "isCorrect": true
      },
      {
        "text": "монографическая защита информации",
        "isCorrect": false
      },
      {
        "text": "пиктографическая защита информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методы шифрования классифицируются:",
    "answers": [
      {
        "text": "по сложности",
        "isCorrect": false
      },
      {
        "text": "по типу ключа",
        "isCorrect": true
      },
      {
        "text": "по типу алгоритма",
        "isCorrect": false
      },
      {
        "text": "по скорости",
        "isCorrect": false
      },
      {
        "text": "по важности",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Атака на шифр – это…",
    "answers": [
      {
        "text": "стеганоанализ",
        "isCorrect": false
      },
      {
        "text": "криптоанализ",
        "isCorrect": true
      },
      {
        "text": "моноанализ",
        "isCorrect": false
      },
      {
        "text": "профанализ",
        "isCorrect": false
      },
      {
        "text": "пиктоанализ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под Криптостойкостью  понимается…",
    "answers": [
      {
        "text": "Стойкость шифра не  противостоять криптоанализу",
        "isCorrect": false
      },
      {
        "text": "Стойкость шифра подвергаться криптоанализу",
        "isCorrect": false
      },
      {
        "text": "Стойкость шифра к шифрованию",
        "isCorrect": false
      },
      {
        "text": "Стойкость шифра противостоять криптоанализу",
        "isCorrect": true
      },
      {
        "text": "Стойкость шифра к расшифровке",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Одним из путей добывания информации о недостатках системы защиты является…",
    "answers": [
      {
        "text": "изучение механизмов работы техники",
        "isCorrect": false
      },
      {
        "text": "изучение механизмов работы персонала",
        "isCorrect": false
      },
      {
        "text": "изучение механизмов защиты",
        "isCorrect": true
      },
      {
        "text": "изучение механизмов атаки",
        "isCorrect": false
      },
      {
        "text": "изучение механизмов структуры",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является целью сжатия информации?",
    "answers": [
      {
        "text": "Увеличение объема информации",
        "isCorrect": false
      },
      {
        "text": "Криптографическое преобразование информации",
        "isCorrect": false
      },
      {
        "text": "Перемещение информации",
        "isCorrect": false
      },
      {
        "text": "Обработка информации",
        "isCorrect": false
      },
      {
        "text": "Сокращение объема информа­ции",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "…  - это процесс преобразования открытой информации в закрытую",
    "answers": [
      {
        "text": "Перешифрование",
        "isCorrect": false
      },
      {
        "text": "Криптографирование",
        "isCorrect": false
      },
      {
        "text": "Кодирование",
        "isCorrect": false
      },
      {
        "text": "Сжатие",
        "isCorrect": false
      },
      {
        "text": "Зашифрование",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Процесс преобразования закрытой ин­формации в открытую получил название:",
    "answers": [
      {
        "text": "кодирование",
        "isCorrect": false
      },
      {
        "text": "нет правильного ответа",
        "isCorrect": false
      },
      {
        "text": "криптографирование",
        "isCorrect": false
      },
      {
        "text": "сжатие",
        "isCorrect": false
      },
      {
        "text": "расшифрование",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Сущность … методов шифрования заключается в последовательном суммировании цифровых кодов, соответст­вующих символам исходной информации, с последовательностью кодов, которая соответствует некоторому кортежу символов.",
    "answers": [
      {
        "text": "символьных",
        "isCorrect": false
      },
      {
        "text": "правильного ответа нет",
        "isCorrect": false
      },
      {
        "text": "цифровых",
        "isCorrect": false
      },
      {
        "text": "информационных",
        "isCorrect": false
      },
      {
        "text": "аддитивных",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Аддитивные методы шифрования называют также…",
    "answers": [
      {
        "text": "гаммированием",
        "isCorrect": true
      },
      {
        "text": "сжатием",
        "isCorrect": false
      },
      {
        "text": "кодированием",
        "isCorrect": false
      },
      {
        "text": "суммированием",
        "isCorrect": false
      },
      {
        "text": "шифрованием",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Криптографическая защита информации  - это",
    "answers": [
      {
        "text": "стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера за счет  нестандартных приемов исполнения отдельных команд, нарушения общепринятых соглашений",
        "isCorrect": false
      },
      {
        "text": "как заключение в проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации",
        "isCorrect": false
      },
      {
        "text": "такое преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющимим на это полномочий",
        "isCorrect": true
      },
      {
        "text": "локализованная, минимизированная, четко ограниченную  и надежно изолированную совокупность программно-аппаратных механизмов, доказательно правильно реализующих функции диспетчера доступа",
        "isCorrect": false
      },
      {
        "text": "в виде аппаратно- программных механизмов и обеспечивает необходимую дисциплину разграничения доступа субъектов к объектам доступа",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В чем заключается процесс шифрования?",
    "answers": [
      {
        "text": "Замена смысловых конструкций исходной информации (слов, предложений) кодами",
        "isCorrect": false
      },
      {
        "text": "Это метод криптографического преобразования информации с определенными оговорками",
        "isCorrect": false
      },
      {
        "text": "Процесс преобразования открытой информации в зашифрованную информацию или процесс преобразования зашифрованной информации в открытую",
        "isCorrect": false
      },
      {
        "text": "В проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации",
        "isCorrect": true
      },
      {
        "text": "Это совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Система разграничения доступа к информации должна содержать четыре функциональных блока. Какие это блоки?",
    "answers": [
      {
        "text": "Блок хранения программ ядра, диспетчер доступа, блок очистки памяти, блок создания специализированных КС",
        "isCorrect": false
      },
      {
        "text": "блок идентификации и аутентификации субъектов доступа, блок оснащения универсальных КС дополнительными средствами КС, диспетчер доступа",
        "isCorrect": false
      },
      {
        "text": "блок идентификации и аутентификации субъектов доступа, диспетчер  доступа, блок криптографического преобразования информации при ее хранении и передаче, блок очистки памяти",
        "isCorrect": true
      },
      {
        "text": "блок многоуровневого режима выполнения команд, блок исполнения ключей защиты и сегментирования памяти, блок аппаратной реализации части функции ОС, блок хранения программ ядра",
        "isCorrect": false
      },
      {
        "text": "блок создания специализированных КС, блок очистки памяти, блок хранения программ ядра, блок аппаратной реализации части функции ОС",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Имеются два пути получения защитных от НСД КС. Какие это пути?",
    "answers": [
      {
        "text": "Аппаратная реализация части функции ОС, хранения программ ядра в постоянном запоминающем устройстве",
        "isCorrect": false
      },
      {
        "text": "использование новых архитектур ЭВМ, многоуровневый режим выполнения команд",
        "isCorrect": false
      },
      {
        "text": "Создание специализированных КС, оснащение универсальных КС дополнительными средствами защиты",
        "isCorrect": true
      },
      {
        "text": "Использование ключей защиты, сегментирование памяти",
        "isCorrect": false
      },
      {
        "text": "Диспетчер доступа, блок очистки памяти",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Программные системы защиты в качестве идентификатора используют…",
    "answers": [
      {
        "text": "кортеж",
        "isCorrect": false
      },
      {
        "text": "каталог",
        "isCorrect": false
      },
      {
        "text": "пароль",
        "isCorrect": true
      },
      {
        "text": "имя",
        "isCorrect": false
      },
      {
        "text": "файл",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "После завершения работы на ПЭВМ осуществляется запись контрольных характеристик файлов. Куда они записываются?",
    "answers": [
      {
        "text": "В кортеж или файл пользователя",
        "isCorrect": false
      },
      {
        "text": "На карту или кортеж пользователя",
        "isCorrect": false
      },
      {
        "text": "На карту или жетон пользователя",
        "isCorrect": true
      },
      {
        "text": "На жетон или файл пользователя",
        "isCorrect": false
      },
      {
        "text": "В папку или каталог пользователя",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Угроза несанкционированного копирования информации блокируется методами, которые распределены по двум группам. На какие?",
    "answers": [
      {
        "text": "Методы препятствующие использованию информации, методы, создания специализируемых КС",
        "isCorrect": false
      },
      {
        "text": "Методы, хранения программ ядра, методы, аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Методы, многоуровневого режима выполнения команд, методы, исполнения ключей защиты и сегментирования памяти",
        "isCorrect": false
      },
      {
        "text": "Методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС",
        "isCorrect": false
      },
      {
        "text": "Методы, затрудняющие считывание скопированной информации, методы, препятствующие исполнению  информации",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Архивация - …",
    "answers": [
      {
        "text": "Это нестандартная структура программы",
        "isCorrect": false
      },
      {
        "text": "Это такой стиль программирования, который вызывает нарушение правильной работы ПК",
        "isCorrect": false
      },
      {
        "text": "Это скрытые переходы, вызовы процедур, возвраты из них  и из прерываний",
        "isCorrect": false
      },
      {
        "text": "Это простейшее шифрование",
        "isCorrect": true
      },
      {
        "text": "Это модификация исполняемых кодов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под шифрованием понимается…",
    "answers": [
      {
        "text": "процесс преобразования открытой информации в зашифрованную информацию или процесс преобразования зашифрованной информации в открытую",
        "isCorrect": true
      },
      {
        "text": "такое преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющими на это полномочий",
        "isCorrect": false
      },
      {
        "text": "стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера за счет  нестандартных приемов исполнения отдельных команд, нарушения общепринятых соглашений",
        "isCorrect": false
      },
      {
        "text": "замена смысловых конструкций исходной информации (слов, предложений) кодами",
        "isCorrect": false
      },
      {
        "text": "совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под … понимается процесс преобразования открытой информации в закрытую",
    "answers": [
      {
        "text": "зашифрование",
        "isCorrect": true
      },
      {
        "text": "кришифрование",
        "isCorrect": false
      },
      {
        "text": "подшифрование",
        "isCorrect": false
      },
      {
        "text": "расшифрование",
        "isCorrect": false
      },
      {
        "text": "шифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Преобразование закрытой информации в открытую это …",
    "answers": [
      {
        "text": "надшифрование",
        "isCorrect": false
      },
      {
        "text": "зашифрование",
        "isCorrect": false
      },
      {
        "text": "расшифрование",
        "isCorrect": true
      },
      {
        "text": "шифрование",
        "isCorrect": false
      },
      {
        "text": "подшифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Основным показателем эффективности шифра является…",
    "answers": [
      {
        "text": "Криптошифр",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость",
        "isCorrect": true
      },
      {
        "text": "Криптоморозность",
        "isCorrect": false
      },
      {
        "text": "Криптонадежность",
        "isCorrect": false
      },
      {
        "text": "Криптоанализ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является основным показателем эффективности шифра?",
    "answers": [
      {
        "text": "Криптоанализ",
        "isCorrect": false
      },
      {
        "text": "Криптонадежность",
        "isCorrect": false
      },
      {
        "text": "Криптошифр",
        "isCorrect": false
      },
      {
        "text": "Криптоморозность",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Назовите основные методы криптографического преобразования информации.",
    "answers": [
      {
        "text": "Методы, затрудняющие считывание скопированной информации, методы, препятствующие исполнению  информации, методы, многоуровневого режима выполнения команд, методы, исполнения ключей защиты и сегментирования памяти;",
        "isCorrect": false
      },
      {
        "text": "Методы препятствующие использованию информации, методы, создания специализируемых КС, архивация;",
        "isCorrect": false
      },
      {
        "text": "Методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС, методы, хранения программ ядра, методы, аппаратной реализации части функции ОС;",
        "isCorrect": false
      },
      {
        "text": "Шифрование, стенография, кодирование, сжатие;",
        "isCorrect": true
      },
      {
        "text": "Криптостойкость, криптоанализ, криптошифр, криптонадежность;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс шифрования  заключается ?",
    "answers": [
      {
        "text": "Это метод криптографического преобразования информации с определенными оговорками;",
        "isCorrect": false
      },
      {
        "text": "Это совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрования;",
        "isCorrect": false
      },
      {
        "text": "В проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации;",
        "isCorrect": true
      },
      {
        "text": "Процесс преобразования открытой информации в зашифрованную информацию или процесс преобразования зашифрованной информации в открытую;",
        "isCorrect": false
      },
      {
        "text": "Замена смысловых конструкций исходной информации (слов, предложений) кодами;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под … понимается такое преобразование исходной информации, в результате кото­рого она становится недоступной для ознакомления и использо­вания лицами, не имеющими на это полномочий.",
    "answers": [
      {
        "text": "криптографической защитой информации",
        "isCorrect": true
      },
      {
        "text": "защитой информации",
        "isCorrect": false
      },
      {
        "text": "процессом шифрования",
        "isCorrect": false
      },
      {
        "text": "исходной информацией",
        "isCorrect": false
      },
      {
        "text": "классификацией",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методы криптографического преобразования информации:",
    "answers": [
      {
        "text": "шифрование, разархивация, кодирование, сжатие",
        "isCorrect": false
      },
      {
        "text": "шифрование, стеганография, алгоритмирование, сжатие",
        "isCorrect": false
      },
      {
        "text": "архивация, стеганография, кодирование, сжатие",
        "isCorrect": false
      },
      {
        "text": "шифрование, стеганография, кодирование, сжатие",
        "isCorrect": true
      },
      {
        "text": "шифрование, стеганография, кодирование, блокирование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой процесс заключается в проведении обратимых математических, логических, комбинаторных и других преобразо­ваний исходной информации?",
    "answers": [
      {
        "text": "кодирование",
        "isCorrect": false
      },
      {
        "text": "сжатие",
        "isCorrect": false
      },
      {
        "text": "шифрование",
        "isCorrect": true
      },
      {
        "text": "стеганография",
        "isCorrect": false
      },
      {
        "text": "блокирование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Метод … позволяет скрыть не только смысл хранящейся или передаваемой информации, но и сам факт хранения или передачи закрытой информации",
    "answers": [
      {
        "text": "сжатия",
        "isCorrect": false
      },
      {
        "text": "архивирования",
        "isCorrect": false
      },
      {
        "text": "шифрования",
        "isCorrect": false
      },
      {
        "text": "кодирования",
        "isCorrect": false
      },
      {
        "text": "стеганографии",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Содержанием процесса … информации является замена смысловых конструкций исходной информации (слов, предложений) кодами.",
    "answers": [
      {
        "text": "стеганографии",
        "isCorrect": false
      },
      {
        "text": "кодирования",
        "isCorrect": true
      },
      {
        "text": "разархивирования",
        "isCorrect": false
      },
      {
        "text": "сжатия",
        "isCorrect": false
      },
      {
        "text": "шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерные вирусы – это …",
    "answers": [
      {
        "text": "вирусы, не изменяющие среду обитания (файлы и секто­ры) при распространении;",
        "isCorrect": false
      },
      {
        "text": "небольшие исполняемые или интерпретируемые программы, обладающие свойством распро­странения и самовоспроизведения (репликации) в КС;",
        "isCorrect": true
      },
      {
        "text": "большие исполняемые или интерпретируемые программы, обладающие свойством распро­странения и самовоспроизведения (репликации) в КС;",
        "isCorrect": false
      },
      {
        "text": "вирусы, которые вызывают существен­ное  снижение эффективной        КС, но не приводящие к нарушению целостности и конфиденциальности информации, хранящей­ся в запоминающих устройствах;",
        "isCorrect": false
      },
      {
        "text": "вирусы размещаются в исполняемых файлах;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По среде обитания компьютерные вирусы делятся на …",
    "answers": [
      {
        "text": "вирусы-«спутники», вирусы-«черви», резидентные;",
        "isCorrect": false
      },
      {
        "text": "резидентные, нерезидентные, комбинированные;",
        "isCorrect": false
      },
      {
        "text": "нерезидентные, очень опасные вирусы, файловые;",
        "isCorrect": false
      },
      {
        "text": "безвредные вирусы, опасные вирусы, очень опасные вирусы;",
        "isCorrect": false
      },
      {
        "text": "сетевые, файловые, загрузочные, комбинированные;",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Средой обитания сетевых вирусов являются элементы …",
    "answers": [
      {
        "text": "компьютерных сетей;",
        "isCorrect": true
      },
      {
        "text": "исполняемых файлах;",
        "isCorrect": false
      },
      {
        "text": "во внешних запоминающих устройствах;",
        "isCorrect": false
      },
      {
        "text": "в книгах;",
        "isCorrect": false
      },
      {
        "text": "в некоторых средах обитания;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Файловые вирусы размещаются в…",
    "answers": [
      {
        "text": "в некоторых средах обитания;",
        "isCorrect": false
      },
      {
        "text": "в загрузочных секторах;",
        "isCorrect": false
      },
      {
        "text": "в книгах;",
        "isCorrect": false
      },
      {
        "text": "исполняемых файлах;",
        "isCorrect": true
      },
      {
        "text": "во внешних запоминающихся устройствах;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Загрузочные вирусы находятся в …",
    "answers": [
      {
        "text": "блок-схемах;",
        "isCorrect": false
      },
      {
        "text": "в книгах;",
        "isCorrect": false
      },
      {
        "text": "загрузочных секторах (областях) внешних запоминающих устройств;",
        "isCorrect": true
      },
      {
        "text": "некоторых средах обитания;",
        "isCorrect": false
      },
      {
        "text": "исполняемых файлах;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Как еще называют загрузочные вирусы?",
    "answers": [
      {
        "text": "Битовые",
        "isCorrect": false
      },
      {
        "text": "Шифровальными",
        "isCorrect": false
      },
      {
        "text": "Сетевые",
        "isCorrect": false
      },
      {
        "text": "Разбитые",
        "isCorrect": false
      },
      {
        "text": "Бутовыми",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Какие вирусы  размещаются в нескольких средах обитания?",
    "answers": [
      {
        "text": "Резидентные",
        "isCorrect": false
      },
      {
        "text": "Нерезидентные",
        "isCorrect": false
      },
      {
        "text": "Комбинированные",
        "isCorrect": true
      },
      {
        "text": "Сетевые",
        "isCorrect": false
      },
      {
        "text": "Бутовые",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Термин «компьютерный вирус» был введен в середине…",
    "answers": [
      {
        "text": "70-х гг.;",
        "isCorrect": false
      },
      {
        "text": "80-х гг.;",
        "isCorrect": true
      },
      {
        "text": "60-х гг.;",
        "isCorrect": false
      },
      {
        "text": "65-х гг.;",
        "isCorrect": false
      },
      {
        "text": "90-х гг.;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По способу заражения среды обитания компьютерные виру­сы делятся на …",
    "answers": [
      {
        "text": "безвредные вирусы, опасные вирусы;",
        "isCorrect": false
      },
      {
        "text": "резидентные, нерезидентные;",
        "isCorrect": true
      },
      {
        "text": "загрузочные, комбинированные;",
        "isCorrect": false
      },
      {
        "text": "сетевые, файловые;",
        "isCorrect": false
      },
      {
        "text": "опасные, очень опасные вирусы;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Куда перемещаются резидентные вирусы после их активации?",
    "answers": [
      {
        "text": "В монитор;",
        "isCorrect": false
      },
      {
        "text": "В дисковод;",
        "isCorrect": false
      },
      {
        "text": "В оперативную память ЭВМ;",
        "isCorrect": true
      },
      {
        "text": "В процессор;",
        "isCorrect": false
      },
      {
        "text": "В видео карту;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По степени опасности для информационных ресурсов поль­зователя компьютерные вирусы можно разделить на:",
    "answers": [
      {
        "text": "файловые, резидентные, нерезидентные;",
        "isCorrect": false
      },
      {
        "text": "сетевые, файловые, загрузочные;",
        "isCorrect": false
      },
      {
        "text": "загрузочные, комбинированные, резидентные;",
        "isCorrect": false
      },
      {
        "text": "безвредные вирусы, опасные вирусы, очень опасные вирусы;",
        "isCorrect": true
      },
      {
        "text": "загрузочные, комбинированные, нерезидентные;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы существенно снижают эффективность КС, но не приводят к нарушению целостности и конфиденциальности информации, хранящейся в запоминающихся устройствах?",
    "answers": [
      {
        "text": "Сетевые вирусы;",
        "isCorrect": false
      },
      {
        "text": "Безвредные вирусы;",
        "isCorrect": false
      },
      {
        "text": "Загрузочные вирусы;",
        "isCorrect": false
      },
      {
        "text": "Очень опасные вирусы;",
        "isCorrect": false
      },
      {
        "text": "Опасные вирусы;",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Вирусы, вызывающие нарушение конфиденциальности, уничтожение, необратимую модификацию информации, а также виру­сы, блокирующие доступ к информации, приводящие к отказу ап­паратных средств и наносящие ущерб здоровью пользователям следует считать вирусы…",
    "answers": [
      {
        "text": "комбинированные;",
        "isCorrect": false
      },
      {
        "text": "безвредные;",
        "isCorrect": false
      },
      {
        "text": "опасные;",
        "isCorrect": true
      },
      {
        "text": "загрузочные;",
        "isCorrect": false
      },
      {
        "text": "очень опасные;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В соответствии с особенностями алгоритма функциониро­вания вирусы можно разделить на два класса:",
    "answers": [
      {
        "text": "вирусы, не изменяющие среду обитания при распространении, вирусы, изменяющие среду обитания при распростране­нии",
        "isCorrect": true
      },
      {
        "text": "вирусы, способные самоуничтожаться, вирусы, не способные самоуничтожаться;",
        "isCorrect": false
      },
      {
        "text": "опасные вирусы, очень опасные вирусы;",
        "isCorrect": false
      },
      {
        "text": "безвредные вирусы, вредные вирусы;",
        "isCorrect": false
      },
      {
        "text": "вирусы, не влияющие на распространение, вирусы, влияющие на распространение;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Свою очередь, вирусы, не изменяющие среду обитания, могут быть разделены на две группы:",
    "answers": [
      {
        "text": "сетевые, файловые;",
        "isCorrect": false
      },
      {
        "text": "вирусы-«спутники», вирусы-«черви»;",
        "isCorrect": true
      },
      {
        "text": "загрузочные, комбинированные;",
        "isCorrect": false
      },
      {
        "text": "резидентные, нерезидентные;",
        "isCorrect": false
      },
      {
        "text": "резидентные, очень опасные вирусы;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы не изменяют файлы?",
    "answers": [
      {
        "text": "Вирусы-«черви»;",
        "isCorrect": false
      },
      {
        "text": "Вирусы-«спутники»;",
        "isCorrect": true
      },
      {
        "text": "Комбинированные;",
        "isCorrect": false
      },
      {
        "text": "Сетевые;",
        "isCorrect": false
      },
      {
        "text": "Резидентные;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы попадают в рабочую станцию из сети, вычис­ляют адреса рассылки вируса по другим абонентам сети и осуще­ствляют передачу вируса?",
    "answers": [
      {
        "text": "Вирусы-«спутники»;",
        "isCorrect": false
      },
      {
        "text": "Очень опасные вирусы",
        "isCorrect": false
      },
      {
        "text": "Вирусы-«черви»;",
        "isCorrect": true
      },
      {
        "text": "Файловые вирусы;",
        "isCorrect": false
      },
      {
        "text": "Безвредные вирусы;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По сложности, степени совершенства и особенностям маски­ровки алгоритмов вирусы, изменяющие среду обитания, делятся на:",
    "answers": [
      {
        "text": "студенческие, «Стелс» - вирусы (вирусы-невидимки), полиморфные.",
        "isCorrect": true
      },
      {
        "text": "файловые, резидентные, нерезидентные;",
        "isCorrect": false
      },
      {
        "text": "вирусы-«спутники», вирусы-«черви», комбинированные;",
        "isCorrect": false
      },
      {
        "text": "сетевые, файловые, загрузочные;",
        "isCorrect": false
      },
      {
        "text": "очень опасные вирусы,  вирусы-«черви», загрузочные;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Вирусы, создатели которых имеют низкую квалификацию называют …",
    "answers": [
      {
        "text": "студенческими вирусами;",
        "isCorrect": true
      },
      {
        "text": "опасными вирусами;",
        "isCorrect": false
      },
      {
        "text": "«стелс» - вирусами;",
        "isCorrect": false
      },
      {
        "text": "резидентными вирусами;",
        "isCorrect": false
      },
      {
        "text": "файловыми вирусами;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы создаются квалифи­цированными специалистами, хорошо знающими принцип работы аппаратных средств и операционной системы, а также владеющи­ми навыками работы с машиноориентированными системами программирования?",
    "answers": [
      {
        "text": "«Стелс» - вирусы и полиморфные вирусы;",
        "isCorrect": true
      },
      {
        "text": "Вирусы-«черви», вирусы- «спутники»;",
        "isCorrect": false
      },
      {
        "text": "Резидентные, нерезидентные;",
        "isCorrect": false
      },
      {
        "text": "Вирусы, не изменяющие среду обитания (файлы и секто­ры) при распространении, вирусы, изменяющие среду обитания при распростране­нии",
        "isCorrect": false
      },
      {
        "text": "Безвредные вирусы, опасные вирусы;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы не имеют постоянных опознавательных групп-сигнатур?",
    "answers": [
      {
        "text": "Полиморфные вирусы;",
        "isCorrect": true
      },
      {
        "text": "Вирусы, изменяющие среду обитания;",
        "isCorrect": false
      },
      {
        "text": "Студенческие вирусы;",
        "isCorrect": false
      },
      {
        "text": "«Стелс» - вирусы;",
        "isCorrect": false
      },
      {
        "text": "Вирусы, не изменяющие среду обитания;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Первый макровирус WinWord. Concept, поражающий доку­менты Word, появился летом …",
    "answers": [
      {
        "text": "1996 года",
        "isCorrect": false
      },
      {
        "text": "1995 года",
        "isCorrect": true
      },
      {
        "text": "1998 года",
        "isCorrect": false
      },
      {
        "text": "1999 года",
        "isCorrect": false
      },
      {
        "text": "1997 года",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы заражают загрузочные (Boot) сектора гибких дисков и Boot-сектора или Master Boot Record (MBR) же­стких дисков?",
    "answers": [
      {
        "text": "Вирусы, не изменяющие среду обитания;",
        "isCorrect": false
      },
      {
        "text": "Резидентные вирусы;",
        "isCorrect": false
      },
      {
        "text": "Комбинированные вирусы;",
        "isCorrect": false
      },
      {
        "text": "Сетевые вирусы;",
        "isCorrect": false
      },
      {
        "text": "Загрузочные вирусы;",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Назовите один из самых простых методов обнаружения вирусов.",
    "answers": [
      {
        "text": "Сканирование;",
        "isCorrect": true
      },
      {
        "text": "Эвристический анализ;",
        "isCorrect": false
      },
      {
        "text": "Аппаратно-программная защита от вирусов;",
        "isCorrect": false
      },
      {
        "text": "Вакцинирование программ;",
        "isCorrect": false
      },
      {
        "text": "Обнаружение изменений;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой метод обнаружения вирусов базируется на использование программ-ревизоров?",
    "answers": [
      {
        "text": "Вакцинирование программ;",
        "isCorrect": false
      },
      {
        "text": "Сканирование",
        "isCorrect": false
      },
      {
        "text": "Полиморфные вирусы",
        "isCorrect": false
      },
      {
        "text": "Метод обнаружения изменений",
        "isCorrect": true
      },
      {
        "text": "Аппаратно-программная защита от вирусов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой метод обнаружения вирусов сравнительно недавно начал использоваться для обнаружения вирусов?",
    "answers": [
      {
        "text": "Эвристический анализ;",
        "isCorrect": true
      },
      {
        "text": "Аппаратно-программная защита от вирусов",
        "isCorrect": false
      },
      {
        "text": "Вакцинирование программ;",
        "isCorrect": false
      },
      {
        "text": "Сканирование",
        "isCorrect": false
      },
      {
        "text": "Полиморфные вирусы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой метод обнаружения вирусов основан на применении программ, которые постоянно находятся в ОП ЭВМ и отслеживают все действия остальных программ?",
    "answers": [
      {
        "text": "Метод  использования аппаратно-программной защиты от вирусов;",
        "isCorrect": false
      },
      {
        "text": "Метод использования резидентных сторожей;",
        "isCorrect": true
      },
      {
        "text": "Метод использования  полиморфных вирусов;",
        "isCorrect": false
      },
      {
        "text": "Метод использования эвристического анализа;",
        "isCorrect": false
      },
      {
        "text": "Метод использования вакцинированных программ;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что понимается под созданием специального модуля для контроля ее целостности?",
    "answers": [
      {
        "text": "Аппаратно-программная защита от вирусов;",
        "isCorrect": false
      },
      {
        "text": "Эвристический анализ;",
        "isCorrect": false
      },
      {
        "text": "Использование резидентных сторожей;",
        "isCorrect": false
      },
      {
        "text": "Вакцинация программ;",
        "isCorrect": true
      },
      {
        "text": "Полиморфные вирусы;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Метод обнаружения изменений базируется на использовании …",
    "answers": [
      {
        "text": "программ-помощников;",
        "isCorrect": false
      },
      {
        "text": "программ-ревизоров;",
        "isCorrect": true
      },
      {
        "text": "простых программ;",
        "isCorrect": false
      },
      {
        "text": "программ-охранников;",
        "isCorrect": false
      },
      {
        "text": "программ-сторожей;",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По способу заражения среды обитания компьютерные  вирусы делятся на:",
    "answers": [
      {
        "text": "файловые, загрузочные",
        "isCorrect": false
      },
      {
        "text": "сетевые, комбинированные",
        "isCorrect": false
      },
      {
        "text": "безвредные, опасные",
        "isCorrect": false
      },
      {
        "text": "вирусы-«спутники», вирусы-«червы»",
        "isCorrect": false
      },
      {
        "text": "резидентные, нерезидентные",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Под криптографической защитой информации понимается…",
    "answers": [
      {
        "text": "стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера за счет  нестандартных приемов исполнения отдельных команд, нарушения общепринятых соглашений",
        "isCorrect": false
      },
      {
        "text": "локализованная, минимизированная, четко ограниченную  и надежно изолированную совокупность программно-аппаратных механизмов, доказательно правильно реализующих функции диспетчера доступа",
        "isCorrect": false
      },
      {
        "text": "в виде аппаратно- программных механизмов и обеспечивает необходимую дисциплину разграничения доступа субъектов к объектам доступа",
        "isCorrect": false
      },
      {
        "text": "такое преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющимим на это полномочий",
        "isCorrect": true
      },
      {
        "text": "как заключение в проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В чем заключается процесс шифрования?",
    "answers": [
      {
        "text": "В проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации",
        "isCorrect": true
      },
      {
        "text": "Это совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрования",
        "isCorrect": false
      },
      {
        "text": "Это метод криптографического преобразования информации с определенными оговорками",
        "isCorrect": false
      },
      {
        "text": "Процесс преобразования открытой информации в зашифрованную информацию или процесс преобразования зашифрованной информации в открытую",
        "isCorrect": false
      },
      {
        "text": "Замена смысловых конструкций исходной информации (слов, предложений) кодами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие функциональные блоки должна содержать система разграничения доступа к информации?",
    "answers": [
      {
        "text": "Блок хранения программ ядра, диспетчер доступа, блок очистки памяти, блок создания специализированных КС",
        "isCorrect": false
      },
      {
        "text": "Блок создания специализированных КС, блок очистки памяти, блок хранения программ ядра, блок аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Блок многоуровневого режима выполнения команд, блок исполнения ключей защиты и сегментирования памяти, блок аппаратной реализации части функции ОС, блок хранения программ ядра",
        "isCorrect": false
      },
      {
        "text": "Блок идентификации и аутентификации субъектов доступа, блок оснащения универсальных КС дополнительными средствами КС, диспетчер доступа",
        "isCorrect": false
      },
      {
        "text": "Блок идентификации и аутентификации субъектов доступа, диспетчер  доступа, блок криптографического преобразования информации при ее хранении и передаче, блок очистки памяти",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "… используют в качестве идентификатора программные системы защиты",
    "answers": [
      {
        "text": "Каталог",
        "isCorrect": false
      },
      {
        "text": "Файл",
        "isCorrect": false
      },
      {
        "text": "Кортеж",
        "isCorrect": false
      },
      {
        "text": "Имя",
        "isCorrect": false
      },
      {
        "text": "Пароль",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Какими методами блокируется  угроза несанкционированного копирования информации?",
    "answers": [
      {
        "text": "Методы, многоуровневого режима выполнения команд, методы, исполнения ключей защиты и сегментирования памяти",
        "isCorrect": false
      },
      {
        "text": "Методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС",
        "isCorrect": false
      },
      {
        "text": "Методы, затрудняющие считывание скопированной информации, методы, препятствующие исполнению  информации",
        "isCorrect": true
      },
      {
        "text": "Методы, хранения программ ядра, методы, аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Методы препятствующие использованию информации, методы, создания специализируемых КС",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Существует несколько методов противодействия дизассемблирования. Что не входит в их число?",
    "answers": [
      {
        "text": "Архивация",
        "isCorrect": false
      },
      {
        "text": "«Обман» дизассемблера",
        "isCorrect": false
      },
      {
        "text": "Копирование",
        "isCorrect": true
      },
      {
        "text": "Шифрование",
        "isCorrect": false
      },
      {
        "text": "Исполнение самогенерирующих кодов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие механизмы вводятся для противодействия трассировки программы?",
    "answers": [
      {
        "text": "Скрытые переходы, вызовы процедур, возвраты из них и из прерываний",
        "isCorrect": false
      },
      {
        "text": "Нестандартная структура программы, модификация исполняемых кодов, «случайные» переходы",
        "isCorrect": false
      },
      {
        "text": "Изменение среды функционирования, модификация кодов программы, «случайные»  переходы",
        "isCorrect": true
      },
      {
        "text": "Модификация кодов программы, шифрование, использование самогенерирующих кодов",
        "isCorrect": false
      },
      {
        "text": "Исполнение самогенерирующих кодов, простейшее шифрование, «обман» дизассемблера",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "За счет чего выполняются «случайные» переходы?",
    "answers": [
      {
        "text": "За счет выполнения «случайного» перехода",
        "isCorrect": false
      },
      {
        "text": "За счет модификации исполняемых кодов",
        "isCorrect": false
      },
      {
        "text": "За счет несанкционированного доступа информации",
        "isCorrect": false
      },
      {
        "text": "За счет выполнения «неслучайного» перехода",
        "isCorrect": false
      },
      {
        "text": "За счет вычисления адресов переходов",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Шифрование - это…",
    "answers": [
      {
        "text": "замена смысловых конструкций исходной информации (слов, предложений) кодами",
        "isCorrect": false
      },
      {
        "text": "совокупность обратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрования",
        "isCorrect": false
      },
      {
        "text": "стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера за счет  нестандартных приемов исполнения отдельных команд, нарушения общепринятых соглашений",
        "isCorrect": false
      },
      {
        "text": "процесс преобразования открытой информации в зашифрованную информацию или процесс преобразования зашифрованной информации в открытую",
        "isCorrect": true
      },
      {
        "text": "такое преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющими на это полномочий",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "…  - это процесс преобразования открытой информации в закрытую",
    "answers": [
      {
        "text": "Зашифрование",
        "isCorrect": true
      },
      {
        "text": "Шифрование",
        "isCorrect": false
      },
      {
        "text": "Расшифрование",
        "isCorrect": false
      },
      {
        "text": "Подшифрование",
        "isCorrect": false
      },
      {
        "text": "Кришифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования закрытой информации в открытую называется…",
    "answers": [
      {
        "text": "шифрование",
        "isCorrect": false
      },
      {
        "text": "надшифрование",
        "isCorrect": false
      },
      {
        "text": "подшифрование",
        "isCorrect": false
      },
      {
        "text": "расшифрование",
        "isCorrect": true
      },
      {
        "text": "зашифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "… это основной показатель эффективности шифра",
    "answers": [
      {
        "text": "Криптошифр",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость",
        "isCorrect": true
      },
      {
        "text": "Криптоморозность",
        "isCorrect": false
      },
      {
        "text": "Криптоанализ",
        "isCorrect": false
      },
      {
        "text": "Криптонадежность",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Основными методами криптографического преобразования информации. Являются:",
    "answers": [
      {
        "text": "a, b, e, g",
        "isCorrect": true
      },
      {
        "text": "c, d, e, f",
        "isCorrect": false
      },
      {
        "text": "d, e, f, g",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d",
        "isCorrect": false
      },
      {
        "text": "b, c, d, e",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Коммуникационная подсистема включает в себя…",
    "answers": [
      {
        "text": "коммуникационные модули (КМ), каналы связи, концентраторы, межсетевые шлюзы, мосты",
        "isCorrect": true
      },
      {
        "text": "криптостойкость, криптоанализ, криптошифр, криптонадежность",
        "isCorrect": false
      },
      {
        "text": "скрытые переходы, вызовы процедур, возвраты из них и из прерываний",
        "isCorrect": false
      },
      {
        "text": "шифрование, стенография, кодирование, сжатие",
        "isCorrect": false
      },
      {
        "text": "исполнение самогенерирующих кодов, простейшее шифрование, «обман» дизассемблера",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что объединяет элементы сети в единую сеть?",
    "answers": [
      {
        "text": "Межсетевые шлюзы",
        "isCorrect": false
      },
      {
        "text": "Каналы связи",
        "isCorrect": true
      },
      {
        "text": "«Обман»",
        "isCorrect": false
      },
      {
        "text": "Пользовательская подсистема",
        "isCorrect": false
      },
      {
        "text": "Концентраторы",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для чего используют концентраторы?",
    "answers": [
      {
        "text": "Для представления собой множества сосредоточенных КС",
        "isCorrect": false
      },
      {
        "text": "Для связывания сегмента сети с одинаковыми сетевыми протоколами",
        "isCorrect": false
      },
      {
        "text": "Для связи сети с ЛВС или для связи сегментов глобальных сетей",
        "isCorrect": false
      },
      {
        "text": "Для объединения элементов сети в единую сеть",
        "isCorrect": false
      },
      {
        "text": "Для уплотнения информации перед передачей ее по высокоскоростным каналам",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Для чего используют межсетевые шлюзы?",
    "answers": [
      {
        "text": "Для уплотнения информации перед передачей ее по высокоскоростным каналам",
        "isCorrect": false
      },
      {
        "text": "Для связи сети с ЛВС или для связи сегментов глобальных сетей",
        "isCorrect": true
      },
      {
        "text": "Для связывания сегмента сети с одинаковыми сетевыми протоколами",
        "isCorrect": false
      },
      {
        "text": "Для представления собой множества сосредоточенных КС",
        "isCorrect": false
      },
      {
        "text": "Для объединения элементов сети в единую сеть",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Все потенциальные   преднамеренные угрозы безопасности информации делят на две группы. На какие?",
    "answers": [
      {
        "text": "Пассивные и активные",
        "isCorrect": true
      },
      {
        "text": "Электронные и механические",
        "isCorrect": false
      },
      {
        "text": "Коммуникационные и некоммуникационные",
        "isCorrect": false
      },
      {
        "text": "Пользовательские и абонентские",
        "isCorrect": false
      },
      {
        "text": "Информационные и неинформационные",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Укажите основные функции межсетевого экрана.",
    "answers": [
      {
        "text": "Шифрование, стенография, кодирование, сжатие",
        "isCorrect": false
      },
      {
        "text": "Коммуникационные модули (КМ), каналы связи, концентраторы, межсетевые шлюзы, мосты",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость, криптоанализ, криптошифр, криптонадежность",
        "isCorrect": false
      },
      {
        "text": "Методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС, методы, хранения программ ядра, методы, аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Фильтрация данных, исполнение экранизирующих агентов, трансляция адресов, регистрация событий",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Обмен идентификаторами применим, если…",
    "answers": [
      {
        "text": "происходит связывание сегментов сети с одинаковыми сетевыми протоколами",
        "isCorrect": false
      },
      {
        "text": "в сети используется симметрическое шифрование",
        "isCorrect": true
      },
      {
        "text": "происходит упрощение информации перед передачей ее по высокоскоростным каналам",
        "isCorrect": false
      },
      {
        "text": "реализуется контроль за информацией",
        "isCorrect": false
      },
      {
        "text": "происходит связь в сети с ЛВС или для связи сегментов глобальных сетей",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Если информация искажена умышленно, то ее называют…",
    "answers": [
      {
        "text": "коммерческой тайной",
        "isCorrect": false
      },
      {
        "text": "информацией",
        "isCorrect": false
      },
      {
        "text": "дезинформацией",
        "isCorrect": true
      },
      {
        "text": "истинной",
        "isCorrect": false
      },
      {
        "text": "государственной тайной",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой подход предложил Шрейдор?",
    "answers": [
      {
        "text": "Пассивный",
        "isCorrect": false
      },
      {
        "text": "Резидентный",
        "isCorrect": false
      },
      {
        "text": "Энтропийный",
        "isCorrect": false
      },
      {
        "text": "Тезаурусный",
        "isCorrect": true
      },
      {
        "text": "Криптостойкий",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерные  вирусы делятся на:",
    "answers": [
      {
        "text": "вирусы-«спутники», вирусы-«содружества»",
        "isCorrect": false
      },
      {
        "text": "резидентные, нерезидентные",
        "isCorrect": true
      },
      {
        "text": "сетевые, паутинные",
        "isCorrect": false
      },
      {
        "text": "файловые, без файловые",
        "isCorrect": false
      },
      {
        "text": "безвредные, опасные",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющими на это полномочий называется:",
    "answers": [
      {
        "text": "криптографической дезинформацией",
        "isCorrect": false
      },
      {
        "text": "читаемость секретной информации",
        "isCorrect": false
      },
      {
        "text": "не читаемость секретной информации",
        "isCorrect": false
      },
      {
        "text": "метод представления информации",
        "isCorrect": false
      },
      {
        "text": "криптографической защитой информации",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Основное понятие криптографической защиты информации это",
    "answers": [
      {
        "text": "стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера за счет  нестандартных приемов исполнения отдельных команд, нарушения общепринятых соглашений",
        "isCorrect": false
      },
      {
        "text": "заключение о проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации",
        "isCorrect": false
      },
      {
        "text": "локализованная, минимизированная, четко ограниченная  и надежно изолированная совокупность программно-аппаратных механизмов, доказательно правильно реализующих функции диспетчера доступа",
        "isCorrect": false
      },
      {
        "text": "вид аппаратно- программных механизмов  обеспечивающих необходимую дисциплину разграничения доступа субъектов к объектам доступа",
        "isCorrect": false
      },
      {
        "text": "такое преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющими на это полномочий",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Процесс шифрования основывается на:",
    "answers": [
      {
        "text": "методе криптографического преобразования информации с определенными оговорками",
        "isCorrect": false
      },
      {
        "text": "преобразовании открытой информации в зашифрованную информацию и ее последующем уничтожении",
        "isCorrect": false
      },
      {
        "text": "проведении обратимых математических, логических, комбинаторных и других преобразований исходной информации",
        "isCorrect": true
      },
      {
        "text": "совокупности обратимых преобразований открытой информации в закрытую информацию без возможности обратного процесса",
        "isCorrect": false
      },
      {
        "text": "замене смысловых конструкций исходной информации (слов, предложений) кодами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие блоки должна содержать система разграничения доступа к информации?",
    "answers": [
      {
        "text": "блок создания специализированных КС, блок очистки памяти, блок хранения программ ядра, блок аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Блок хранения программ ядра, диспетчер доступа, блок очистки памяти, блок создания специализированных КС",
        "isCorrect": false
      },
      {
        "text": "блок идентификации и аутентификации субъектов доступа, блок оснащения универсальных КС дополнительными средствами КС, диспетчер доступа",
        "isCorrect": false
      },
      {
        "text": "блок идентификации и аутентификации субъектов доступа, диспетчер  доступа, блок криптографического преобразования информации при ее хранении и передаче, блок очистки памяти",
        "isCorrect": true
      },
      {
        "text": "блок многоуровневого режима выполнения команд, блок исполнения ключей защиты и сегментирования памяти, блок аппаратной реализации части функции ОС, блок хранения программ ядра",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Чаще всего системы защиты в качестве идентификации используют…",
    "answers": [
      {
        "text": "каталог",
        "isCorrect": false
      },
      {
        "text": "кортеж",
        "isCorrect": false
      },
      {
        "text": "пароль",
        "isCorrect": true
      },
      {
        "text": "имя",
        "isCorrect": false
      },
      {
        "text": "файл",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие методы используются для защиты от несанкционированного копирования информации?",
    "answers": [
      {
        "text": "Методы, хранения программ ядра, методы, аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Методы, затрудняющие считывание скопированной информации, методы, препятствующие исполнению  информации",
        "isCorrect": true
      },
      {
        "text": "Методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС",
        "isCorrect": false
      },
      {
        "text": "Методы, многоуровневого режима выполнения команд, методы, исполнения ключей защиты и сегментирования памяти",
        "isCorrect": false
      },
      {
        "text": "Методы препятствующие использованию информации, методы, создания специализируемых КС",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Дизассемблер это:",
    "answers": [
      {
        "text": "программа, показывающая код программы в ассемблерном виде и транслирующая его на любой другой язык программирования",
        "isCorrect": false
      },
      {
        "text": "программа, скрывающая код ассемблера в программе",
        "isCorrect": false
      },
      {
        "text": "основная система защиты информации",
        "isCorrect": false
      },
      {
        "text": "программа, показывающая код программы в ассемблерном виде",
        "isCorrect": true
      },
      {
        "text": "программа, скрывающая заголовки программных процедур",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой метод не входит в систему противодействий дизассемблирования?",
    "answers": [
      {
        "text": "Архивация",
        "isCorrect": false
      },
      {
        "text": "Шифрование",
        "isCorrect": false
      },
      {
        "text": "Исполнение самогенерирующих кодов",
        "isCorrect": false
      },
      {
        "text": "Копирование",
        "isCorrect": true
      },
      {
        "text": "«Обман» дизассемблера",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Методы защиты от трассировки программы?",
    "answers": [
      {
        "text": "Нестандартная структура программы, использование сообщений при ошибки и указании на них адресов памяти",
        "isCorrect": false
      },
      {
        "text": "Исполнение самогенерирующих кодов, простейшее шифрование, «обман» дизассемблера",
        "isCorrect": false
      },
      {
        "text": "Изменение среды функционирования, модификация кодов программы, «случайные»  переходы",
        "isCorrect": true
      },
      {
        "text": "Скрытые переходы, вызовы процедур, возвраты из них и сообщении об этом",
        "isCorrect": false
      },
      {
        "text": "Стандартный вид программы и использование обработчиков ошибок, дешифрование, использование самогенерирующих кодов",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "«Случайные» переходы вызываются …",
    "answers": [
      {
        "text": "за счет выполнения «неслучайного» перехода",
        "isCorrect": false
      },
      {
        "text": "за счет выполнения «случайного» перехода",
        "isCorrect": false
      },
      {
        "text": "за счет модификации исполняемых кодов",
        "isCorrect": false
      },
      {
        "text": "за счет несанкционированного доступа информации",
        "isCorrect": false
      },
      {
        "text": "за счет вычисления адресов переходов",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Шифрование это…",
    "answers": [
      {
        "text": "такое преобразование исходной информации, в результате которого она становиться недоступной для ознакомления и использования лицами, не имеющими на это полномочий",
        "isCorrect": false
      },
      {
        "text": "процесс преобразования открытой информации в зашифрованную информацию или процесс преобразования зашифрованной информации в открытую",
        "isCorrect": true
      },
      {
        "text": "стиль программирования, который вызывает нарушение правильной работы стандартного дизассемблера за счет  нестандартных приемов исполнения отдельных команд, нарушения общепринятых соглашений",
        "isCorrect": false
      },
      {
        "text": "замена смысловых конструкций исходной информации (слов, предложений) кодами",
        "isCorrect": false
      },
      {
        "text": "совокупность необратимых преобразований открытой информации в закрытую информацию в соответствии с алгоритмом шифрования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования информации с открытого вида в закрытый, используя определенный алгоритм –",
    "answers": [
      {
        "text": "шифрование",
        "isCorrect": true
      },
      {
        "text": "искажение",
        "isCorrect": false
      },
      {
        "text": "кэширование",
        "isCorrect": false
      },
      {
        "text": "подшифрование",
        "isCorrect": false
      },
      {
        "text": "дешифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Процесс преобразования закрытой информации в открытую используя определенный алгоритм это:",
    "answers": [
      {
        "text": "дешифрование",
        "isCorrect": true
      },
      {
        "text": "зашифрование",
        "isCorrect": false
      },
      {
        "text": "надшифрование",
        "isCorrect": false
      },
      {
        "text": "подшифрование",
        "isCorrect": false
      },
      {
        "text": "шифрование",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Качественность шифра?",
    "answers": [
      {
        "text": "Криптоанализ",
        "isCorrect": false
      },
      {
        "text": "Криптоморозность",
        "isCorrect": false
      },
      {
        "text": "Криптонадежность",
        "isCorrect": false
      },
      {
        "text": "Криптошифр",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "К основным методам криптографического преобразования информации относят:",
    "answers": [
      {
        "text": "методы, затрудняющие считывание скопированной информации, методы, препятствующие исполнению  информации, методы, многоуровневого режима выполнения команд, методы, исполнения ключей защиты и сегментирования памяти",
        "isCorrect": false
      },
      {
        "text": "методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС, методы, хранения программ ядра, методы, аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "криптостойкость, криптоанализ, криптошифр, криптонадежность",
        "isCorrect": false
      },
      {
        "text": "методы препятствующие использованию информации, методы, создания специализируемых КС, архивация",
        "isCorrect": false
      },
      {
        "text": "шифрование, стеганографию, кодирование, сжатие",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Коммуникационная подсистема состоит из  следующих составляющих:",
    "answers": [
      {
        "text": "исполнение самогенерирующих кодов, простейшее шифрование, «обман» дизассемблера",
        "isCorrect": false
      },
      {
        "text": "скрытые переходы, вызовы процедур, возвраты из них и из прерываний",
        "isCorrect": false
      },
      {
        "text": "криптостойкость, криптоанализ, криптошифр, криптонадежность",
        "isCorrect": false
      },
      {
        "text": "коммуникационные модули (КМ), каналы связи, концентраторы, межсетевые шлюзы, мосты",
        "isCorrect": true
      },
      {
        "text": "шифрование, стеганография, кодирование, сжатие",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Средство, объединения элементов сети в единую сеть называется:",
    "answers": [
      {
        "text": "пользовательской подсистемой",
        "isCorrect": false
      },
      {
        "text": "«обманом»",
        "isCorrect": false
      },
      {
        "text": "межсетевыми люками",
        "isCorrect": false
      },
      {
        "text": "каналом связи",
        "isCorrect": true
      },
      {
        "text": "концентратором",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Концентраторы служат для:",
    "answers": [
      {
        "text": "объединения элементов сети в единую сеть",
        "isCorrect": false
      },
      {
        "text": "уплотнения информации перед передачей ее по высокоскоростным каналам",
        "isCorrect": true
      },
      {
        "text": "представления собой множества сосредоточенных КС",
        "isCorrect": false
      },
      {
        "text": "связывания сегмента сети с одинаковыми сетевыми протоколами",
        "isCorrect": false
      },
      {
        "text": "связи сети с ЛВС или для связи сегментов глобальных сетей",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Шлюзы используются для:",
    "answers": [
      {
        "text": "уплотнения информации перед передачей ее по высокоскоростным каналам",
        "isCorrect": false
      },
      {
        "text": "представления собой множества сосредоточенных КС",
        "isCorrect": false
      },
      {
        "text": "объединения элементов сети в единую сеть",
        "isCorrect": false
      },
      {
        "text": "связи сети с ЛВС или для связи сегментов глобальных сетей",
        "isCorrect": true
      },
      {
        "text": "связывания сегмента сети с одинаковыми сетевыми протоколами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "На какие группы делятся преднамеренные угрозы безопасности?",
    "answers": [
      {
        "text": "Информационные и неинформационные",
        "isCorrect": false
      },
      {
        "text": "Коммуникационные и некоммуникационные",
        "isCorrect": false
      },
      {
        "text": "Пользовательские и абонентские",
        "isCorrect": false
      },
      {
        "text": "Электронные и механические",
        "isCorrect": false
      },
      {
        "text": "Пассивные и активные",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Функции брандмауэра-",
    "answers": [
      {
        "text": "Шифрование, стенография, кодирование, сжатие",
        "isCorrect": false
      },
      {
        "text": "Криптостойкость, криптоанализ, криптошифр, криптонадежность",
        "isCorrect": false
      },
      {
        "text": "Коммуникационные модули (КМ), каналы связи, концентраторы, межсетевые шлюзы, мосты",
        "isCorrect": false
      },
      {
        "text": "Методы, оснащения универсальных КС дополнительными средствами, методы, создания специализированных КС, методы, хранения программ ядра, методы, аппаратной реализации части функции ОС",
        "isCorrect": false
      },
      {
        "text": "Фильтрация данных, исполнение экранизирующих агентов, трансляция адресов, регистрация событий",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Если … то применим обмен идентификаторами",
    "answers": [
      {
        "text": "в сети используется симметричное шифрование",
        "isCorrect": true
      },
      {
        "text": "реализуется контроль за информацией",
        "isCorrect": false
      },
      {
        "text": "происходит связывание сегментов сети с одинаковыми сетевыми протоколами",
        "isCorrect": false
      },
      {
        "text": "происходит упрощение информации перед передачей ее по высокоскоростным каналам",
        "isCorrect": false
      },
      {
        "text": "происходит связь в сети с ЛВС или для связи сегментов глобальных сетей",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Умышленным искажение информации является…",
    "answers": [
      {
        "text": "истинностью",
        "isCorrect": false
      },
      {
        "text": "государственной тайной",
        "isCorrect": false
      },
      {
        "text": "информацией",
        "isCorrect": false
      },
      {
        "text": "коммерческой тайной",
        "isCorrect": false
      },
      {
        "text": "дезинформацией",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Подход предложенный Шрейдором?",
    "answers": [
      {
        "text": "тезаурусный",
        "isCorrect": true
      },
      {
        "text": "пассивный",
        "isCorrect": false
      },
      {
        "text": "резидентный",
        "isCorrect": false
      },
      {
        "text": "энтропийный",
        "isCorrect": false
      },
      {
        "text": "криптостойкий",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Вирусы размещаемые в исполняемых файлах называются:",
    "answers": [
      {
        "text": "файловыми",
        "isCorrect": true
      },
      {
        "text": "загрузочными",
        "isCorrect": false
      },
      {
        "text": "стелсами",
        "isCorrect": false
      },
      {
        "text": "резидентными",
        "isCorrect": false
      },
      {
        "text": "комбинированными",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Вирусы, которые находятся в загрузочных секторах (областях) внешних запоминающих устройств (boot-секторах) называются",
    "answers": [
      {
        "text": "резидентными",
        "isCorrect": false
      },
      {
        "text": "загрузочными",
        "isCorrect": true
      },
      {
        "text": "файловыми",
        "isCorrect": false
      },
      {
        "text": "комбинированными",
        "isCorrect": false
      },
      {
        "text": "стелсами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Вирусы, которые размещаются в нескольких средах обитания",
    "answers": [
      {
        "text": "комбинированными",
        "isCorrect": true
      },
      {
        "text": "файловыми",
        "isCorrect": false
      },
      {
        "text": "резидентными",
        "isCorrect": false
      },
      {
        "text": "загрузочными",
        "isCorrect": false
      },
      {
        "text": "стелсами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Вирусы – невидимки называются",
    "answers": [
      {
        "text": "файловыми",
        "isCorrect": false
      },
      {
        "text": "резидентными",
        "isCorrect": false
      },
      {
        "text": "комбинированные",
        "isCorrect": false
      },
      {
        "text": "загрузочными",
        "isCorrect": false
      },
      {
        "text": "стелсами",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Файловые действия при форматировании жесткого диска используют команду",
    "answers": [
      {
        "text": "delet disk",
        "isCorrect": false
      },
      {
        "text": "config",
        "isCorrect": false
      },
      {
        "text": "delete files",
        "isCorrect": false
      },
      {
        "text": "format",
        "isCorrect": true
      },
      {
        "text": "defrag",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Вирусы, написанные с использование программы из пакета MS Office (MSword, MS Excel)",
    "answers": [
      {
        "text": "файловыми",
        "isCorrect": false
      },
      {
        "text": "загрузочными",
        "isCorrect": false
      },
      {
        "text": "резидентными",
        "isCorrect": false
      },
      {
        "text": "макровирусы",
        "isCorrect": true
      },
      {
        "text": "комбинированные",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие вирусы загружаются первыми",
    "answers": [
      {
        "text": "комбинированные",
        "isCorrect": false
      },
      {
        "text": "файловыми",
        "isCorrect": false
      },
      {
        "text": "макровирусы",
        "isCorrect": false
      },
      {
        "text": "резидентными",
        "isCorrect": false
      },
      {
        "text": "загрузочные",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Программы для борьбы с вирусом",
    "answers": [
      {
        "text": "девирусы",
        "isCorrect": false
      },
      {
        "text": "архиваторы",
        "isCorrect": false
      },
      {
        "text": "декодировщики",
        "isCorrect": false
      },
      {
        "text": "антивирусы",
        "isCorrect": true
      },
      {
        "text": "кодировщики",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Один из самых простых методов обнаружения вируса является:",
    "answers": [
      {
        "text": "сканирование",
        "isCorrect": true
      },
      {
        "text": "декурсия",
        "isCorrect": false
      },
      {
        "text": "рекурсия",
        "isCorrect": false
      },
      {
        "text": "обнаружение изменений",
        "isCorrect": false
      },
      {
        "text": "эвристический анализ",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация – это…",
    "answers": [
      {
        "text": "сведения о лицах, предметах, фактах, событиях, явлениях и процессах, независима от формы их представления.",
        "isCorrect": true
      },
      {
        "text": "сведения о лицах, предметах, недостатков, событиях, явлениях и процессах, зависима от формы их представления.",
        "isCorrect": false
      },
      {
        "text": "сведения о лицах, предметах, организаций, массах, явлениях и процессах, независима от формы их представления.",
        "isCorrect": false
      },
      {
        "text": "сведения о измерениях, предметах, фактах, событиях, явлениях и массах, независима от формы их представления.",
        "isCorrect": false
      },
      {
        "text": "сведения о тайнах, предметах, фактах, защитах, явлениях и процессах, независима от массы их представления.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "С помощью материальных средств можно защищать только…",
    "answers": [
      {
        "text": "материальные объекты.",
        "isCorrect": true
      },
      {
        "text": "кодированные объекты.",
        "isCorrect": false
      },
      {
        "text": "удаленные объекты.",
        "isCorrect": false
      },
      {
        "text": "установленные объекты.",
        "isCorrect": false
      },
      {
        "text": "скрытые объекты.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Если информация искажена умышлено, то её называют…",
    "answers": [
      {
        "text": "резинформацией.",
        "isCorrect": false
      },
      {
        "text": "классификацией.",
        "isCorrect": false
      },
      {
        "text": "дезинформацией.",
        "isCorrect": true
      },
      {
        "text": "незинформацией.",
        "isCorrect": false
      },
      {
        "text": "инсталляцией.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Зависимость ценности информации от времени приближения определения в соответствии с выражением…",
    "answers": [
      {
        "text": "S(I) = C0e-2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(t) = K2e-0.3t/",
        "isCorrect": false
      },
      {
        "text": "C(t) = C0e-2.3t/",
        "isCorrect": true
      },
      {
        "text": "C(v) = C04-2.3t/",
        "isCorrect": false
      },
      {
        "text": "C(t) = C1e-2.3t/",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация может быть получена тремя путями:",
    "answers": [
      {
        "text": "излечением, распознаванием, добыванием информации.",
        "isCorrect": false
      },
      {
        "text": "поиск научной информации, исследованием предметов, классификациям.",
        "isCorrect": false
      },
      {
        "text": "проведением научных исследований, покупкой информации, противоправным добыванием  информации.",
        "isCorrect": true
      },
      {
        "text": "научной информации, поиск, исследованием.",
        "isCorrect": false
      },
      {
        "text": "проведением научных исследований, изучением, поиск.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие существуют подходы к измерению количества информации?",
    "answers": [
      {
        "text": "обрабатываемый, тезаурусный, практический.",
        "isCorrect": false
      },
      {
        "text": "энтропийный, тезарусный, обрабатываемый.",
        "isCorrect": false
      },
      {
        "text": "практический, энтропийный, простой.",
        "isCorrect": false
      },
      {
        "text": "тезаурусный, неизвестный, простой.",
        "isCorrect": false
      },
      {
        "text": "энтропийный, тезаурусный, практический.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Формула Шеннона.",
    "answers": [
      {
        "text": "I = М A i log2Pт",
        "isCorrect": false
      },
      {
        "text": "L = N P2 log3P3",
        "isCorrect": false
      },
      {
        "text": "I = B Pi log2Pi",
        "isCorrect": false
      },
      {
        "text": "I = N Si log5Pi",
        "isCorrect": false
      },
      {
        "text": "I = N Pi log2Pi",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "В качестве предмета защиты рассматривается информация,…",
    "answers": [
      {
        "text": "хранящаяся, обрабатываемая и передаваемая к компьютерных системах.",
        "isCorrect": true
      },
      {
        "text": "обрабатываемая, независимая от компьютерных систем.",
        "isCorrect": false
      },
      {
        "text": "передаваемая, обрабатываемая, исходная.",
        "isCorrect": false
      },
      {
        "text": "хранящаяся, исходная компьютерным системам.",
        "isCorrect": false
      },
      {
        "text": "обрабатытываемая, используемая, восстановимая.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Объектом защиты информации является…",
    "answers": [
      {
        "text": "компьютерная система.",
        "isCorrect": true
      },
      {
        "text": "выгруженная система.",
        "isCorrect": false
      },
      {
        "text": "информационная система.",
        "isCorrect": false
      },
      {
        "text": "сложная система.",
        "isCorrect": false
      },
      {
        "text": "телевизионная система.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является компьютерной системой?",
    "answers": [
      {
        "text": "комплекс выгруженных средств.",
        "isCorrect": false
      },
      {
        "text": "комплекс аппаратных и программных средств.",
        "isCorrect": true
      },
      {
        "text": "комплекс аппаратных и неизвестных средств.",
        "isCorrect": false
      },
      {
        "text": "комплекс аппаратных и практических средств.",
        "isCorrect": false
      },
      {
        "text": "комплекс защищенных и программных средств",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Предметом защиты в КС является….",
    "answers": [
      {
        "text": "синхронизация.",
        "isCorrect": false
      },
      {
        "text": "компьютер.",
        "isCorrect": false
      },
      {
        "text": "информация.",
        "isCorrect": true
      },
      {
        "text": "защита.",
        "isCorrect": false
      },
      {
        "text": "программа.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В системе информация хранится…",
    "answers": [
      {
        "text": "в виртуальном устройстве.",
        "isCorrect": false
      },
      {
        "text": "в защитном устройстве.",
        "isCorrect": false
      },
      {
        "text": "в открытом устройстве.",
        "isCorrect": false
      },
      {
        "text": "в обычном устройстве.",
        "isCorrect": false
      },
      {
        "text": "в запоминающих устройствах.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "К какому классу относятся компьютерные системы?",
    "answers": [
      {
        "text": "информационно-машиных систем.",
        "isCorrect": false
      },
      {
        "text": "человеко-машинных систем.",
        "isCorrect": true
      },
      {
        "text": "компьютерно-машиных систем.",
        "isCorrect": false
      },
      {
        "text": "виртуально-машиных систем.",
        "isCorrect": false
      },
      {
        "text": "программно-машиных систем.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Безопасность информации в КС – это…",
    "answers": [
      {
        "text": "простое состояние.",
        "isCorrect": false
      },
      {
        "text": "такое состояние защиты.",
        "isCorrect": false
      },
      {
        "text": "такое состояние компьютерной системы.",
        "isCorrect": true
      },
      {
        "text": "программная безопасность.",
        "isCorrect": false
      },
      {
        "text": "безопасность компьютерной системы.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерная система, в которой обеспечивается безопасность информации,  называется…",
    "answers": [
      {
        "text": "свойственной.",
        "isCorrect": false
      },
      {
        "text": "открытой.",
        "isCorrect": false
      },
      {
        "text": "защищенной.",
        "isCorrect": true
      },
      {
        "text": "скрытой.",
        "isCorrect": false
      },
      {
        "text": "информационной.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Основным документом, на основе которого проводится политика информационной безопасности, называется…",
    "answers": [
      {
        "text": "скрытой информационной безопасности.",
        "isCorrect": false
      },
      {
        "text": "программой информационной безопасности.",
        "isCorrect": true
      },
      {
        "text": "безопасной информационной безопасности.",
        "isCorrect": false
      },
      {
        "text": "хранящей информационной безопасности.",
        "isCorrect": false
      },
      {
        "text": "исходной информационной безопасности.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под системой защиты информации в КС понимается…",
    "answers": [
      {
        "text": "большой комплекс правовых норм.",
        "isCorrect": false
      },
      {
        "text": "единый комплекс законных норм.",
        "isCorrect": false
      },
      {
        "text": "единый комплекс правовых норм.",
        "isCorrect": true
      },
      {
        "text": "единый набор правовых норм.",
        "isCorrect": false
      },
      {
        "text": "главных правовых норм.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие особенности имеет информация?",
    "answers": [
      {
        "text": "c,d,e",
        "isCorrect": false
      },
      {
        "text": "b,c,e",
        "isCorrect": false
      },
      {
        "text": "a,b,d",
        "isCorrect": true
      },
      {
        "text": "b,d,e",
        "isCorrect": false
      },
      {
        "text": "a,b,e",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация доступна человеку, если она …?",
    "answers": [
      {
        "text": "не содержится на материальном носителе",
        "isCorrect": false
      },
      {
        "text": "находится в его руках",
        "isCorrect": false
      },
      {
        "text": "зашифрована",
        "isCorrect": false
      },
      {
        "text": "содержится на материальном носителе",
        "isCorrect": true
      },
      {
        "text": "заархивирована",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Cо временем ценность информации...?",
    "answers": [
      {
        "text": "a,b,c",
        "isCorrect": false
      },
      {
        "text": "остается неизменной",
        "isCorrect": false
      },
      {
        "text": "увеличивается затем уменьшается",
        "isCorrect": false
      },
      {
        "text": "a,c",
        "isCorrect": false
      },
      {
        "text": "увеличивается",
        "isCorrect": false
      },
      {
        "text": "a,b,d",
        "isCorrect": false
      },
      {
        "text": "a,c,d",
        "isCorrect": false
      },
      {
        "text": "уменьшается затем увеличивается",
        "isCorrect": false
      },
      {
        "text": "b,c,d",
        "isCorrect": false
      },
      {
        "text": "уменьшается",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Кем предложен тезаурусный подход?",
    "answers": [
      {
        "text": "Ю.А. Шрайдером",
        "isCorrect": false
      },
      {
        "text": "Ю.А. Шредером",
        "isCorrect": false
      },
      {
        "text": "А.Ю. Шрайдером",
        "isCorrect": false
      },
      {
        "text": "Ю.А. Шрейдером",
        "isCorrect": true
      },
      {
        "text": "Ю.В. Шрюдером",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Понятие КС очень широкое и оно охватывает следующие системы:",
    "answers": [
      {
        "text": "a,b,c",
        "isCorrect": false
      },
      {
        "text": "a,b,d",
        "isCorrect": false
      },
      {
        "text": "b,c,d",
        "isCorrect": false
      },
      {
        "text": "a,c",
        "isCorrect": false
      },
      {
        "text": "a,c,d",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Что такое безопасность (защищенность) информации в КС?",
    "answers": [
      {
        "text": "Это дублирование информации.",
        "isCorrect": false
      },
      {
        "text": "Это общий алгоритм механизма защиты от несанкционированного использования программ в «чужой» среде.",
        "isCorrect": false
      },
      {
        "text": "Это такое состояние всех компонент компьютерной системы, при котором обеспечивается защита информации от возможных угроз на требуемом уровне.",
        "isCorrect": true
      },
      {
        "text": "Это процесс обработки и передачи информации техническими средствами КС.",
        "isCorrect": false
      },
      {
        "text": "Это большие возможности оказания вредительских воздействий на информацию КС.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Информация добывается с целью получения прибыли или преимуществ перед конкурентами, противоборствующими сторонами. Для этого информация:",
    "answers": [
      {
        "text": "b,c,d,e",
        "isCorrect": false
      },
      {
        "text": "c,d,e,a",
        "isCorrect": false
      },
      {
        "text": "a,b,c,e",
        "isCorrect": true
      },
      {
        "text": "a,b,d,e",
        "isCorrect": false
      },
      {
        "text": "a,b,c,d",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В качестве предмета защиты рассматривается информация, хранящаяся, обрабатываемая и передаваемая в компьютерных системах. Особенностями этой информации являются:",
    "answers": [
      {
        "text": "b,d",
        "isCorrect": false
      },
      {
        "text": "a,b,d",
        "isCorrect": true
      },
      {
        "text": "a,c,d",
        "isCorrect": false
      },
      {
        "text": "b,c,d",
        "isCorrect": false
      },
      {
        "text": "a,b,c",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Компьютерная система – это…?",
    "answers": [
      {
        "text": "система защиты от изучения и копирования.",
        "isCorrect": false
      },
      {
        "text": "автоматизированная система обработки данных.",
        "isCorrect": false
      },
      {
        "text": "комплекс аппаратных и проемных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации.",
        "isCorrect": true
      },
      {
        "text": "процесс обработки и передачи информации техническими средствами.",
        "isCorrect": false
      },
      {
        "text": "общий алгоритм механизма защиты от несанкционированного использования программ в «чужой» среде.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В КС под системой защиты информации  понимается?",
    "answers": [
      {
        "text": "Независимая (возможно разными организациями) разработка одного и того же блока.",
        "isCorrect": false
      },
      {
        "text": "Единый комплекс правовых норм, организационных мер, технических, программных и криптографических средств, обеспечивающий защищенность информации в КС в соответствии с принятой политикой безопасности.",
        "isCorrect": true
      },
      {
        "text": "Модуль анализа результатов тестирования.",
        "isCorrect": false
      },
      {
        "text": "Охрана помещений, в которых находятся аппаратные средства КС.",
        "isCorrect": false
      },
      {
        "text": "Автоматизированная система.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие существуют подходы к измерению количества информации?",
    "answers": [
      {
        "text": "a,c,d",
        "isCorrect": true
      },
      {
        "text": "a,d",
        "isCorrect": false
      },
      {
        "text": "a,b,d",
        "isCorrect": false
      },
      {
        "text": "b,c,d",
        "isCorrect": false
      },
      {
        "text": "a,b,c",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В каком году был принят Закон Республики Казахстан об информатизации?",
    "answers": [
      {
        "text": "25 декабря 2007 года.",
        "isCorrect": false
      },
      {
        "text": "11 января 2007 года.",
        "isCorrect": true
      },
      {
        "text": "25 февраля 2007 года.",
        "isCorrect": false
      },
      {
        "text": "25 апреля 2007 года.",
        "isCorrect": false
      },
      {
        "text": "25 марта 2007года.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Это качество информации оп­ределяется степенью ее полезности для владельца?",
    "answers": [
      {
        "text": "Энергия.",
        "isCorrect": false
      },
      {
        "text": "Масса.",
        "isCorrect": false
      },
      {
        "text": "Форма.",
        "isCorrect": false
      },
      {
        "text": "Ценность.",
        "isCorrect": true
      },
      {
        "text": "Скорость.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Выберите из списка все существующие подходы к измерению количества информации?",
    "answers": [
      {
        "text": "a,b,d",
        "isCorrect": false
      },
      {
        "text": "a,d",
        "isCorrect": false
      },
      {
        "text": "b,c,d",
        "isCorrect": false
      },
      {
        "text": "a,b,c",
        "isCorrect": false
      },
      {
        "text": "a,c,d",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "В выражении , где это-",
    "answers": [
      {
        "text": "время от возникновения информации.",
        "isCorrect": false
      },
      {
        "text": "достоверность.",
        "isCorrect": false
      },
      {
        "text": "важность.",
        "isCorrect": false
      },
      {
        "text": "ценность информации.",
        "isCorrect": true
      },
      {
        "text": "конфиденциальность.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Со временем ценность информации…",
    "answers": [
      {
        "text": "остается неизменной.",
        "isCorrect": false
      },
      {
        "text": "увеличивается.",
        "isCorrect": false
      },
      {
        "text": "уменьшается.",
        "isCorrect": true
      },
      {
        "text": "исчезает.",
        "isCorrect": false
      },
      {
        "text": "обесценивается.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По какой формуле может быть подсчитано количество информации в сообщении?",
    "answers": [
      {
        "text": "Шеннона.",
        "isCorrect": true
      },
      {
        "text": "Бернулли.",
        "isCorrect": false
      },
      {
        "text": "Шрейдера.",
        "isCorrect": false
      },
      {
        "text": "Штейнера.",
        "isCorrect": false
      },
      {
        "text": "Планка.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Тезаурус – это …",
    "answers": [
      {
        "text": "отдельные документы и отдельные массивы документов в информационных системах (библиотеках, архивах, фондах, банках данных и других инфор­мационных системах).",
        "isCorrect": false
      },
      {
        "text": "структурирован­ные знания, представленные в виде понятий и отношений между",
        "isCorrect": true
      },
      {
        "text": "компьютерная сис­тема или автоматизированная система обработки данных.",
        "isCorrect": false
      },
      {
        "text": "комплекс аппаратных и про­емных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации.",
        "isCorrect": false
      },
      {
        "text": "еди­ный комплекс правовых норм.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какова структура тезауруса?",
    "answers": [
      {
        "text": "Прямолинейная.",
        "isCorrect": false
      },
      {
        "text": "Иерархическая.",
        "isCorrect": true
      },
      {
        "text": "Параллельная.",
        "isCorrect": false
      },
      {
        "text": "Пересекающаяся.",
        "isCorrect": false
      },
      {
        "text": "Последовательная.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Если информация искажена умышленно, то ее называют…",
    "answers": [
      {
        "text": "дезинформацией.",
        "isCorrect": true
      },
      {
        "text": "недостоверной.",
        "isCorrect": false
      },
      {
        "text": "конфиденциальной.",
        "isCorrect": false
      },
      {
        "text": "материальной",
        "isCorrect": false
      },
      {
        "text": "нематериальной.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "в Формуле Шеннона  это-",
    "answers": [
      {
        "text": "объем информации.",
        "isCorrect": false
      },
      {
        "text": "вероятность появления в сообщении символа i.",
        "isCorrect": true
      },
      {
        "text": "ценность информации в момент ее возникновения (полу­чения).",
        "isCorrect": false
      },
      {
        "text": "время от момента возникно­вения информации до момента ее устаревания.",
        "isCorrect": false
      },
      {
        "text": "коли­чество символов в алфавите языка.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Комплекс аппаратных и программных средств, предназначенных для автоматизированного хранения, обработки, передачи и получения информации?",
    "answers": [
      {
        "text": "Компьютерная система.",
        "isCorrect": true
      },
      {
        "text": "Вредительские программы.",
        "isCorrect": false
      },
      {
        "text": "Безопасность (защищенность) информации в КС.",
        "isCorrect": false
      },
      {
        "text": "Объектом защиты информации.",
        "isCorrect": false
      },
      {
        "text": "Система защиты информации в КС.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Защищенность информации в КС – это",
    "answers": [
      {
        "text": "компьютерная система автоматизированная система обработки данных.",
        "isCorrect": false
      },
      {
        "text": "такое состояние всех компонент компьютерной системы, при ко­тором обеспечивается защита информации от возможных угроз на требуемом уровне.",
        "isCorrect": true
      },
      {
        "text": "информация, хранящаяся, обрабатываемая и передаваемая в компьютерных системах",
        "isCorrect": false
      },
      {
        "text": "программные криптографические средства, обеспечиваю­щий защищенность информации в КС.",
        "isCorrect": false
      },
      {
        "text": "политика информацион­ной безопасности.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какая информация является конфиденциальной?",
    "answers": [
      {
        "text": "Сведения, принадлежащие государству (государ­ственному учреждению).",
        "isCorrect": false
      },
      {
        "text": "Информация, искаженно представляющая действительность.",
        "isCorrect": false
      },
      {
        "text": "Информация, которая имеет себестоимость",
        "isCorrect": false
      },
      {
        "text": "Информация, которая с достаточной для владельца (поль­зователя) точностью отражает объекты и процессы окружающего фактора.",
        "isCorrect": false
      },
      {
        "text": "Если доступ к информации ограничивается.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Гриф ... может присваивается в  государственных учреждениях менее важной информации.",
    "answers": [
      {
        "text": "«коммерческая тайна»",
        "isCorrect": false
      },
      {
        "text": "«для служебного пользования»",
        "isCorrect": true
      },
      {
        "text": "«совершенно секретно»",
        "isCorrect": false
      },
      {
        "text": "«секретно»",
        "isCorrect": false
      },
      {
        "text": "«особой важности»",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какую тайну могут содержать сведения, принадлежащие государству (государ­ственному учреждению)?",
    "answers": [
      {
        "text": "Военную.",
        "isCorrect": false
      },
      {
        "text": "Корпоративную.",
        "isCorrect": false
      },
      {
        "text": "Государственную.",
        "isCorrect": true
      },
      {
        "text": "Коммерческую.",
        "isCorrect": false
      },
      {
        "text": "Служебную.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что позволяет определить Анализ формулы Шеннона?",
    "answers": [
      {
        "text": "Степень изменения знаний.",
        "isCorrect": false
      },
      {
        "text": "Количество информации, извлекаемое человеком из сообщения.",
        "isCorrect": false
      },
      {
        "text": "Затраты на передачу сообщения.",
        "isCorrect": true
      },
      {
        "text": "Количество информации.",
        "isCorrect": false
      },
      {
        "text": "Насколько полезна полученная информация.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В зависимости от права собственности электронные информационные ресурсы подразделяются на:",
    "answers": [
      {
        "text": "негосударственные и национальные.",
        "isCorrect": false
      },
      {
        "text": "частные и национальные.",
        "isCorrect": false
      },
      {
        "text": "государственные и негосударственные.",
        "isCorrect": true
      },
      {
        "text": "государственные и частные.",
        "isCorrect": false
      },
      {
        "text": "частные и негосударственные.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В зависимости от категории доступа электронные информационные ресурсы подразделяются на:",
    "answers": [
      {
        "text": "государственные и национальные.",
        "isCorrect": false
      },
      {
        "text": "национальные и частные.",
        "isCorrect": false
      },
      {
        "text": "частные и государственные.",
        "isCorrect": false
      },
      {
        "text": "общедоступные и ограниченного доступа.",
        "isCorrect": true
      },
      {
        "text": "негосударственные и государственные.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электронные информационные ресурсы, содержащие информацию, которая предоставляется или распространяется ее собственником или владельцем без указания условий ее использования, а также сведения, доступ к которым является свободным и не зависит от формы их представления и способа распространения, являются…",
    "answers": [
      {
        "text": "ограниченного доступа.",
        "isCorrect": false
      },
      {
        "text": "государственными.",
        "isCorrect": false
      },
      {
        "text": "общедоступными.",
        "isCorrect": true
      },
      {
        "text": "частные.",
        "isCorrect": false
      },
      {
        "text": "национальными.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электронные информационные ресурсы, содержащие сведения, доступ к которым ограничен законами Республики Казахстан или их собственником, или владельцем в случаях, установленных законодательством Республики Казахстан, являются…",
    "answers": [
      {
        "text": "негосударственными информационными ресурсами.",
        "isCorrect": false
      },
      {
        "text": "национальными информационными ресурсами.",
        "isCorrect": false
      },
      {
        "text": "частными информационными ресурсами.",
        "isCorrect": false
      },
      {
        "text": "общедоступными информационными ресурсами.",
        "isCorrect": false
      },
      {
        "text": "электронными информационными ресурсами ограниченного доступа.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Электронные информационные ресурсы, состоящие из государственных электронных информационных ресурсов, имеющих важное стратегическое значение для экономики и безопасности государства, являются…",
    "answers": [
      {
        "text": "негосударственные.",
        "isCorrect": false
      },
      {
        "text": "национальными.",
        "isCorrect": true
      },
      {
        "text": "частные.",
        "isCorrect": false
      },
      {
        "text": "государственными.",
        "isCorrect": false
      },
      {
        "text": "общедоступные.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электронные информационные ресурсы, создаваемые и приобретаемые за счет средств физических и юридических лиц, а также полученные ими путем иных установленных законами Республики Казахстан способов, являются…",
    "answers": [
      {
        "text": "национальными.",
        "isCorrect": false
      },
      {
        "text": "ограниченного доступа.",
        "isCorrect": false
      },
      {
        "text": "негосударственными.",
        "isCorrect": true
      },
      {
        "text": "частными.",
        "isCorrect": false
      },
      {
        "text": "государственными.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Государственные электронные информационные ресурсы Республики Казахстан являются общедоступными, за исключением…",
    "answers": [
      {
        "text": "национальных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "общедоступных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "государственных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "частных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "электронных информационных ресурсов ограниченного доступа.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Электронные информационные ресурсы ограниченного доступа подразделяются на электронные информационные ресурсы, отнесенные к…",
    "answers": [
      {
        "text": "пользовательские и частные.",
        "isCorrect": false
      },
      {
        "text": "общедоступные и пользовательские.",
        "isCorrect": false
      },
      {
        "text": "национальные и пользовательские.",
        "isCorrect": false
      },
      {
        "text": "общедоступные и национальные.",
        "isCorrect": false
      },
      {
        "text": "государственным секретам и конфиденциальные.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Деятельность государственных органов по формированию государственных электронных информационных ресурсов финансируется за счет…",
    "answers": [
      {
        "text": "бюджетных средств.",
        "isCorrect": true
      },
      {
        "text": "государства.",
        "isCorrect": false
      },
      {
        "text": "частных фирм.",
        "isCorrect": false
      },
      {
        "text": "научных институтов.",
        "isCorrect": false
      },
      {
        "text": "пользователей.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Предоставление электронных информационных ресурсов государственными органами, физическими и юридическими лицами является обязательным в случаях, предусмотренных …",
    "answers": [
      {
        "text": "статьей 7 Закона об информатизации.",
        "isCorrect": false
      },
      {
        "text": "статьей 15  Закона об информатизации.",
        "isCorrect": false
      },
      {
        "text": "статьей 14  Закона об информатизации.",
        "isCorrect": true
      },
      {
        "text": "статьей 24 Закона об информатизации.",
        "isCorrect": false
      },
      {
        "text": "статьей 9 Закона об информатизации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для электронных информационных ресурсов, содержащих персональные данные, соблюдение конфиденциальности обязательно с момента,",
    "answers": [
      {
        "text": "когда эти данные были представлены юридическим лицом, к которому эти данные не относятся.",
        "isCorrect": false
      },
      {
        "text": "когда эти данные были представлены физическим лицом, к которому эти данные относятся.",
        "isCorrect": true
      },
      {
        "text": "когда эти данные были представлены физическим лицом, к которому эти данные не относятся.",
        "isCorrect": false
      },
      {
        "text": "когда эти данные были представлены юридическим лицом, к которому эти данные относятся.",
        "isCorrect": false
      },
      {
        "text": "когда эти данные били представлены юридическому лицу.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Электронные информационные ресурсы, содержащие персональные данные о физических лицах, относятся к категории…",
    "answers": [
      {
        "text": "национальных электронных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "конфиденциальных электронных информационных ресурсов.",
        "isCorrect": true
      },
      {
        "text": "общедоступных электронных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "частных электронных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "государственных электронных информационных ресурсов.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Права на электронные информационные ресурсы, включенные в состав информационных систем, определяются соглашением   между…",
    "answers": [
      {
        "text": "пользователем и государством электронных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "собственниками электронных информационных ресурсов и информационных систем.",
        "isCorrect": true
      },
      {
        "text": "пользователем и собственником электронных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "государством и собственником электронных информационных ресурсов.",
        "isCorrect": false
      },
      {
        "text": "государством и собственником электронных информационных ресурсов.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По времени восстановления информации, методы дублиро­вания могут быть разделены на: a)оперативные; b)неоперативные; c)полного восстановления; d)частичного восстановления; e) восстановления оглавления;",
    "answers": [
      {
        "text": "a, b.",
        "isCorrect": true
      },
      {
        "text": "b, d.",
        "isCorrect": false
      },
      {
        "text": "d, e.",
        "isCorrect": false
      },
      {
        "text": "c, e.",
        "isCorrect": false
      },
      {
        "text": "a, c.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По используемым для целей дублирования средствам мето­ды дублирования можно разделить на методы, использующие: a) дополнительные    внешние    запоминающие    устройства (блоки). b)специально выделенные области памяти на несъемных машинных носителях. c) кэш-память. d) оперативную память. e) съемные носители информации.",
    "answers": [
      {
        "text": "a, b, e.",
        "isCorrect": true
      },
      {
        "text": "c, d, e.",
        "isCorrect": false
      },
      {
        "text": "b, c, e.",
        "isCorrect": false
      },
      {
        "text": "a, b, c.",
        "isCorrect": false
      },
      {
        "text": "b, d, e.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "По числу копий методы дублирования делятся на: a)одноуровневые. b) пятиуровневые. c) двухуровневые. d) трехуровневые. e) многоуровневые.",
    "answers": [
      {
        "text": "c,e.",
        "isCorrect": false
      },
      {
        "text": "a, e.",
        "isCorrect": true
      },
      {
        "text": "a,d.",
        "isCorrect": false
      },
      {
        "text": "d,e.",
        "isCorrect": false
      },
      {
        "text": "b,c.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В соответствии с процедурой дублирования различают ме­тоды:",
    "answers": [
      {
        "text": "a,b,c,d.",
        "isCorrect": true
      },
      {
        "text": "a,c,d,e.",
        "isCorrect": false
      },
      {
        "text": "b,c,d,e.",
        "isCorrect": false
      },
      {
        "text": "a,b,c,e.",
        "isCorrect": false
      },
      {
        "text": "a,b,d,e.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Зеркальным называют жест­кий магнитный диск…",
    "answers": [
      {
        "text": "отдельного накопителя, на котором хранится информация, частично  идентичная информации на рабочем дис­ке.",
        "isCorrect": false
      },
      {
        "text": "отдельного накопителя, на котором хранится информация, полностью идентичная информации на рабочем дис­ке.",
        "isCorrect": true
      },
      {
        "text": "отдельного накопителя, на котором хранится информация, полностью идентичная информации на  дис­ке.",
        "isCorrect": false
      },
      {
        "text": "отдельного накопителя, на котором хранится информация, полностью идентичная информации на рабочей дис­кете.",
        "isCorrect": false
      },
      {
        "text": "отдельного накопителя, на котором хранится информация.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под надежностью понимается…",
    "answers": [
      {
        "text": "система обладающая  избыточностью.",
        "isCorrect": false
      },
      {
        "text": "свойство системы выполнять возложенные на нее задачи в определенных условиях эксплуата­ции.",
        "isCorrect": true
      },
      {
        "text": "свойство системы выполнять возложенные на нее задачи.",
        "isCorrect": false
      },
      {
        "text": "свойство КС сохранять работоспо­собность при отказах отдельных устройств, блоков, схем.",
        "isCorrect": false
      },
      {
        "text": "свойство КС сохранять информацию.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Надежность КС достигается на этапах: a) разработки; b) производства; c) эксплуатации; d)утилизации;",
    "answers": [
      {
        "text": "a,b,c.",
        "isCorrect": true
      },
      {
        "text": "a,d.",
        "isCorrect": false
      },
      {
        "text": "b,c,d.",
        "isCorrect": false
      },
      {
        "text": "a,b,d.",
        "isCorrect": false
      },
      {
        "text": "a,c,d.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Свойство системы выполнять возложенные на нее задачи в определенных условиях эксплуата­ции.",
    "answers": [
      {
        "text": "Быстрота.",
        "isCorrect": false
      },
      {
        "text": "Работоспособность.",
        "isCorrect": false
      },
      {
        "text": "Отказоустойчивость.",
        "isCorrect": false
      },
      {
        "text": "Надежность.",
        "isCorrect": true
      },
      {
        "text": "Криптостойкость.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Отказоустойчивость – это…",
    "answers": [
      {
        "text": "свойство система обладающая  избыточностью.",
        "isCorrect": false
      },
      {
        "text": "свойство системы выполнять возложенные на нее задачи в определенных условиях эксплуата­ции.",
        "isCorrect": false
      },
      {
        "text": "свойство КС сохранять информацию.",
        "isCorrect": false
      },
      {
        "text": "свойство КС сохранять работоспо­собность при отказах отдельных устройств, блоков, схем.",
        "isCorrect": true
      },
      {
        "text": "свойство системы выполнять возложенные на нее задачи.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Простое резервирование основано на…",
    "answers": [
      {
        "text": "использовании устройств, блоков, узлов, схем только в качестве резервных.",
        "isCorrect": true
      },
      {
        "text": "выполнении определенных действий над рабочей и контрольной информацией определять ошибки.",
        "isCorrect": false
      },
      {
        "text": "принципе элегантной деградации.",
        "isCorrect": false
      },
      {
        "text": "возобновляется либо сначала, либо с последней контрольной точки.",
        "isCorrect": false
      },
      {
        "text": "использовании информационной избыточности.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Помехоустойчивое кодирование основано на…",
    "answers": [
      {
        "text": "выполнении определенных действий над рабочей и контрольной информацией определять ошибки.",
        "isCorrect": false
      },
      {
        "text": "возобновляется либо сначала, либо с последней контрольной точки.",
        "isCorrect": false
      },
      {
        "text": "использовании устройств, блоков, узлов, схем только в качестве резервных.",
        "isCorrect": false
      },
      {
        "text": "использовании информационной избыточности.",
        "isCorrect": true
      },
      {
        "text": "принципе элегантной деградации.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какие совершенные системы являются наиболее устойчивыми к отказам?",
    "answers": [
      {
        "text": "Адекватные системы.",
        "isCorrect": false
      },
      {
        "text": "Адаптационные системы.",
        "isCorrect": false
      },
      {
        "text": "Адаптивные системы.",
        "isCorrect": true
      },
      {
        "text": "Адаптерные системы.",
        "isCorrect": false
      },
      {
        "text": "Адлерские системы.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В каких системах реализуется так называемый принцип элегантной деградации?",
    "answers": [
      {
        "text": "В адекватных системах.",
        "isCorrect": false
      },
      {
        "text": "В адаптивных системах.",
        "isCorrect": true
      },
      {
        "text": "В адлерских системах.",
        "isCorrect": false
      },
      {
        "text": "В адаптационных системах.",
        "isCorrect": false
      },
      {
        "text": "В адаптерных системах.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "На какие методы защиты от электромагнитных излучений и наводок можно разделить?",
    "answers": [
      {
        "text": "Активные и неактивные.",
        "isCorrect": false
      },
      {
        "text": "Пассивные и экранированные.",
        "isCorrect": false
      },
      {
        "text": "Пассивные и неактивные.",
        "isCorrect": false
      },
      {
        "text": "Активные и пассивные.",
        "isCorrect": true
      },
      {
        "text": "Экранированные и активные.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Эти методы обеспечивают уменьшение уровня опасного сигнала или снижение информативности сигналов.",
    "answers": [
      {
        "text": "Электромагнитный метод.",
        "isCorrect": false
      },
      {
        "text": "Экранированный метод.",
        "isCorrect": false
      },
      {
        "text": "Пассивные методы.",
        "isCorrect": true
      },
      {
        "text": "Активные методы.",
        "isCorrect": false
      },
      {
        "text": "Криптографический метод.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является одним из самых эффективных мето­дов защиты от электромагнитных излучений?",
    "answers": [
      {
        "text": "Снижение информативности сигналов.",
        "isCorrect": false
      },
      {
        "text": "Электромагнитный метод.",
        "isCorrect": false
      },
      {
        "text": "Информативный метод.",
        "isCorrect": false
      },
      {
        "text": "Экранирование.",
        "isCorrect": true
      },
      {
        "text": "Снижение мощности излучений и наводок.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под……………… понимается размещение элементов КС, создающих электриче­ские, магнитные и электромагнитные поля, в пространственно замкнутых конструкциях.",
    "answers": [
      {
        "text": "экранированием",
        "isCorrect": true
      },
      {
        "text": "пассивным методом",
        "isCorrect": false
      },
      {
        "text": "электрическим полем",
        "isCorrect": false
      },
      {
        "text": "магнитным полем",
        "isCorrect": false
      },
      {
        "text": "электрическими сигналами",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "В зависимости от типа создаваемого электромагнитного поля различают следующие виды экранирования: а) экранирование электрического поля;",
    "answers": [
      {
        "text": "а, b, c.",
        "isCorrect": false
      },
      {
        "text": "b, e, d.",
        "isCorrect": false
      },
      {
        "text": "а, b, d.",
        "isCorrect": false
      },
      {
        "text": "b, c, e.",
        "isCorrect": false
      },
      {
        "text": "а, c, e.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Эти методы защиты направлены на создание помех в каналах побочных электромагнитных излучений и наводок, затрудняющих прием и выделение полезной информации из перехваченных злоумышленником сигналов.",
    "answers": [
      {
        "text": "Активные методы.",
        "isCorrect": true
      },
      {
        "text": "Электромагнитные методы.",
        "isCorrect": false
      },
      {
        "text": "Информативные методы.",
        "isCorrect": false
      },
      {
        "text": "Пассивные методы.",
        "isCorrect": false
      },
      {
        "text": "Электрические методы.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Изменения ……………. сводятся к изменению взаимного расположения отдельных узлов, блоков, кабелей, сокращению длины шин.",
    "answers": [
      {
        "text": "электрических схем",
        "isCorrect": false
      },
      {
        "text": "электромагнитных полей",
        "isCorrect": false
      },
      {
        "text": "узлов",
        "isCorrect": false
      },
      {
        "text": "конструкций",
        "isCorrect": true
      },
      {
        "text": "фильтров",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что  осуществляются для уменьше­ния мощности побочных излучений?",
    "answers": [
      {
        "text": "Изменение электрических схем.",
        "isCorrect": true
      },
      {
        "text": "Изменение конструкций.",
        "isCorrect": false
      },
      {
        "text": "Изменение узлов.",
        "isCorrect": false
      },
      {
        "text": "Изменение блоков.",
        "isCorrect": false
      },
      {
        "text": "Изменение фильтров.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Пассивные методы защиты от ПЭМИН подразделяются на:",
    "answers": [
      {
        "text": "a,b,c.",
        "isCorrect": true
      },
      {
        "text": "a,b,e.",
        "isCorrect": false
      },
      {
        "text": "b,c,e.",
        "isCorrect": false
      },
      {
        "text": "a,c,e.",
        "isCorrect": false
      },
      {
        "text": "c,d,e.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Это зашумление осуществляется за счет излучения с помощью антенн электромагнитных сигналов в пространство",
    "answers": [
      {
        "text": "Механическое зашумление.",
        "isCorrect": false
      },
      {
        "text": "Линейное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Пространственное зашумление.",
        "isCorrect": true
      },
      {
        "text": "Магнитное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Электромагнитное зашумление.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Локальное пространственное зашумление применяется для ……..",
    "answers": [
      {
        "text": "защиты от электромагнитных излучений",
        "isCorrect": false
      },
      {
        "text": "защи­ты конкретного элемента КС",
        "isCorrect": true
      },
      {
        "text": "защиты от магнитных полей",
        "isCorrect": false
      },
      {
        "text": "защиты КС",
        "isCorrect": false
      },
      {
        "text": "защиты от экранирования",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Это зашумление используется для защиты от побочных электромагнитных излуче­ний КС всего объекта.",
    "answers": [
      {
        "text": "Объектовое пространственное зашумление.",
        "isCorrect": true
      },
      {
        "text": "Пространственное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Линейное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Локальное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Локально пространственное зашумление.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "При использовании  ……………… генераторы при­цельных помех подключаются к токопроводящим линиям для создания в них электрических помех, которые не позволяют зло­умышленникам выделять наведенные сигналы.",
    "answers": [
      {
        "text": "физического зашумления",
        "isCorrect": false
      },
      {
        "text": "пространственного зашумления",
        "isCorrect": false
      },
      {
        "text": "линейного зашумления",
        "isCorrect": true
      },
      {
        "text": "локального зашумления",
        "isCorrect": false
      },
      {
        "text": "электромагнитного зашумления",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Это зашумление должно обеспечивать невоз­можность выделения побочных излучений на фоне создаваемых помех во всех диапазонах излучения и, вместе с тем, уровень соз­даваемых помех не должен превышать санитарных норм и норм по электромагнитной совместимости радиоэлектронной аппарату­ры.",
    "answers": [
      {
        "text": "Линейное зашумления.",
        "isCorrect": false
      },
      {
        "text": "Электромагнитное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Механическое зашумление.",
        "isCorrect": false
      },
      {
        "text": "Пространственное зашумление.",
        "isCorrect": true
      },
      {
        "text": "Локально пространственное зашумление.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Это зашумление осуществляется, как правило, несколькими гене­раторами со своими антеннами, что позволяет создавать помехи во всех диапазонах побочных электромагнитных излучений всех излучающих устройств объекта.",
    "answers": [
      {
        "text": "Механическое зашумление.",
        "isCorrect": false
      },
      {
        "text": "Объектовое пространственное зашумление.",
        "isCorrect": true
      },
      {
        "text": "Пространственное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Магнитное зашумление.",
        "isCorrect": false
      },
      {
        "text": "Локально пространственное зашумление.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Экранирование осуществляется на пяти уровнях:",
    "answers": [
      {
        "text": "a,c,e,d,f",
        "isCorrect": false
      },
      {
        "text": "a,b,e,d,f",
        "isCorrect": false
      },
      {
        "text": "a,b,c,e,f",
        "isCorrect": false
      },
      {
        "text": "a,c,d,e,f",
        "isCorrect": true
      },
      {
        "text": "a,b,c,d,f",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Полностью исключается попадание побочных наведенных сигналов во внешнюю цепь электропитания при наличии генера­торов питания, которые обеспечивают …………………… между первичной и вторичной цепями.",
    "answers": [
      {
        "text": "использование фильтров",
        "isCorrect": false
      },
      {
        "text": "изменение конструкций",
        "isCorrect": false
      },
      {
        "text": "использование оптических каналов связи",
        "isCorrect": false
      },
      {
        "text": "изменение электрических схем",
        "isCorrect": false
      },
      {
        "text": "гальваническую развязку",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Выбор числа уровней и материалов экранирования осуществ­ляется с учетом:",
    "answers": [
      {
        "text": "b,c,d,e",
        "isCorrect": false
      },
      {
        "text": "a,b,c,d",
        "isCorrect": true
      },
      {
        "text": "a,b,d,e",
        "isCorrect": false
      },
      {
        "text": "a,c,d,e",
        "isCorrect": false
      },
      {
        "text": "a,b,d,e",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Какой из основных принципов является общим при разработке алгоритмов, программ и аппаратных средств.",
    "answers": [
      {
        "text": "Создание перспективных направлений.",
        "isCorrect": false
      },
      {
        "text": "Дублирование разработки",
        "isCorrect": true
      },
      {
        "text": "Шифрование информации.",
        "isCorrect": false
      },
      {
        "text": "Угрозы.",
        "isCorrect": false
      },
      {
        "text": "Современные технологии программирования.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Этот принцип предполагает поэтапное выявление ошибок и закладок определенного класса.",
    "answers": [
      {
        "text": "Принцип многослойной «фильтрации»",
        "isCorrect": true
      },
      {
        "text": "Принцип контроля адекватности.",
        "isCorrect": false
      },
      {
        "text": "Принцип шифрования.",
        "isCorrect": false
      },
      {
        "text": "Принцип программирования.",
        "isCorrect": false
      },
      {
        "text": "Принцип автоматизации разработки.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Под ………………. разработки алгоритма программы или устройства понимается независимая (возможно разными организациями) разработка одного и того же блока.",
    "answers": [
      {
        "text": "автоматизацией.",
        "isCorrect": false
      },
      {
        "text": "тестированием.",
        "isCorrect": false
      },
      {
        "text": "отладкой.",
        "isCorrect": false
      },
      {
        "text": "дублированием",
        "isCorrect": true
      },
      {
        "text": "фильтрацией.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Это средство является универсальным для проверки, как адекватности, так и работоспособности блоков.",
    "answers": [
      {
        "text": "Многослойная фильтрация.",
        "isCorrect": false
      },
      {
        "text": "Дублирование информации.",
        "isCorrect": false
      },
      {
        "text": "Тестирование",
        "isCorrect": true
      },
      {
        "text": "Контроль адекватности.",
        "isCorrect": false
      },
      {
        "text": "Автоматизация разработки.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для разработки программных средств, свободных от ошибок и закладок, необходимо выполнение одного из условий:",
    "answers": [
      {
        "text": "b,c,d,f",
        "isCorrect": false
      },
      {
        "text": "a,b,d,f",
        "isCorrect": true
      },
      {
        "text": "a,b,d,f",
        "isCorrect": false
      },
      {
        "text": "a,c,d,f",
        "isCorrect": false
      },
      {
        "text": "a,b,c,f",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является одним из центральных понятий ООП?",
    "answers": [
      {
        "text": "Хэш-функция.",
        "isCorrect": false
      },
      {
        "text": "Класс",
        "isCorrect": true
      },
      {
        "text": "Программирование.",
        "isCorrect": false
      },
      {
        "text": "Многослойная фильтрация.",
        "isCorrect": false
      },
      {
        "text": "Фильтрация.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Данная система создается на базе локальной вычислительной сети",
    "answers": [
      {
        "text": "Система администраторов.",
        "isCorrect": false
      },
      {
        "text": "Система контроля целостности.",
        "isCorrect": false
      },
      {
        "text": "Система многослойной «фильтрации».",
        "isCorrect": false
      },
      {
        "text": "Система процесса контроля разработки.",
        "isCorrect": false
      },
      {
        "text": "Автоматизированная система",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Какие рабочие станции входят в состав ЛВС?",
    "answers": [
      {
        "text": "Сервер администратора и сервер программиста.",
        "isCorrect": false
      },
      {
        "text": "Станции программистов и сервер администратора",
        "isCorrect": true
      },
      {
        "text": "Станции программиста и станции администратора.",
        "isCorrect": false
      },
      {
        "text": "ЭВМ программиста и ЭВМ администратора.",
        "isCorrect": false
      },
      {
        "text": "Сервер программиста и станция администратора.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Что является одним из наиболее эффективных путей обнаружения закладок и ошибок в разрабатываемых программных средствах.",
    "answers": [
      {
        "text": "Создание автоматизированной системы.",
        "isCorrect": false
      },
      {
        "text": "Создание специализированных систем.",
        "isCorrect": false
      },
      {
        "text": "Создание многослойной фильтрации.",
        "isCorrect": false
      },
      {
        "text": "Создание автоматизации разработки.",
        "isCorrect": false
      },
      {
        "text": "Создание контрольно-испытательного стенда",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Данный модуль учитывает возможные угрозы, ограничения на входную информацию и результаты тестирования на предыдущем шаге.",
    "answers": [
      {
        "text": "Модуль конфигурации модели системы.",
        "isCorrect": false
      },
      {
        "text": "Программные модули реальной системы.",
        "isCorrect": false
      },
      {
        "text": "База данных моделей программных модулей.",
        "isCorrect": false
      },
      {
        "text": "Модуль анализа результатов тестирования.",
        "isCorrect": false
      },
      {
        "text": "Модуль формирования входных воздействий",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Под доступом к оборудованию понимается",
    "answers": [
      {
        "text": "охрана помещений, в которых находятся аппаратные сред­ства КС.",
        "isCorrect": false
      },
      {
        "text": "противодействие   несанкционированному   подключению оборудования.",
        "isCorrect": false
      },
      {
        "text": "защита внутреннего монтажа, средств управления и ком­мутации от несанкционированного вмешательства.",
        "isCorrect": false
      },
      {
        "text": "доступ всем пользователям.",
        "isCorrect": false
      },
      {
        "text": "предоставление субъекту возможности выполнять определенные разрешенные ему действия с использованием указанного оборудования.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "При организации доступа к оборудованию пользователей, операторов, администраторов выполняются следующие действия:",
    "answers": [
      {
        "text": "b,d,e.",
        "isCorrect": false
      },
      {
        "text": "a,b,c.",
        "isCorrect": false
      },
      {
        "text": "c,e,d.",
        "isCorrect": false
      },
      {
        "text": "a,e,d.",
        "isCorrect": false
      },
      {
        "text": "a,c,e",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Для идентификации субъекта доступа в КС чаще всего ис­пользуются атрибутивные идентификаторы. Выберите правильный ответ:",
    "answers": [
      {
        "text": "d,e,f",
        "isCorrect": false
      },
      {
        "text": "a,b,f",
        "isCorrect": false
      },
      {
        "text": "a,c,e",
        "isCorrect": true
      },
      {
        "text": "c,d,e",
        "isCorrect": false
      },
      {
        "text": "a,d,e",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Этот прибор, вырабатывает псевдослучайную буквенно-цифровую последовательность (слово).",
    "answers": [
      {
        "text": "Съемные носители информации.",
        "isCorrect": false
      },
      {
        "text": "Пароль.",
        "isCorrect": false
      },
      {
        "text": "Пластиковые карты.",
        "isCorrect": false
      },
      {
        "text": "Механические ключи.",
        "isCorrect": false
      },
      {
        "text": "Жетон",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Под ……………….. понимается процедура получения контрольной харак­теристики двоичной последовательности, основанная на кон­трольном суммировании и криптографических преобразованиях.",
    "answers": [
      {
        "text": "хэш-функцией",
        "isCorrect": true
      },
      {
        "text": "отладкой.",
        "isCorrect": false
      },
      {
        "text": "дублированием.",
        "isCorrect": false
      },
      {
        "text": "паролем.",
        "isCorrect": false
      },
      {
        "text": "механическими ключами.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Итерационный процесс вычисления хэш-функции Н преду­сматривает:",
    "answers": [
      {
        "text": "b,c,e",
        "isCorrect": true
      },
      {
        "text": "a,b,c.",
        "isCorrect": false
      },
      {
        "text": "a,c,e.",
        "isCorrect": false
      },
      {
        "text": "a,e,d.",
        "isCorrect": false
      },
      {
        "text": "b,e,d.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Стартовый вектор кэширования представляет собой дво­ичную последовательность длиной",
    "answers": [
      {
        "text": "128 бит.",
        "isCorrect": false
      },
      {
        "text": "128 байт",
        "isCorrect": false
      },
      {
        "text": "256 байт.",
        "isCorrect": false
      },
      {
        "text": "256 бит",
        "isCorrect": true
      },
      {
        "text": "12 байт.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Одним из возможных путей несанкционированного изменения технической структуры КС является подключение незарегистри­рованных устройств или замена ими штатных средств КС. Для парирования такой угрозы используются следующие ме­тоды:",
    "answers": [
      {
        "text": "a,d",
        "isCorrect": true
      },
      {
        "text": "a,e.",
        "isCorrect": false
      },
      {
        "text": "a,c.",
        "isCorrect": false
      },
      {
        "text": "b,d.",
        "isCorrect": false
      },
      {
        "text": "b,c.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Злоумышленник  осуществляет несанкционированный доступ к информации, используя: a) сведенья о системе защиты информации, b) знания о КС и умение работать с ней, c) сбои, отказы технических и программных средств, d) ошибки, небрежность обслуживающего персонала и пользователей, e) сведенья общедоступной информации о предприятии.",
    "answers": [
      {
        "text": "b, e, d, c",
        "isCorrect": false
      },
      {
        "text": "a, b, c, e",
        "isCorrect": false
      },
      {
        "text": "a, b, c, d",
        "isCorrect": true
      },
      {
        "text": "a, e, d, b",
        "isCorrect": false
      },
      {
        "text": "a, c, d, e",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Для защиты информации от несанкционированного доступа создается:",
    "answers": [
      {
        "text": "система разграничения доступа  к информации.",
        "isCorrect": true
      },
      {
        "text": "система отражающая информацию.",
        "isCorrect": false
      },
      {
        "text": "система закрытого доступа.",
        "isCorrect": false
      },
      {
        "text": "система ограничения информационной безопасности.",
        "isCorrect": false
      },
      {
        "text": "система открытого доступа.",
        "isCorrect": false
      }
    ]
  },
  {
    "question": "Система защиты информации от несанкционированного доступа включает в себя подсистемы:",
    "answers": [
      {
        "text": "система разграничения доступа и система защиты от копирования.",
        "isCorrect": false
      },
      {
        "text": "система защиты от исследования и копирования.",
        "isCorrect": false
      },
      {
        "text": "система защиты от исследования и копирования и система открытого доступа.",
        "isCorrect": false
      },
      {
        "text": "система разграничения доступа и система защиты от исследования.",
        "isCorrect": false
      },
      {
        "text": "система разграничения доступа и система защиты от исследования и копирования.",
        "isCorrect": true
      }
    ]
  },
  {
    "question": "Правило разграничения доступа заключается в следующем: лицо допускается к работе с документом только в том случае, если…….?",
    "answers": [
      {
        "text": "уровень  допуска субъекта доступа выше уровня  конфиденциальности документа.",
        "isCorrect": false
      },
      {
        "text": "уровень допуска субъекта доступа не равен уровню  конфиденциальности документа.",
        "isCorrect": false
      },
      {
        "text": "уровень допуска субъекта доступа ниже уровня  конфиденциальности документа.",
        "isCorrect": false
      },
      {
        "text": "уровень допуска субъекта доступа равен уровню  конфиденциальности документа.",
        "isCorrect": false
      },
      {
        "text": "уровень допуска субъекта доступа равен или выше уровня  конфиденциальности документа.",
        "isCorrect": true
      }
    ]
  }
];

// Экспорт для использования
if (typeof window !== 'undefined') {
    window.innovationQuestionsNew = innovationQuestionsNew;
}
